[{"id": 1415155776, "author": "ee1f22e9-90d6-37a7-acf4-24a7e4091136", "date": "2021-06-04", "hours": 71, "content": "This game was a blast, it is a different styled persona in comparison with the others but overall has unlimited fun into it. My thoughts on it:\n\nPros:\n+ Beautiful visuals and animations\n+ Fun and entertaining gameplay\n+ Zenkichi being a cutiepie\n+ Mechanics are smooth and very fun to play with\n+ Sofia is wholesome\n+ i could go on and on with the pros in this game, personally loved it\n\nIn my own experience i found nothing to be too annoying in the game but some small things are: \n- Not many personas. The game has plenty of personas dont get me wrong, but i would love to have seen some more personas as in the riders or some of the other dragon personas as in seiryu etc.\n\n- In combat you will find yourself sometimes flying around the place doing attacks which can confuse you or put u off guard on which button combo you are doing as u may be in the boss a** and cant see anything.\n\n- In combat sometimes when activating a phantom dash to connect an attack it would register the dash on a minion 5m away from the target you are going for, even if the target is right in front of u sometimes it will do this, but not as much so its not that big of a negative.\n\n- Game is fairly small, even tho i have 70 hours on it, still it feels a bit small especially when playing in new game+ where u will end up skipping dialogue and cutscenes. I played a new game+ run and completed it in a single day. But nonetheless not that big of an issue, when playing for the first time it will net u a good 50+ hours which isnt bad at all, and it all depends on how you progress the game ( in a good pace or not )\n\nOverall this is my 3rd persona game i played from the series, the first i ever played was 5 and my current favorite being 4, i say its a solid game just like the others, managed to even 100% this alongside persona 4 golden, so for the achievement hunters out there i would recommend this game as its mostly grind than difficult, but not as grindy as persona 4 golden or persona 5. Other than that i fully recommend this game, and a bit sad that i finished it.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1941049589, "author": "ec296a31-6dd8-32ff-91c0-47e910bb508c", "date": "2021-06-04", "hours": 51, "content": "Cat simping on a girl \nd#mn this cat be hella horny", "comments": 1, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2976489783, "author": "3e6b58ac-f124-3d82-b8a8-e3c5e66d16ba", "date": "2021-06-04", "hours": 6, "content": "Now we have to wait till P5 Royal releases!", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2230122069, "author": "18d01af7-28c5-3dde-bbda-35af63d61209", "date": "2021-06-05", "hours": 64, "content": "A new take on the persona games that retains its values from said games that has a slow start but once the story picks up it becomes more enjoyable. I had a lot of fun playing this and I loved the music. Bosses are fun and challenging as well. It's a great game that's worth the time.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3498854867, "author": "2aba0181-8b8d-301d-9b7c-2d0c9a821484", "date": "2021-06-05", "hours": 133, "content": "a", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3943695679, "author": "2b79b666-7181-3380-9eb7-4c09e94f3f31", "date": "2021-06-05", "hours": 51, "content": "Meowgana.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3992258899, "author": "473fb103-ce89-3dff-a05b-f0bf44537b52", "date": "2021-06-05", "hours": 85, "content": "Ahh, Persona 5 Strikers, I've been wanting to get my hands on you for awhile, and now that I have, I can finally write a review. Now, I highly recommend you at the very least watch a playthrough of the original Persona 5 (Or Persona 5 Royal) first before picking this game up, as it's a direct sequel to Persona 5. I won't be covering the story of Strikers much in this review either.\n\nPersona 5 Strikers takes place after the events of Persona 5, you once again play as Joker, as you and the rest of the Phantom Thieves travel around Japan for the Summer. That's pretty much the premise.\n\nThe gameplay is very different from the mainline games, Persona 5 Strikers is a Hack and Slash with RPG elements. The gameplay itself I found quite fun, and I definitely found a few of the battles a bit challenging, even on normal difficulty. \n\nOne of my favorite parts gameplay-wise is that I never ever felt the need to grind for experience. I never felt too underleveled or too overleveled. The game also reintroduces Persona fusion. And while not as vast as the mainline games, it was still quite robust and intuitive. Dare i say, some aspects of the fusion I liked more compared to Persona 5. \n\nWithout getting into it, the story was really good, on-par with most persona games. I found myself invested in not only the characters i'm familiar with, but also the newly introduced ones. And there were a lot of moments that made me visibly happy, sad, angry, and so on. And that's a sign that they did something right.\n\nContent-wise, this game has quite a bit. It only took me roughly 40 hours to beat from start to finish over the course of four days, then again I played it practically nonstop when I bought it. I'm a bit of a Persona fanboy, haha. \n\nI do also plan on completing this game 100%, definitely. This game has quite a lot you can do in it, even in post-game you still got some stuff left.\n\nThe english voice acting was fantastic. I plan to play the game again in Japanese to compare, but I just LOVE the english voice cast so much, some of the deliveries were on point, and I laughed out loud quite a bit at many lines.\n\nOf course, I can't talk about a Persona game without addressing the best part about the series. The music.\n\nGood GOD the music. It's fantastic! The music is a LOT more fast paced compared to the mainline games. All the battle tracks get me absolutely hyped to fight. And the remixes of songs like Last Surprise and Rivers in the Desert, among others, were done amazingly well! I could listen to each track for hours and NEVER get tired of it! \n\nI did yoink the deluxe edition though, which means I got two DLCs along with the base game! So I'll cover that next.\n\nThe first DLC was the all-out attack pack, it gives you a bunch of skill cards, along with 10,000 Persona points you can use to level personas up. The skills cards were nice, but also a bit unnecessary since the game is quite generous with it's skill cards, doesn't really justify the need for the price tag. \n\nThere's also the BGM DLC, it adds tracks from various persona mainline games. In my opinion, this is the better DLC option of the two. Changing the BGM can help change battles up a bit, and the fact that they remixed the battle theme from Revelations: Persona just for this game says a lot to me.\n\nThe Deluxe edition also came with bonus content on the side! Such as the soundtrack, a digital art book, and Behind-the-scenes footage! Which I find really cool! Watching the footage gives you a glimpse as to how much passion went into the game, and I enjoyed watching it!\n\nNow that all that's been said, let's get into the issues I had with this game, it's mainly bugs and small issues though.\n\nOne of the biggest things i experienced was audio issues, in-game audio was cutting in and out, along with crackling and stuttering. This is most apparent when I went to shop for things and bought things over and over in quick succession, or when I was in a menu like the compendium and scrolling down from the top to the bottom really quickly. This also happens in animated cutscenes, which kind of breaks the flow of everything, unfortunately. It never happened that often during normal gameplay, but it was often enough to the point that it ended up being really distracting, Although it was extremely rare, the game would also crash, which definitely was a bit frustrating when it did happen. A smaller thing was various instances of voiced dialogue not matching the text box, and lastly, audio balancing with the english voices. Sometimes the english voice acting is hard to understand, they sound too quiet, even had to turn the music down so i could hear the voice acting. This was mostly apparent with soft spoken voices. I'm not too mad at the audio balancing though, since they were recorded during a global pandemic, so that's something I can let go. That's pretty much it with my issues. \n\nAll in all, if you don't wanna deal with the audio issues and rare crashes, then I recommend getting the PS4 version, as it's probably the best version of the game. But if you don't mind the issues and want the convenience of having it on your PC, or you don't have a PS4 or Switch, then get this version, it's still worth it! The game is not only a fantastic one, but it's also a fairly stable port! I didn't ever have any problems with framerate either, which is a plus! This game receives a 9/10 from me!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1935122024, "author": "d212f497-e02b-3e74-854a-222293236275", "date": "2021-06-06", "hours": 40, "content": "Persona 5 Strikers is a strong recommend for fans of Persona 5 (P5), but I don't think the game will be nearly as enjoyable for people who aren't familiar with P5's characters or the Persona franchise in general. The combat was surprisingly fun for me, as I don't really enjoy this particular genre of gameplay (previously played Dynasty Warriors and Fire Emblem Warriors), but it isn't good enough if you don't know anything else about what is going on in the game. \n\nBut I am a fan of P5 and the Persona franchise, so I really enjoyed spending more time with these characters and meeting new ones. The story is good enough but I was craving a more personal connection between the plot and the heroes. The story was more intimate and impactful in P5. \n\nWhat I missed most from P5 was the time management and relationship building portion of the game, but this did make Strikers much easier to get through and it was a very focused experience. So while I would have liked to see more of this in a Persona game, I ultimately don't think it took much from the experience.\n\nSo an easy recommend from me, with the caveat that I think this game has a very specific audience.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3059924142, "author": "0dfd7868-af93-3b4e-9c15-8aaec72504ec", "date": "2021-06-06", "hours": 7, "content": "really disappointing. It's a bad dynasty warriors game with a Persona skin, and it's a shame because it's one of the only 2 games titled \"Persona\" on PC. If you're interested in the series but never tried it before because of Sony exclusivity, just get Persona 4 Golden instead.", "comments": 0, "source": "steam", "helpful": 7, "funny": 5, "recommended": false, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3809818674, "author": "8319f9f5-44bf-3077-84ea-4c510bcf7f89", "date": "2021-06-06", "hours": 42, "content": "I really enjoyed the hack'n'slash take on persona. I also really liked how you were able to play as your party members and were able to swap them out as needed.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1914595612, "author": "860ff5bb-0988-368c-a200-2d4300531ce2", "date": "2021-06-07", "hours": 58, "content": "This game is based and ryujipilled. 10/10", "comments": 0, "source": "steam", "helpful": 63, "funny": 10, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3157826355, "author": "e79f49c6-d04a-32bf-a205-f531ee28eda3", "date": "2021-06-09", "hours": 107, "content": "steam awards task", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3943254094, "author": "95b1035a-7641-3934-895a-5c2de23ced6c", "date": "2021-06-09", "hours": 117, "content": "This was a really good game. Pretty good successor to P5, but there are little bits of this game that suck. One achievement in particular sucks. I would recommend playing P5/P5R before playing this game to get to get the most of it. Combat is way different but I kinda like it.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 663444105, "author": "b5443421-7dc6-3fd9-97e9-fb16c2c0d935", "date": "2021-06-10", "hours": 97, "content": "Makoto is Hot.", "comments": 0, "source": "steam", "helpful": 2, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1009833522, "author": "25a01233-cc37-344a-8c7c-e8c86c431a7b", "date": "2021-06-10", "hours": 49, "content": "Major persona vibes", "comments": 0, "source": "steam", "helpful": 160, "funny": 89, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3211148101, "author": "d3329444-6d41-337c-aec2-b3dc95ba1928", "date": "2021-06-10", "hours": 36, "content": "its fine i guess", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2242007546, "author": "801ff27e-96b8-3003-a757-c77c0aa366a8", "date": "2021-06-11", "hours": 29, "content": "T", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3453842641, "author": "74aee6db-2904-3f7b-b220-34c18b1b321e", "date": "2021-06-12", "hours": 10, "content": "this game is very fun, 100% worth the money if you ask me.", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2212305141, "author": "2be70fc1-3fb2-3ebd-8bd3-217c99371d5b", "date": "2021-06-13", "hours": 63, "content": "Ryuji says very bad word. 10/10", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 76009839, "author": "0f16cf62-335f-3bf1-9428-d51b93df727b", "date": "2021-06-14", "hours": 39, "content": "Good", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2030238373, "author": "deefbe0e-a88e-3f89-915b-c16a6e928d9e", "date": "2021-06-14", "hours": 43, "content": "u can beat up japanese tony stark in a mech suit with cool music so good game", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3229412342, "author": "e064eb30-94b6-3676-959b-c9fedf08f5c5", "date": "2021-06-14", "hours": 44, "content": "if you buy this game you will be 7'6\" the next day", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3825716984, "author": "7d9a68a0-1f5b-3f99-aec7-52fbdb0151e5", "date": "2021-06-14", "hours": 113, "content": "haru is hot", "comments": 1, "source": "steam", "helpful": 41, "funny": 11, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2004992924, "author": "5b83c6a7-66ff-3e5b-a204-5d270effbc9a", "date": "2021-06-16", "hours": 122, "content": "I pre-bought this game, so I was really hyped for it.\nMaking this review because I forgot to do it when i ended it.\npretty poggers game ngl, morgana is still alive and simping so it's really enjoyable", "comments": 0, "source": "steam", "helpful": 2, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3535528780, "author": "9ade656b-61c3-3587-9f14-f5c192187e2f", "date": "2021-06-16", "hours": 57, "content": "A game that goes beyond its inspiration, and accomplishes something truly special.\n\nAs Strikers is a sequel to a game that isn't yet on PC, I feel obligated to say that there will be marginal spoilers for the original Persona 5 and Royal here, at least insofar as areas that I will be directly comparing to with Strikers.\n\nI'm a huge fan of Persona, and cited Persona 4 Golden as my #1 favorite game of all time until only a year or two ago. I love the focus on slice-of-life melodrama and cheese mixed with 'friendship is the true power!' anime goodness. The music is always god-tier, and the cast of characters are almost always endearing beyond easy comparison in the genre. \n\nTo say Persona 5 was a disappointment isn't exactly fair, but there were plenty of areas it fell short in, not just in relation to its predecessors, but entirely within its own goals, that I still talk about with my partner to this day. While its invention of an entire district called 'Shibuya' was no doubt innovative for the medium, spawning many spinoffs such as The World Ends With You or even a widespread effort in 1990's Tokyo to more closely mimic the buildings seen here, unfortunately that same inspiration couldn't be seen in the pacing and intricacies of its narrative. To go into greater detail here would be straying closer to writing a review of Persona 5 rather than Strikers, but I'll simply say that as the credits rolled on 5, I was filled with no great desire to ever see the Phantom Thieves again. \n\nThen Strikers came along and- I wish I could come up with a better phrase- stole my heart.\n\nStrikers' abandonment of the Social Link and time management systems that dominate the mainline Persona entries was publicized well beforehand, which caused me to be much more reticent about picking up the game. Would plot be taking a backseat? Would these already thin characters be reduced to little more than an aesthetic for Musou combat? \n\nIf those same worries assail you, please believe me when I say nothing could be further from the truth.\n\nThe Phantom Thieves flourish under a much sharper and much more tightly-written story here than in their own debut. While nothing deeply shellshocking for the genre, the plot has plenty of emotional gravitas, culminating not just in these pre-established heroes. but in practically every new addition to the cast. People act like human beings here, not 'shitty adults' or plot automatons. The core party has chemistry and plays off of each other brilliantly, and are even given actual time to enjoy themselves and more fully indulge their personalities beyond the most surface-level of jokes based on their eccentricities. \n\nThis story works in tandem with an absolutely phenomenal combat system. I've only had a very slim amount of experience with Musou games in the past, so I can't draw many comparisons, but I will say that simply getting through by button mashing is an impossibility. If you want to get through specific minibosses or even regular enemy encounters past the first few hours, you have to apply constant thought to your actions, thinking a few steps ahead, just like in JRPGs, while also honing your instincts and committing combos to muscle memory. It's an extraordinarily well-done fusion of genres that I very sincerely consider to rival the best in the business. Neither the turn-based roots nor the slasher reworks overshadow each other; instead, they compliment each other like sunlight illuminating a pane of stained glass, revealing how each individual facet constitutes a brilliant whole. \n\nI absolutely adore Strikers, and would argue it as better as most of the other games in its series, mainline, or spinoff. It understands its heroes' motivations better than the original game's writers, presents a beautifully innovative combat system, and strings along a truly magnificent score to lend each and every moment even greater impact. It's a masterwork of a title, and definitely the best game I've played so far this year.\n\nWell worth every last penny, and so many more.\n\nThese devs deserve a raise.", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1839323579, "author": "255eecea-d9e4-3787-8d6c-17f79d31244c", "date": "2021-06-17", "hours": 84, "content": "sophia now best girl sorry makoto", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 154679220, "author": "6e954cc9-81aa-33e5-9f62-d37460c4a1a1", "date": "2021-06-18", "hours": 46, "content": "Despite its flaws, honestly a pretty good sequel/spin-off to Persona 5. Probably one of the best spin-offs we'll get of a persona game, it's just pretty solid all around.\n\nThe cast of characters from the original game are just as enjoyable as they were before, and I really like the new additions of Zenkichi and Sophia, they're pretty great as well. Especially Zenkichi, he's probably one of my favourite Persona characters now. \n\nMusic is amazing as usual in this franchise, all of the battle themes are bangers, even the music in some of the cities are really great to listen to as well. \n\nGameplay is where I think I had a few problems with, as well as the story. The combat whilst being fun at times, I felt like could of been improved slightly or perhaps just not as repetitive as it was. Whilst I liked the action combat this time around instead of the turn based system in the original game, the novelty of it got old quick for me at least, and I didn't really enjoy it towards the later parts of the game. It's not bad, I just think it could be improved slightly (even if I'm not really sure how? I felt like sometimes the combat was just spammable sometimes with certain moves, or doing different combos weren't really rewarding). I still think how they implemented Personas in the combat was still pretty well executed though, but perhaps could of reduced some of the SP drain, as I felt that sometimes was pretty hard to manage at times. \n\nThe jail designs were pretty cool, but most of the time, I didn't really think too much of them as level designs. They weren't bad or anything, just nothing really memorable. \n\nThe story, even though I enjoyed most of it, felt formulaic and VERY similar to the original's. It's not bad, but perhaps slightly unoriginal and predictable times. Still felt it was interesting to go through though, and was definitely better than what I was expecting. \n\nOverall, I personally really enjoyed P5S despite its flaws. Honestly a pretty good spinoff to Persona 5, and you HAVE to have played the original to enjoy the game in my opinion, as it'll spoil you quite a bit of what happened in the original, and you'll miss some of the references. If you didn't like the original Persona 5, then I can't really recommend this game to you. If you were a huge fan like me of the original however, DEFINITELY get this game, you'll probably really enjoy it.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1652275650, "author": "aef23a5e-6ac5-3e36-aa78-d08464ab1c06", "date": "2021-06-18", "hours": 52, "content": "lmoa its like mario\n I changed my mind its like kirby now", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3686366304, "author": "523aaa45-6f50-38e8-a75c-561cf064f244", "date": "2021-06-18", "hours": 83, "content": "After a lot of struggling, I decide not to recommend this game. It is hard to argue the game is totally terrible, but I spent 80+ hours on it.  However, I do want to point out some fatal issues with this game which lead to my decision. First, the plot is filled with cliche. The story is highly predictable and boring. Second, personas play an awkward role in the combating system: on the one hand, creating/upgrading personas is so complicated, but personas are not necessary for non-merciless fights. So, it seems that there is a complicated system of personas that you would feel that it must mean something, but it actually does not really make much change until you play the merciless mode. On the other hand, once you play the merciless mode, the fight is unnecessarily hard and tedious without the proper personas, yet, the right personas basically make fights as a cycle of releasing persona skills, refilling sp and releasing skills again. I found myself push the same 3-4 buttons in the same order for 5 minutes to complete a boss fight in the merciless mode, which is boring. The creator failed to strike a balance between non-merciless game and the merciless game as well as the fight with and without strong personas. As an action game, fighting is one of the most important elements, failing to deliver challenging yet enjoyable fights makes the greatest failure of this game.", "comments": 0, "source": "steam", "helpful": 17, "funny": 3, "recommended": false, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 100983429, "author": "5b1885b8-a404-3a23-a669-c6b9ec148457", "date": "2021-06-20", "hours": 111, "content": "Persona 5 Strikers is a great sequel to Persona 5. The story feels like a wonderful continuation of what the original Persona 5 had to offer, and its unique combat style as an installment of a series of turn-based JRPGs gives players a fresh way to enjoy the Phantom Thieves as they jump back into action stealing hearts all over Japan. Everything this game offers, from the opportunity to experience characters I know and love once again to the absolutely amazing soundtrack fitting of the Persona 5 atmosphere, has me completely satisfied. I would definitely recommend this game to anybody who enjoyed Persona 5 and wishes to see the characters developed further (especially Haru).", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1654927328, "author": "9cfcbe4d-8393-3294-b28b-d8d8410dab82", "date": "2021-06-20", "hours": 30, "content": "That's what the mask is\nThat's what the point of the mask is", "comments": 0, "source": "steam", "helpful": 1, "funny": 2, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3339167515, "author": "507db7ec-ff44-3fde-b643-dd7296a43c41", "date": "2021-06-20", "hours": 94, "content": "Look, I'm sorry, but you CANNOT fuck the cat in this game. No matter how much you may want to, no matter how much they tease you with his supple behind, you cannot, and I repeat, CANNOT FUCK THE CAT. Anyway I enjoyed the game overall and my favorite jail was probably the Osaka one, it gave me some serious Tron vibes. Also I've nearly 100%ed the game, so there's that. But that was all in my quest to FUCK the CAT that you CANNOT FUCK.", "comments": 0, "source": "steam", "helpful": 1, "funny": 2, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 500402602, "author": "eb08601e-dfb6-3014-8bae-32fe24f88997", "date": "2021-06-21", "hours": 66, "content": "Haru with an axe doing Haru with an axe things", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 185216721, "author": "ac080c5b-d872-38b3-912e-b86b6022f6da", "date": "2021-06-22", "hours": 89, "content": "Sophia during the last jail says \"Imposter\". Now I don't know about you but I like me some Among Us! I know that this will not be funny to some of y'all. But Among Us is one of my favorite indie titles. This is all I have to say. I would honestly give this game a try just because of this scene.", "comments": 2, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 192198289, "author": "f21e993e-8e31-38a0-8e69-e73e0993307a", "date": "2021-06-23", "hours": 7, "content": "This gave me major Shin Megami Tensei vibes!", "comments": 0, "source": "steam", "helpful": 2, "funny": 5, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1046145951, "author": "6cc4f33f-e192-3913-9a46-b8a804b6e072", "date": "2021-06-23", "hours": 47, "content": "We WANT ROYAL!", "comments": 0, "source": "steam", "helpful": 771, "funny": 18, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3339012077, "author": "58de1927-de3c-3206-b8d4-bd5e6598ae61", "date": "2021-06-23", "hours": 127, "content": "All the new songs and remixes of the old ones are insane, just like the in the other persona game(at least p3+), especially the new track Daredevil.\n\nThe gameplay is on the same level as original persona 5. i really recommend doing your first playthrough on normal and then play it on merciless new game plus, enemies scale with your level there, so its the difficulty where you actually experience the combat.\n\nFor optimization, its nearly perfect, i ran it on Radeon HD7800 series(gpu from like 2013 that is also in ps4) and i was getting 60 fps 95% of the time. If you have some stronger gpu put the resolution on 4k because the game either has dogshit or no antialiasing at all.\n\nStory. Its a persona game, Also play the original Persona 5 before this, because its gonna spoil a shit ton for you, and you also wont know who is who and why is what happening.\n\nOnly thing i kind of didnt like about it, is the forced \"Fuse by Result\" fusion option from other games, and that to fuse some higher level personas you had to level some level 15 persona to 65, good you can boost them with ingame money(which is the only actual way to level them up because the xp they are getting is miserable).\n\nOverall i rate this game 10/10 a perfect sequel, i dont regret spending 60 euro on this.\n\n\ntips:  If you get stuck on the first bicorn miniboss because he oneshots you, its ok, just try killing him until you do it, and then you can continue enjoying the rest of the game. The goat is busted as fuck, he ís like 2 times harder than any other miniboss, or maybe even as hard as an actual boss.\n        If you bought the old songs dlc, go to settings>game settings and scroll until you see what soundtrack you want to listen to. Select random. If you dont like some of the songs in there, you can turn them off.\n        After you defeat the final boss and watch the credits, your save will say the game is completed, but it really isnt. Load it, and you will get called to the velvet room where lavenza tells you to kill all the bosses again, and when you kill them, you will get a request for killing The Reaper, if you do that, you will get an achievement, and will be able to play ng++\n       You will transfer everything, except for some story items to new game plus, including your level money and compendium, so if you finish the first playthrough at level 80, you will get level 90 and fuse lucifer in no time.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3765381585, "author": "911f169d-ea5e-34e8-b7b5-5cf92e76a3e1", "date": "2021-06-23", "hours": 76, "content": "P5R when", "comments": 0, "source": "steam", "helpful": 191, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4171500967, "author": "7734efd6-a498-3769-82bc-44943859ce2c", "date": "2021-06-23", "hours": 109, "content": "One of the best jrpgs ive ever played, blew away my expectations very much, for a spin off i expected a lackluster story, ok gameplay, and forgettable characters, but i was very wrong, this game is extremely fun, the story is nearly as good as persona 5s, and the new characters all are very fleshed out and seem like they belong, if liked persona 5 you will almost definitely like this", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3328530955, "author": "3bd3a5b9-fe20-3f36-b5a9-8ddb6c3da94a", "date": "2021-06-24", "hours": 45, "content": "8.5/10 would take Makoto out on a date again.", "comments": 0, "source": "steam", "helpful": 5, "funny": 2, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 177699839, "author": "7d7797c2-3164-37e1-8a0e-7b401a6420c1", "date": "2021-06-25", "hours": 37, "content": "You can't fuck the teacher anymore", "comments": 9, "source": "steam", "helpful": 224, "funny": 401, "recommended": false, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 417082237, "author": "c293dd40-b237-3a9b-9aee-878e259fede0", "date": "2021-06-25", "hours": 103, "content": "What if you took Persona 5, made the writing/story a little worse, but made it an Action RPG with twice as fun gameplay? Persona 5 Strikers, both a sequel and successor to the original Persona 5. Regular Persona combat will never do it for me ever again. This is NOT a Musou-style game any more than Nier games are.\n\nMy attention span with games is not always the best past 30-40 hours. Even the original Persona 5 started to become a slog by the end. Meanwhile, Persona 5 Strikers is the first game I have ever 100% and beaten on the maximum difficult in my life.", "comments": 0, "source": "steam", "helpful": 5, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1256048876, "author": "525aa84c-cdad-3a29-8cb0-ffd5974a2ef8", "date": "2021-06-25", "hours": 71, "content": "[h1] Well first things First, [/h1]\n\n You need to beat or watch (a play-through I heard the anime isn't too hot) Persona 5 to get some real enjoyment out of this game but you don't necessarily need to do the same with Persona 5 Royal. From what I played, there's no real spoilers from Royal I think but there could be secrets that I don't know about.  So playing royal isn't necessary but probably gives some extra flavor with some interactions more than likely. \nNow you might be asking yourself\n\n [i] Why do I need to play or watch Persona 5? [/i]\n\n well my good sir, ma'am or whatever pronouns align yourself with, this game is essentially more Persona 5 with a side of dynasty warriors game-play instead of that classic turn-base Persona Flavor. [b] If you haven't played or watched Persona 5 this game will not be that entertaining for you! You'll be buying a game that's basically an extra chapter to the Persona 5 story. If you have done so then the bold section does not pertain to you. [/b] Continuing on, You're not about to get all of the social simulator mechanics that Persona is known for but you'll be getting the aesthetic, music, and main cast interactions from it. If you want more of that this game is for you as this game is filled to the brim with fan-service but not the NSFW variety SO BACK TO TWITTER YOU GO YOU FIENDS, but I'll be joining y'all later.\n\nNow the for the main game-play...\n\nIts not for everyone.\n\nThe Dynasty Warriors formula is not the most responsive game-play of the bunch. At times you'll swatting away at a boss with long health bars for minutes on end. Luckily, they spiced things up by adding some SMT (Shin Megami Tensei a.k.a the series Persona derives from) mechanics which allows you to exploit the bosses weakness to beat them but that also go both ways. If you choose the wrong party for a fight some of your party members will get erased from the surface of the earth but if you already played Persona you'll be used to it. You can still customize your party to whatever play-style that suits you so if you want your Ryuji to be a physical Damage Chad you can do so. In particular with the game-play, I don't like the dodge function in this game, it took me while to understand it but I feel they could done of a better job at implementing it so you can dodge attacks more properly. Despite this though, defeating massive waves of shadows can be therapeutic but as I mentioned its just not for everyone.\n\nUltimately I think you should watch some game-play for a final verdict, Seeing is better than reading and if you see what I'm talking about you might be hooked or save some money in your bank account. If you're missing some Persona though this game is absolute must-buy specially if it get on sale for a better price.\n\nP.S\n\nWith the PC version the game was buggy in the past but since then I believe they patched \n certain things up so if you see any reviews about it being buggy make sure you check the date as the game could of been patched since then or there still could be issues with it. My experience wasn't too bad, I do admit to have issues in the beginning when the game first came out but after a month everything was smooth sailing to the end.", "comments": 0, "source": "steam", "helpful": 65, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2469645520, "author": "baf561b3-a42d-3714-aede-4374156ad439", "date": "2021-06-25", "hours": 25, "content": "a", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3094108715, "author": "a791d2d5-16ef-3fa0-b300-6393837043b4", "date": "2021-06-25", "hours": 58, "content": "Ann FTW", "comments": 0, "source": "steam", "helpful": 5, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3517829386, "author": "b2ee77c1-0fa6-383c-a089-3d5e38e80440", "date": "2021-06-25", "hours": 27, "content": "I wish there was a mixed option for reviews because this is it.\n\nMore Persona 5 :) \n\nBut also\n\nMore Persona 5 :(\n\nAnd also Dynasty Warrior gameplay >:(\n\nwhat I mean by this is that we get to see more of Persona 5, the great music, UI, character design's and its good cast of characters but it still retains the very poor pacing of 5 has as well as its Cliched story arc's but this time there is no life sim so the pacing is EXTREMELY noticeable whereas in 5 you had the life sim part to flow together the pretty hamstrung plot in this its only scripted. You are always fighting with the only time you're not being scripted events, shopping for items or finding clues for a new jail and given this is a Dynasty Warriors game, the gameplay becomes VERY VERY repetitive coupled with the plot makes it feel like I'm being thrown in a loop.\n\nthe gameplay on paper is fun, it embodies some of Persona's original gameplay like weakness abusing and stuff but it just feels so stale coupled with the fact that every Jail feels the same makes this a hard recommendation to even those like me who wanted to see what a Persona 5 sequel would hold.\n\nThis game would've been made so much better if the Life sim part was still a thing and I'm not saying this because I'm one of the fans who plays the games for that reason only I love Persona 1 and 2 and they have no life sim its just that this games plot would've benefited greatly from a little breathing room now and then.", "comments": 1, "source": "steam", "helpful": 12, "funny": 2, "recommended": false, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 101165124, "author": "f4c6fb58-6ef5-3697-a4c8-0d6c6f32a78d", "date": "2021-06-26", "hours": 3, "content": "Now add P5R and P3 fes", "comments": 0, "source": "steam", "helpful": 492, "funny": 12, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 791418550, "author": "6e0e8313-5f7a-3cdc-bd5c-f9d9a41c2bc4", "date": "2021-06-26", "hours": 4, "content": "bug: \n- the game keep running even im already quit the game. need to restart steam to stop it.\n- intermitten fps drop to 1 - 20fps if i connecting my controller (im using gulikit controller), when i remove my controller its working perfectly.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 50330419, "author": "a8fa39d1-f6b1-3494-bf3e-57a594190fc8", "date": "2021-06-27", "hours": 150, "content": "I was a new fan to Persona 5 prior to buying the Scramble having only played 5 I was happy to enjoy a sequel to one of my favorite games. Scramble was simply one of the best follow-up games I've played and if you like anime you'll enjoy the story with engaging gameplay. However if you didn't play P5 you won't be able to follow, and won't have the same connection to the characters unfortunately.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 439044068, "author": "a1eafce0-ff5f-3e0c-8e53-b6a8b93690dd", "date": "2021-06-27", "hours": 23, "content": "Enjoying the game so far, had to change the keybinds as the original controls were to far apart for my comfort. This game has a lot more story then actual fighting, but I would still recommend it. The only major issue i dislike is how I have to play in windowed mode or else the game won't load at all.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 677018036, "author": "301fd815-0044-387d-a827-b5e2eae8aed5", "date": "2021-06-27", "hours": 96, "content": "yes", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2140866492, "author": "af87fc70-6538-3c7c-a8ad-e6f8ed5ea79c", "date": "2021-06-27", "hours": 37, "content": "Spent a romantic evening on a ferris wheel with DA BOIS", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3888182033, "author": "7ec0d925-20e8-394f-91d0-ef3e60c57bc5", "date": "2021-06-27", "hours": 45, "content": "Overall it's not on same level as base P5, but still a decent pickup for anyway who has played the former.\n\nDialog options; why even have them if it makes literally no difference? When you get to choose what to say in Strikers, you're given either three different ways to say the same thing, or one \"correct\" option among several \"incorrect\" options. If you pick the \"incorrect\" option, whoever else is in the conversation shits on you and the game proceeds as if you chose the \"correct\" option. Big step backwards from P5 in this regard. \n\nMenu animations; every time you go in-between menus and submenus, you have to sit through a drawn out animation. They're cool for the first 30s, but quickly become annoying considering the amount of times you're going to be doing stuff inside the menus.\n\nLoading screens; Strikers has made zero progress in the way of reducing the # of loading screens compared to P5, and P5 ran on a PS3...What's worse is having fast storage does nothing to alleviate this because of the loading animations they have in place that must finish playing before you're given control. With each dungeon in the game consisting of what feels like at least 5 subdivisions, expect to waste a lot of time on these.\n\nOn the flip side, in true Persona fashion; the soundtrack is crazy good, and you're left with crippling depression after finishing the game. I'm happy we got another game with the P5 cast, but its saddening to think this is probably the last time we will see these guys..", "comments": 0, "source": "steam", "helpful": 9, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4145030668, "author": "e6f92daf-8707-3aef-88e6-11aeeebd5199", "date": "2021-06-27", "hours": 37, "content": "persona", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 766461083, "author": "0d32406b-ad4d-3d96-a60d-81a27db4b100", "date": "2021-06-28", "hours": 3, "content": "it's good but seriously, just give us P5R. we want to play this game, too. it's so cruel guys,,,,,", "comments": 0, "source": "steam", "helpful": 4, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2833931572, "author": "e79e5254-814c-39cf-ae75-7a5ab0328cc8", "date": "2021-06-28", "hours": 143, "content": "If you loved P5 and P5R this one is a must have in your collection! The combat takes some getting used to as its not turn based like other persona games but its really fun once you get the hang of it. I also think its best if you play P5 or P5R before playing this game to get the best experience story wise.\n\nEdit -Play with controller. It will make your life alot easier :D", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3904571418, "author": "818b85ea-1353-32c8-8113-61391b0e682a", "date": "2021-06-28", "hours": 54, "content": "Makoto is best girl", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4169482786, "author": "7f8b9082-e130-3f25-9b99-50a7a9464d05", "date": "2021-06-28", "hours": 40, "content": "FOR REAL?", "comments": 0, "source": "steam", "helpful": 2, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1189221442, "author": "8d76388e-44cd-3db5-8918-2d8349f121ec", "date": "2021-06-29", "hours": 73, "content": "I don't have PS or other game machine, but I have expected P5 for long time.\nAs this time P5S arrived, I finally found, YES, THIS IS A HIGHSCHOOL LIFE I HAVE EVER DREAMED.\nEven if I am no longer young.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1580871284, "author": "2e9b9d12-732f-3456-9641-703ba22e30f5", "date": "2021-06-29", "hours": 61, "content": "*Review may contain spoilers for P5/P5R/P5S*\n\nLet me start off by saying Persona 5 Royal is my favorite game of all time. So when I heard P5 was getting a spin-off musou type sequel I was definitely happy but knowing how meh I have felt about Dynasty Warrior type games in the past I was a little skeptical it could live up to anywhere as close P5 for me. I am so happy to say this game surprised the crap outta me. This is a full blow canon continuation of the Phantom Thieves story, this time around it just happens to be an action RPG instead of a turn based combat one.\n\n All of the main cast (except one) return and 2 new great additions to the Thieves join as well. Characters like Sojiro and Sae do make appearances but characters like Iwai, Takemi, and Kawakami don't although they might be briefly mentioned. You still get big chunks of story mixed in with fighting shadows just like any other Persona mainline game minus the day to day schedule system the games usually have and no social link aspects. You are free to take as much time as you need to beat the game.\n\nThe combat like I mentioned before is action oriented this time and I think it goes together great with Persona, it's pretty simple and repetitive but it's done so well and each character feels different enough that I didn't get bored and loved trying out each one out. I don't like Dynasty Warrior games, I played Fire Emblem Warriors and barely was able to beat it only cause I really like Fire Emblem and that game was a full blow Warriors spin-off game. P5 Strikers is not, it does share aspects of those games but you fight small hordes of enemies a little at a time, still ambushing unsuspecting shadows as if it were vanilla P5. \n\nThe maps are not giant battlegrounds filled with small enemies and fortress to take over with commanders to take down, they are all dungeons akin to what you would find in a normal Persona game.\n\nI cannot stress enough that this is a full blown Persona game and not just the next musou spin-off game like Fire Emblem/Hyrule Warriors. If you have not played Persona 5 or Persona 5 Royal, wait to play this. Either wait for a port or play it on a PS3/PS4/PS5 if you can then play this. I love these characters so much and getting to see them all together again on another quest to save the world was just amazing, and saying goodbye to them again was incredibly hard. The Phantom Thieves have stole my heart all over again, again. 10/10", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3617072832, "author": "abb10cfe-1bef-3622-84d0-ae837f49e311", "date": "2021-06-29", "hours": 112, "content": "it'scooliguess", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3468715068, "author": "164e03d5-94ce-3524-94c7-b37ad21da2e8", "date": "2021-06-30", "hours": 97, "content": "Good Game, now give me P5R and P3", "comments": 2, "source": "steam", "helpful": 113, "funny": 4, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 5608782, "author": "3d42245b-afc2-37dc-bdf4-dc8df461456f", "date": "2021-07-01", "hours": 13, "content": "ann is best girl. 10/10.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1992134825, "author": "c92f7ba9-5d74-3d20-8e33-cb887347e1ba", "date": "2021-07-01", "hours": 2, "content": "very based and huge good", "comments": 0, "source": "steam", "helpful": 3, "funny": 2, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1320951714, "author": "5c806ae7-8cfd-3465-be7b-aec5d79bd07e", "date": "2021-07-02", "hours": 21, "content": "I Loved Persona 5 Royal and though this isn't as good, it is still a great game. If you don't want to get this then get Persona 4. 9.5/10", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3516351831, "author": "3c641552-cd98-302a-b676-ccbc4c690044", "date": "2021-07-02", "hours": 38, "content": "The Persona number you've been waiting for for PC yet sadly not the main game. Join Joker and his friends in order to change criminals' hearts and embrace yourselves in the friendship simulator that Atlus is well known for. Go on a road trip across Japan with your friends and discover how lonely you are compared to a video game character. Japan has done it again fellas.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3535031921, "author": "f3657486-13b1-36aa-b2e5-c8b1aca73f28", "date": "2021-07-02", "hours": 29, "content": "❤ Audience ❤\n☐ Beginner\n☐ Casual Gamer\n☐ Normal Gamer\n☑ Expert\n\n☼ Graphics ☼\n☐ Bad\n☐ Alright\n☐ Good\n☐ Beautiful\n☑ Fantastic\n\n♬ Music ♬\n☐ Bad\n☐ Alright\n☑ Good\n☐ Beautiful\n☐ Fantastic\n\n☠ Difficulty ☠\n☐ Easy\n☐ Average\n☑  Easy to learn / Hard to master\n☐ Hard\n☐ Unfair\n\n§ Bugs §\n☐ Bugs destroy the game\n☐ Lots of bugs\n☐ Few Bugs\n☐ You can use them for speedrun\n☑ Nothing encountered\n\n☯ Story ☯\n☐ There is none\n☐ Bad\n☐ Alright\n☐ Good\n☑ Fantastic\n\n⚔ Gameplay ⚔\n☐ Frustrating\n☐ Sleepy\n☐ Boring\n☑ Fun\n☑ Challenging\n\n۞ Game time / Length ۞\n☐ Really short (0 - 3 hours)\n☐ Short (4 - 8 hours)\n☐ Few hours (10 - 20 hours)\n☑ Long (40-60 hours)\n☐ Very Long (61-100 hours)\n☐ Extremely Long (101+ hours)\n\n$ Price / Quality $\n☐ Full price\n☑ Wait for Sale\n☐ Don't buy\n☐ Refund it if you can\n2 Comments", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 713370459, "author": "3804c1f0-d534-3457-8044-39e34f5ea76b", "date": "2021-07-03", "hours": 43, "content": "P5R P5R P5R P5R P5R", "comments": 0, "source": "steam", "helpful": 93, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1883087451, "author": "35d64324-4ff7-3f15-826d-9556e14687c3", "date": "2021-07-03", "hours": 26, "content": "Now give us royal.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2187967568, "author": "0a497e6f-83e0-3dba-b63f-99b73862096d", "date": "2021-07-03", "hours": 33, "content": "I love this game, and so will you", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2968341407, "author": "d76d7f68-0197-34fa-ba17-de0ac330081e", "date": "2021-07-03", "hours": 9, "content": "We want Persona 5 Royal on PC but this game are awesome", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 258987372, "author": "1c477af8-e6cc-3ba9-b15a-5651e6943aca", "date": "2021-07-04", "hours": 78, "content": "[u]Persona 5 Strikers is the best game I have played in 2021. [/u]\n\nHowever, its existence on PC is a harder sell as the game's story is a continuation from the PS3/PS4  game Persona 5. Yes, you can just pick up and play Strikers, but unless you watched the anime, or played the prior game you won't know the characters, their backstory and all of their character nuances and personality traits.\n\n[b]So what is the game?[/b]\n\nIt's a story driven action game with RPG elements. As you play the game you're tasked with infiltrating 'Prisons'. You fight your way through until you defeat the boss at the end. As you progress you collect Personas. Think of these like Pokemon. Each Persona has different skills and abilities. Some heal, some buff or debuff and some do fire, wind or death magic. You level up your characters and persona to increase their power and learn new abilities.\n\n[b]The Good.[/b]\n\n[u]The voice acting. [/u]\n\nThe game isn't 'fully' voice acted. Some sections simply have to be read, however similar to the game this is based on, large sections of the game are fully voice acted and the quality of the voice acting really elevates the game. All of the voice actors from Persona 5 have reprised their roles, with the addition of Nolan North joining the cast as the detective Zenkichi.\n\n[u]The combat. [/u]\n\nThis isn't your typical musou game. Rarely is the screen filled to the brim with enemies. Instead, as you traverse the area, you will see enemies roaming around. You can choose to avoid them or 'ambush' them for a tactical advantage. Combat then starts with a small group of enemies to defeat. The combat is fast and satisfying, blending in a range of melee combos, ranged weapon attacks and abilities (think spells). Enemies often have weaknesses that can be exploited, leading to the opportunity to deal massive damage.\n\n[u]Music.[/u]\n\nThis is obviously a personal preference. I like the Persona 5 music a lot. The Striker's soundtrack builds upon the existing soundtrack making slight changes, such as heavier guitar riffs.  The only glaring example here is the first 'prison' stage. The music is a stark contrast to the rest of the game. It's akin to something you might hear on a pachinko or slot machine. It's loud, noisy and is particularly grating on the ears. \n\nMy personal preference is to use the DLC which allows you to use combat music from all of the previous Persona games. As a fan of the Persona series, I'll always choose to engage in combat with Mass Destruction playing.\n\n[b]The Ok.[/b]\n\n[u]Story.[/u]\n\nThe story of the game is in a weird place. Persona 5 Strikers is the story sequel to Persona 5, but not Persona 5 Royal. That means that none of the events of P5R have taken place. Not game breaking, but something to consider. The story itself is fine, if not a little predictable. It's welcome that the characters continue to develop past the P5 story. Hearing Haru refer to herself as 'Beauty Thief' again was welcome.\n\n[u]Fighting when?[/u]\n\nPersona 5 has a lot of story. Some of it is voice acted but a majority of it is reading conversations between The Phantom Thieves. Sometimes you just want to get back into the action, but you'll need to wade through the story elements first. I personally liked the story, but some people might not expect this much from a fighting game. Be warned.\n\n[b]The Ugly.[/b]\n\n[u]Eternal Bonds.[/u]\n\nMy only real criticism of the game came from my desire to 100% it. In particular, one Achievement stands out as egregious, and that is \"Eternal Bonds'. To get this achievement, you need to raise your Bond level in game to 99. Raising your bond level happens as you play the game. Major story events, killing rare bounties and defeating bosses will all net you some bond level. However, I completed the game around the 48 hour mark. I then started new game plus and played through it again. Even after two complete playthroughs, I still didn't have enough. \nI grinded one particular rare bounty for about 10 more hours. In hindsight, I could have played NG+ on the hardest difficulty, but I did so up until completing Alice's Palace, but the progress on the bond levels didn't seem any faster.\nSo there's a reason only ~3% of all players have completed all of the Achievements. It's due to Eternal Bonds. If you plan on grinding bond levels, be prepared to do a lot of this:\n\nhttps://www.youtube.com/watch?v=0W0x5VNsTkQ \n\nIn the end, I did 100% Persona 5 Strikers. It's one of the few games I've sought to do so with. I still maintain it's the best game I have played all year and I do recommend it.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 843388381, "author": "eab4b0dc-c6f0-3a77-9db4-a379518721e7", "date": "2021-07-04", "hours": 3, "content": "I like Persona", "comments": 1, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3132157610, "author": "7499fce7-cc7d-3336-91c0-e9a4431f2920", "date": "2021-07-04", "hours": 50, "content": "Story: 9/10, a wonderful and worthy sequel to the original but it IS significantly shorter if you've played p5/p5r. in fact you'll probably finish it in less than half that time. Be aware that playing p5/p5r is not absolutely necessary but should not be ignored either.\n\nGameplay: 9/10, action and combat is superb while posing a certain level of challenge that's equally rewarding. However, expect frequent crashes on 1.00. I myself have had 8 crashes from start to finish.\n\nPresentation: 9.5/10, as pretty as p5r on ps4 pro even at 1080p. UI is slick and wonderfully crafted. Other than resolution and rendering scale, there's not much of a graphical difference between min and max.\n\nSound design/Soundtrack; 10/10, every single attack, menu shuffle and many others sound amazing. Most if not all the tracks you loved return with their own variations for this game, with the BGM dlc you can change it up with music from past games and you can even listen to them in the menus.\n\nLasting impressions/appeal; 9/10, a great game to play imo and rivals that of something like nier automata. Many people might complain the other games are not on pc but what can you do.\n\nOverall: 9.3/10", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1438012595, "author": "225dd0fd-7504-3996-ab1b-652c5f413bc8", "date": "2021-07-05", "hours": 79, "content": "It's just as flashy and horny for style as the original Persona 5 is, if not more so. \nWhile not a turn based combat system like the other games in the series, I still found the hack and slash mowing down of enemies to be quite enjoyable. It also adds to the character of quite a few main characters, which is nice because some of them were sorely lacking in the first Persona 5. \nWith that being said, it's incredibly similar to the first story and I found the final boss to be incredibly underwhelming, both in concept and as an actual fight.  Along with this, the story takes place over the course of a month, but don't let that fool you, there's still a lot of playtime to be had from the game. \nIt lacks a lot of the key elements of the series, like the turn based combat, social links, and time management, so don't go into the game expecting that. It does offer a few unique things to better fit with the style of game, but if you're expecting another Persona 5 Royal, you will be disappointed. \nNot the best game in the franchise, but it's still incredibly enjoyable nonetheless.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1708833500, "author": "b729921d-9fb4-3159-a51e-2f193c3a5dfa", "date": "2021-07-05", "hours": 12, "content": "Stylish and funny.\nLove it. \n\nBut the control scheme is probably coded by a drunk mongoose bashing on the keyboard.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2803559636, "author": "d6b34e60-b04b-30bd-b150-e18bf44db21e", "date": "2021-07-06", "hours": 97, "content": "great game.. P5R when?", "comments": 0, "source": "steam", "helpful": 50, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3016973538, "author": "a960e4b0-736b-3f5b-b46b-b9d81a8306c1", "date": "2021-07-06", "hours": 62, "content": "A bit grindy, and lacks a few features that i love from persona 5 but that's to be expected as this is a completely new and independent game. Absolutely love the story and the new characters are especially fun. Definitely worth my money.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3620736650, "author": "89eb2685-eb29-3796-b208-841aba22cfea", "date": "2021-07-06", "hours": 46, "content": "⠘⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀                   ⡜⠀⠀⠀\n⠀⠀⠀⠑⡀ It's good, ⠀⠀⠀⠀ ⠀⠀                          ⡔⠁⠀⠀⠀\n⠀⠀⠀⠀⠈⠢⢄⠀ and you should try it too. ⣀⠴⠊⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⢀⣀⣀⣀⣀⣀⡀⠤⠄⠒⠈⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠘⣀⠄⠊⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀\n⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠛⠛⠛⠋⠉⠈⠉⠉⠉⠉⠛⠻⢿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⡿⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⢿⣿⣿⣿⣿\n⣿⣿⣿⣿⡏⣀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿\n⣿⣿⣿⢏⣴⣿⣷⠀⠀⠀⠀⠀⢾⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿\n⣿⣿⣟⣾⣿⡟⠁⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣷⢢⠀⠀⠀⠀⠀⠀⠀⢸⣿\n⣿⣿⣿⣿⣟⠀⡴⠄⠀⠀⠀⠀⠀⠀⠙⠻⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⣿\n⣿⣿⣿⠟⠻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠶⢴⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⣿\n⣿⣁⡀⠀⠀⢰⢠⣦⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⡄⠀⣴⣶⣿⡄⣿\n⣿⡋⠀⠀⠀⠎⢸⣿⡆⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⠗⢘⣿⣟⠛⠿⣼\n⣿⣿⠋⢀⡌⢰⣿⡿⢿⡀⠀⠀⠀⠀⠀⠙⠿⣿⣿⣿⣿⣿⡇⠀⢸⣿⣿⣧⢀⣼\n⣿⣿⣷⢻⠄⠘⠛⠋⠛⠃⠀⠀⠀⠀⠀⢿⣧⠈⠉⠙⠛⠋⠀⠀⠀⣿⣿⣿⣿⣿\n⣿⣿⣧⠀⠈⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠟⠀⠀⠀⠀⢀⢃⠀⠀⢸⣿⣿⣿⣿\n⣿⣿⡿⠀⠴⢗⣠⣤⣴⡶⠶⠖⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡸⠀⣿⣿⣿⣿\n⣿⣿⣿⡀⢠⣾⣿⠏⠀⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠉⠀⣿⣿⣿⣿\n⣿⣿⣿⣧⠈⢹⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿\n⣿⣿⣿⣿⡄⠈⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣾⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣦⣄⣀⣀⣀⣀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡄⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠙⣿⣿⡟⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠁⠀⠀⠹⣿⠃⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⡿⠛⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⢐⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⠿⠛⠉⠉⠁⠀⢻⣿⡇⠀⠀⠀⠀⠀⠀⢀⠈⣿⣿⡿⠉⠛⠛⠛⠉⠉\n⣿⡿⠋⠁⠀⠀⢀⣀⣠⡴⣸⣿⣇⡄⠀⠀⠀⠀⢀⡿⠄⠙⠛⠀⣀⣠⣤⣤⠄⠀", "comments": 0, "source": "steam", "helpful": 2, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 62149509, "author": "c64bfbae-8b62-36dc-b1ef-e1983fe3658d", "date": "2021-07-07", "hours": 58, "content": "The cat turned into a convertible", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 654116157, "author": "603e939b-ad32-3624-969c-2f6a017ea198", "date": "2021-07-07", "hours": 68, "content": "Ryuji said fuck 12/10", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2540785534, "author": "ce61ea1f-bd51-3c3b-b4f1-4c6875b770f9", "date": "2021-07-07", "hours": 42, "content": "Joker but in a hack and slash??? WOAH!!!!", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 710711495, "author": "32076f9c-0d2b-3fa1-8cb0-316e18ef178c", "date": "2021-07-08", "hours": 111, "content": "Zenkichi is cool", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1394714296, "author": "16c4d841-7369-37c6-a392-3ec68cd5a0f5", "date": "2021-07-09", "hours": 3, "content": "P5R when ?", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3045142837, "author": "4e5972cd-7f8d-3599-8b76-4a2dad45431c", "date": "2021-07-10", "hours": 142, "content": "Seems they focused more on the combat and less on the role playing compared to the original Persona 5.\n\nStill a great game overall.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1924167594, "author": "e64c68d9-5a54-3716-a5c3-4809f28866cf", "date": "2021-07-11", "hours": 43, "content": "if you like persona 5 on pc, you're going to want this", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4010615449, "author": "9d4c1058-96f0-3985-98a8-c5657d822242", "date": "2021-07-11", "hours": 38, "content": "Ware wa nanji… nanji wa ware…\n\nFirst thing you must know is that the game continues the story of Persona 5 not Royal. No characters,events or ending are mentioned or seen in Strikers from Royal. Bare that in mind. It is a must to know the lore of Persona 5. Either play it or watch a no commentary walkthrough. Anime is not recommended as many things are lost.\n\nStrikers had a drastic change in gameplay from Turn base combat to Hack and Slash which made the game more fast paced and gives you a big window of how you will fight with shadows. As we might remember, Yakuza Like a Dragon also changed it's combat but to Turn Based which was not the best decision.\n\nNow we roam all around Japan to find Jails (Yes, now castles are called jails and they are not a little location but a whole city) and defeat Monarchs that rule them. There is no Memento for obvious reasons. \n\nThe game became very easy in comparison to the previous game. You are not limited with time anymore and can infiltrate jails as many times as you want. You don't need to raise your confidants anymore because there is a new system of Bond. You receive Bond Skill exp for battles,requests,bosses and so. You get points with each level that you can spend on skills that will help you in different ways. The shop is now a;ways in the hideout. One click and you can buy anything you want. You don't need to annoy poor Iwai for equipment or go to Takemi for meds. Ah, you will be hearing \"How many?\" and \"Are you sure?\" a looooooooooot of times, so be prepared. I warned you.\n\nThe story is as always good but there is one moment in the game which makes me question why the devs repeated themselves...\n\nBosses. If you played or watched Persona 5, you do remember that each boss was unique and you had to follow some strategy not to die. Sadly, bosses here are like regular enemies. Nothing special about them. No difficult stategy needed. You just need to mash the buttons and evade. Only the final boss was unique and had something different in the boss fight. \nI'll just give an example of Persona 5 boss. Madarame. Several phases. Painting and then fight with clones where you had to use correct skills to win. Here...just mash the down buttons. Maybe it was made so the game doesn't loose the pace and stays fast like all of the gameplay but these are bosses. When you beat them, you need to get the feeling that you won by doing something and getting the feeling that all the hours you spent to grind for a new persona wasn't just a woosh. \n\nIn general I like the game and it's new combat system. New locations were a nice change of pace and I hope the next game will have something more. Bosses need more attention because this is just a meh. I hope that the new game will have another cool story that I and other Persona fans will enjoy.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1817341179, "author": "7bd58903-d99c-3bcd-ba1e-b254d0ca5399", "date": "2021-07-13", "hours": 30, "content": "i like joker from persona 5\n", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2367777979, "author": "6baeff64-f16c-3f67-a0e7-1ab39a06b521", "date": "2021-07-13", "hours": 139, "content": "Not a spin-off, a sequel.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3391458058, "author": "2361b483-3d1e-36f4-8933-0dc5297b4aec", "date": "2021-07-13", "hours": 60, "content": "No le llega ni a los talones a Persona 5 pero hace lo que tiene que hacer y lo hace BIEN. Como es costumbre en la saga, exelente musica y mucho estilo. El gameplay es adictivo y divertido. Entre con un poco de miedo de que el gameplay sea igual al del Dynasty Warriors, el cual no me interesa; Pero no es el caso, este es mucho mas completo, interesante y adictivo. Al rededor de 40hs de historia. Recomendado!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 461722625, "author": "251fa9c5-9683-34d7-931f-75473f384670", "date": "2021-07-14", "hours": 49, "content": "Loved Persona 5 royal, love this game as well. This is a must play if you're a fan of Persona.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2646332156, "author": "955f9565-18b0-3857-b80b-29f8d7c32eea", "date": "2021-07-14", "hours": 69, "content": "Good game, P5R when???????????", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2783322711, "author": "8ec1294f-4de0-3625-af01-b9bcf87a8d5c", "date": "2021-07-14", "hours": 31, "content": "good game 10/10, can we have p5r in steam please", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3555448004, "author": "65356053-c219-3a7d-896a-6ad31be86208", "date": "2021-07-14", "hours": 22, "content": "I like this game................ now when P5R\n", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 96806489, "author": "36cf40a4-299e-3825-8f34-94828c9c665e", "date": "2021-07-15", "hours": 29, "content": "the cat turns into a bus", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1390187301, "author": "d96bdc4b-1af1-38d2-9a30-f7a2ffbc3c8c", "date": "2021-07-16", "hours": 48, "content": "nice", "comments": 0, "source": "steam", "helpful": 2, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3244771555, "author": "89f9ab42-ae09-3d22-aa59-ea4ac220a364", "date": "2021-07-16", "hours": 9, "content": "Persona 5 Royal please", "comments": 0, "source": "steam", "helpful": 4, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1492718337, "author": "f06553a1-85cf-3df0-b12c-82e30858e853", "date": "2021-07-17", "hours": 7, "content": "Very fun hack and slash for fans of Persona!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2233355144, "author": "7aa834bd-bdd8-31ab-b2c1-d8ac1553c3d1", "date": "2021-07-18", "hours": 23, "content": "As of writing this, I have 22 hours in Persona 5 Strikers playing on the Normal difficulty. Here are my pros and cons followed by my overall thoughts.\n\nPros:\n-The characters you love are back.\n-Mixing Persona skills with Warriors gameplay feels novel and interesting. Pausing the battle to choose your skill feels very cool and stylish.\n-The moves are epic and flashy. (It's a warriors game, this is to be expected.)\n-Big variety of Personas to fuse and use in battle!\n-Characters feel like they somehow have even more personality than in P5/P5R. Sometimes it feels like too much though. But I feel like it tries to hit a nice balance.\n-You can travel to previous dungeons in the Metaverse.\n\nCons:\n-Almost all side characters from P5 are gone. (Sae, Tae, Iwai, etc. are nowhere to be seen.)\n-Graphics settings are some of the laziest I've ever seen implemented. (Anti-aliasing is horrendous.)\n-Persona fusion is a little more cumbersome than in previous Persona games.\n-You cannot go back to previously explored areas in the real world.\n-The game discourages the player from using Persona skills as you only get a limited amount of SP every time you go in the dungeon. You can expend your SP fairly quickly so you tend to just want to save your skills for mini-bosses and boss fights.\n\nAnd the worst con of all...\n\nTHIS GAME IS GRINDY. It doesn't matter how much you like to run around and explore. You have to grind or you'll eventually get your butt kicked in the story. So frustrating to have to stop the story to find a good place to grind experience to level up Joker and the party.\n\nYou have to like warriors games to fully enjoy this game. If you strongly dislike Warriors games, this game is not for you. I say I feel about a 6/10 towards Warriors games and I already started to feel the game wear thin around hour 8. I love the Persona series but I'm just writing this so other people know to expect a grind.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2774564528, "author": "2e82a383-d7d2-3499-a36a-e859b4cda3ee", "date": "2021-07-18", "hours": 8, "content": "Pretty fun game and has wonderful graphics.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 128025511, "author": "683bfe88-8538-38c2-9031-d2c532fb0133", "date": "2021-07-19", "hours": 108, "content": "beating up cripples and demons with my imaginary friends all while in cosplay was fun, but now the police are after me, please help.", "comments": 0, "source": "steam", "helpful": 77, "funny": 59, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 634203151, "author": "6caa43aa-9886-3991-8b16-c2d321bf0c6d", "date": "2021-07-19", "hours": 43, "content": "This is a very worthy sequel to the original classic. Persona works extremely well with an action RPG battlesystem. A lot of fun.", "comments": 0, "source": "steam", "helpful": 16, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2773012415, "author": "162c13dd-f653-36d9-8158-8465948d3066", "date": "2021-07-19", "hours": 99, "content": "Gameplay feels almost like Kingdom Hearts with tons of Persona flavor. Worth getting if you beat P5 and enjoyed the characters.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3844391282, "author": "85c22ded-55b7-3f12-a6ea-5b6302770e0d", "date": "2021-07-19", "hours": 39, "content": "How do you follow up a masterpiece? By making another.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2028501368, "author": "0109997d-324e-39da-97d0-1a2868df3760", "date": "2021-07-22", "hours": 80, "content": "Well for starters I need to say that I love the persona series and to see a different approach to it and still make it feel right at home is an amazing accomplishment as the core of what makes persona remains despite no longer being a turn base RPG in this game, but a hack and slash. By itself the combos are not many, but they are well crafted enough to make it fluid and impactful.\n\nI did not present any issues from my end and I can definetly suggest this game as it has a great story with characters well developed, great gameplay, amazing music, the game is not short and enjoyable.\n\nAdditional note: I am glad to see Atlus bringing their games to PC and giving the PC community some love, I can't wait to see what they have prepared for us in the future", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2900442577, "author": "05a1000b-56b2-37cc-9a3b-d254c2b9d52f", "date": "2021-07-22", "hours": 124, "content": "This is a straight up sequel to vanilla Persona 5. For all intents and purposes, this is essentially Persona 5 in every way except one.\nSame characters, same voice actors, same mechanics and all that- in a new plot and settings that fits in with the Persona 5.\n\nThe only difference is the combat which is still mostly just Persona 5, which is that the turn-based combat is replaced with musou-style combat - which you'd imagine to be a pretty massive difference (and it is) but it does not make it not-Persona 5.\nImportantly: this may be considered as a \"spin-off\" but it is substantial and has value -> unlike the dancing game which doesn't even come with a proper/legit plot.\n\nAt the end of the day, I really enjoyed this game a lot and can fully recommend it for many reasons.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 723257303, "author": "8cf92f63-d7da-35d7-89f2-5a51bdeb1888", "date": "2021-07-23", "hours": 50, "content": "I'll literally name my firstborn 'Atlus' if you give us Persona 5 Royal on Steam.", "comments": 12, "source": "steam", "helpful": 467, "funny": 131, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2118683267, "author": "a8104c23-ec83-307d-869f-7abbbe33cdaf", "date": "2021-07-23", "hours": 76, "content": "play after persona 5 lol", "comments": 1, "source": "steam", "helpful": 73, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2711520674, "author": "c39d6d71-5fb3-34ea-b065-6c4afd859d82", "date": "2021-07-23", "hours": 56, "content": "If you like the \"Warriors\" games (like Dynasty or Hyrule) and you like the original Persona 5, this is a brilliant sequel. With the best parts from both series, some of which was changed to flow better with the other, the gameplay is excellent. Things to be wary of. Although it seems as if the story is just Persona 5 again, it isn't. Although it does tread over similar ground, the wholly unique aspects and new characters like Zenkichi make up for it. Also, on PC there's a slight chance of infinite load times. That being said however, I personally only encountered it once, so as long as you save frequently (mainly before major events) it isn't a hassle.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3425404395, "author": "6ab4d6fb-2b7d-33c9-84ca-54dd0c407f2a", "date": "2021-07-23", "hours": 9, "content": "for real", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3671145646, "author": "59afe7fc-09e7-3ec3-af35-0e7785ddbcc2", "date": "2021-07-23", "hours": 44, "content": "This game is great, the characters are stunning, the writing enthralling, the action intoxicating but there are times it feels incomplete, a symptom of being stuck between two genres and having two rather different teams working on this game; the lack of truly unique social links, the absence of first game tie ins (there's no Mishima and I hold a grudge) and if you aren’t fond of the hack n slash genre the repetition in combat and the music that comes with it can be overbearing. \n\nI do recommend the game, you could try and wait for a sale but unfortunately JRPGs, Atlus games, koei games and triple A games generally do not go on sale often enough for waiting to pay off. \n\nI believe if you like hack n slash games, like the Persona franchise, like franchise mixing, or like long games this game is more than worth the price and it is at least the sequel to a masterpiece, if not one itself. \n\nAnd for a much more in depth look into the many aspect of this game be sure to check out my video review of the game at https://youtu.be/LcN9Tlo83uU\n", "comments": 0, "source": "steam", "helpful": 10, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1197868074, "author": "8dc5aacd-97e1-3d47-bc36-962bd22a8475", "date": "2021-07-24", "hours": 8, "content": "sex", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1843899042, "author": "b535f20c-f342-39dc-962a-962eaef36b04", "date": "2021-07-27", "hours": 74, "content": "You literally are the joker baby. Also Zenkichi can Zenkissy my nuts bro. ON GOD\n\nEdit: I regret my former statement. This man is a pure soul dealt a bad hand. Zenkichi no longer can Zenkissy my nuts", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2340091347, "author": "78a2751a-b0a4-3203-8f42-bea4e34c20f7", "date": "2021-07-28", "hours": 48, "content": "Pros: It's good\nCons: It doesn't have Kasumi 'nor Akechi\nSide Note: I want Persona 5 Royal on Steam", "comments": 0, "source": "steam", "helpful": 134, "funny": 4, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3374660176, "author": "cbf372d5-20c2-3993-b658-7008756cf2f8", "date": "2021-07-29", "hours": 47, "content": "I wasn't expecting very much from this game, so I was pleasantly surprised to find that it had both good gameplay and a good story. I'm typically not a fan of these Dynasty Warrior sort of games but this game was very fun to play, and the character moments (especially with the new characters) are excellent. Story is pretty decent as well - it's not quite as fleshed out as the original Persona 5 but it's still solid. It's definitely worth playing if you've already played P5. Obviously would not recommend if you haven't played P5; it's a sequel so it really needs that extra context to truly make sense.\n\nThe only two things that bothered me were related to the PC port itself. First off, the antialiasing in this game kind of sucks. I ended up using NVIDIA control panel to do antialiasing, and it wasn't a perfect solution but it made the game look good enough. Also, when using a controller, movement is limited to 8 directions (up, down, left, right, up-left, up-right, down-left, down-right), and stick sensitivity is not linear. For example, when moving around, you can either walk very slowly if you move the stick slightly, or run if you move the stick all the way; there's nothing in between. It's not a huge issue, but still worth mentioning.\n\nEven if I do prefer the turn based combat of the main Persona games, this game is still very good and definitely worth trying. I highly recommend getting the legacy BGM pack as well, as it helps a lot with making combat less bland.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2594661194, "author": "2e236134-8236-3ae8-a503-096bc58e0e28", "date": "2021-07-31", "hours": 56, "content": "Can't date the girls in this one but great game nonetheless", "comments": 0, "source": "steam", "helpful": 30, "funny": 15, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 24406350, "author": "1c55ce98-d61c-368e-ba82-1652d5677cb6", "date": "2021-08-01", "hours": 50, "content": "Persona always makes the PP hard", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2078074523, "author": "238452f5-8b6a-348b-9df6-05830316a94d", "date": "2021-08-01", "hours": 46, "content": "PERSONA 6 PLEASE ATLUS I BEG OF YOU", "comments": 0, "source": "steam", "helpful": 2, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 966833650, "author": "b076466c-9ebc-3915-8233-e26850d61443", "date": "2021-08-02", "hours": 2, "content": "10/10 Makoto is in it", "comments": 0, "source": "steam", "helpful": 89, "funny": 6, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3448005739, "author": "4281dc8f-d07f-35b6-a3e7-4a1a99779296", "date": "2021-08-03", "hours": 56, "content": "Game fun.", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 747523334, "author": "6a7a17a2-6f8c-33e0-8463-595043a20b2b", "date": "2021-08-04", "hours": 123, "content": "Controls are a little iffy at first but once you get used to them the game gets a whole lot better. Amazing sequel to one of my favourite JRPs Persona 5", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 784154098, "author": "a00dce03-fc0e-3265-96c1-9b4bf8a1555e", "date": "2021-08-06", "hours": 78, "content": "i think the game is super fun and epic i rlly like makoto and haru one time i saw an elderly couple get robbed at gunpoint and beaten to death and told no one!! my dirty little secret!! heh", "comments": 0, "source": "steam", "helpful": 1, "funny": 2, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 228302827, "author": "45cca480-12b9-3de4-8164-aae7a3df06d6", "date": "2021-08-07", "hours": 110, "content": "While I do think the game is very good, the combat isn't as great as you might think. Most battles on higher difficulties turn into you spamming SP because there's no way in hell you're beating some of these bosses otherwise. Stronger moves cost a large amount of SP, unless you have certain Persona abilities. Be ready to chug sodas or other SP restoration items. I definitely advise playing on easy so the combat doesn't start to drag and bosses don't take a long time. The combo versions of spells just don't cut it.  At all. You'll either get knocked out of it or get it off and deal basically no damage. Combat basically comes down to this cycle: heat riser -> apply status -> spam technicals and/or weakness -> recover SP. I've tried several times to play the game any other way and the payoff is never worth it. The moment I got Spell Master, the other party members might as just not exist. \n\nOkay, now that the bummer part is out of the way. The story is great! The new characters fit in perfectly and I want more of them. The old cast bounce off of each other and the new characters very well! The music is incredible and a lot of boss designs and set pieces are really good. \n\nThe quality of life for Persona abilities is great and definitely should be added to the main games going forward. Merciless drops items that increase a stat by 1 so other party members can achieve 99 in all stats, which is pretty satisfying. Fusion is a little lack luster, requiring some persona to be very high leveled and there's just not that many to fuse. Persona take forever to level, and using the persona points system is really tedious. You essentially buy and release the same persona over and over to get more persona points. The ultimate persona is just Lucifer, which is a bummer given the potential of P5's ultimate Persona in this game.\n\nYou probably won't encounter these issues unless you play on hard or normal, and you'll definitely avoid most of the fusion issues if you aren't achievement hunting like I was. If you like Persona 5, you'll like this game. Simple as that.", "comments": 0, "source": "steam", "helpful": 15, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3092340677, "author": "e0cf31fd-b74a-349c-bc82-eac869807924", "date": "2021-08-07", "hours": 84, "content": "Another amazing addition to the Persona series, wouldn't say its as good as Persona 5 (Royal and Vanilla) as the confidant aspect was a hugely important part of the games but I do like the bond mechanic too! The combat, while different, is very fun with the different ways of fighting and a good way to adapt a tradition JRPG to a more action-based combat system. I'm not too far into the story but I think it has done well to incorporate aspects of real everyday life with EMMA being similar to other tech in the real world. Can't wait to play more and would 100% recommend it to anyone (though I'd suggest playing Persona 5 first because there are things you need to play/watch the prequel to understand)\n\nEdit 1: Finished the second jail and came to say that I LOVE the story, taking the persona 5 characters and placing them in positions that mirror their past selves is ingenious because it shows how the characters could have ended up before finding their real resolve from the main character and how they react to those going through a similar fate.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1425238294, "author": "6273110d-1926-3eff-a71f-62bc9d420fe1", "date": "2021-08-08", "hours": 6, "content": "pog", "comments": 0, "source": "steam", "helpful": 8, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3408142038, "author": "a6400d6c-d7f0-3220-ad09-c87d176ce8b4", "date": "2021-08-09", "hours": 41, "content": "oh to be a demon lord isekai villain", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1036227113, "author": "9295c13e-21d3-3832-9ca3-e78378387829", "date": "2021-08-10", "hours": 47, "content": "Need more time with the gang?  I sure did.  This game covers a road trip with the crew with all the complexities of  a Persona game in an action setting.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1663030977, "author": "11cd9a17-cac2-3748-995d-981325b908f2", "date": "2021-08-10", "hours": 52, "content": "persona", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 251607224, "author": "42a97c91-9e5b-3d09-b763-7585e29f4871", "date": "2021-08-11", "hours": 54, "content": "I was on the fence about this game at first. Yes, it is a continuation of P5 (one of my favorite JRPGs), but the choice of combat style a la Dynasty Warriors seemed a weird choice for me. Indeed, it took quite some getting used to at first. Many of the battles will present you with so much information on screen that it can be difficult to keep track of what is happening. Hordes of enemies swarm and remembering certain attack combos in unison with summoning your Persona felt like a feat in multitasking compared to the original combat of P5; though this may be more my lack of experience with hack and slash games if anything. Showtime attacks, which felt like more of an after-thought in Royal, return center stage akin to ultimate moves in combat, with each part member having their own unique set. \n\nHowever, after a while, the combat became fun once I grew accustom to the controls. Playing this on PC, I would highly recommend plugging in a PS4 controller over M&K. There was something satisfying in the flashy and stylish way each Phantom Thief performs in a fight. Beyond the main combat, it keeps to the series' traditional Persona fusing system, along with the same familiar abilities, strengths and weaknesses. Any veteran of the Persona will pick up on these with ease. Rather than Palaces this time around, each stage comes in the form of a \"Jail,\" tied to a particular boss. Even after completion, you can revisit each one to tie up lose ends such as obtaining a particular Persona or completed side jobs that will occasionally come in. Another change is lack of Confidants or daily social activities in favor of focusing largely on the main group. \n\nIn terms of story, this game is a direct sequel to Persona 5 (vanilla, not Royal). The Phantom Thieves reunite to tackle another threat as they travel Japan in a grand road trip. It follows much of the same structure as P5 in finding the current big bad, taking them down, and moving on to the next target. No new formula here, but if you're looking for more Phantom Thieves goodness, this game will offer it. I will say that this game is not nearly as long as its predecessor; I finished at about 54 hours, which included a bit of time building my Persona team and tackling various side jobs/bosses. Story is nothing new or groundbreaking, but I personally still enjoyed it. \n\nMost of the same beats are here: stylistic combat, great music, an engrossing story, and the same lovable cast of characters. There is not much more to say beyond that, as anyone coming out of P5 will feel at home here (at least once mastering the combat system). While not as grand as those of the main line games, it is a worthy sequel to try something new and help pass the time waiting for P6.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2056826599, "author": "4f6e7fa8-4941-33cf-a786-1baa386c123f", "date": "2021-08-11", "hours": 58, "content": "[h1]Things I liked:[/h1]\n     > They took the already incredible P5 soundtrack and added some great remixes and a couple of good new tunes IMO. Had a blast listening to the BG music while playing.\n     > The devs took the opportunity to flesh out some of the underdeveloped characters in P5/P5R and generally succeeded. The cast now feels more well-rounded.\n     > Road-tripping through Japan as the setting was great as I was familiar with several of the places the Phantom Thieves visited and it reminded me of how much I enjoyed my own trips.\n     [spoiler]> The devs did a helluva job in introducing and establishing the new Phantom Thieves Wolf and Sophie as relatable characters. Sophie in particular reminded me a lot of Vivi from FFIX in that her journey of learning and growth was also central to the story.[/spoiler]\n\n[h1]Things I'm meh about or disliked:[/h1]\n     > The combat mechanics were just ok for me. I settled into them more or less by halfway through the game but boss fights more or less devolved to P5-style of fighting - buff, spam elemental weakness, toss items around like crazy. Gimme the old turn-based combat any day.\n     > The slice of life stuff that really drew me into P5R felt lacking here. As mentioned previously, I wish the game leaned more into that especially since the original premise of P5 was supposedly a big jaunt around the world which Strikers is delivering on a smaller scale.\n     [spoiler]> The post-Kyoto storyline devolving into a retread of P5 was kinda disappointing. Konoe as Shido-adjace (even down to the boss fight mechanics), Demiurge being character-wise a repeat of Yaldabaoth, and the final 2 jails being Mementos-adjace left me a little let down by the final 3 or so hours of the game.[/spoiler]\n\n[h1]Overall: A good, almost-great sequel to P5.[/h1]", "comments": 0, "source": "steam", "helpful": 4, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2511842395, "author": "9f5e79b2-3e56-342b-ac0c-4dcd1294aeb3", "date": "2021-08-11", "hours": 12, "content": "Kasumi not here >:(", "comments": 0, "source": "steam", "helpful": 26, "funny": 12, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 636745013, "author": "ebde4284-720d-3d24-a530-742c9e591067", "date": "2021-08-12", "hours": 38, "content": "persona 5", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2257712917, "author": "e376b9a9-d5a3-3c17-849f-b1037c4b730e", "date": "2021-08-13", "hours": 32, "content": "10/10 makoto best girl", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 822394607, "author": "c65d9480-5d3f-3e62-89f4-283a75925a5c", "date": "2021-08-14", "hours": 8, "content": "Yes, It's worth the money. I mean 60 dollars, Anyway this game is pretty good. Even thought I was a dumbass and bought this one besides the first game, AKA. Persona 5, This is persona 5 strikers. Not Persona 5, After all, this game is pretty good even thought i'm not an RPG guy. Every detail is good, The cool thing about it, it was inspired by Lupin the third", "comments": 0, "source": "steam", "helpful": 8, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1511635808, "author": "6b00bed3-0f6f-3bdd-a678-ad4226348f8f", "date": "2021-08-15", "hours": 62, "content": "Great spin-off still retaining key characteristics of Persona games.", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1878630183, "author": "ef50f97c-4d33-3b0a-90cd-f0b11cc730df", "date": "2021-08-16", "hours": 110, "content": "Is P5S fun? Yes.\n\nWill P5S make you want to spend lots of money touring Japan? Yes. \n\nWill it scratch that Persona 5 itch? Yes.*\n\n*No social links, but still a surprising amount of social shenanigans. There was a lot more character and story going on than I expected. Same cast of good looking idiots as last time, plus a few new idiots. Good times.\n\nOn the one hand, lots of fun being able to eat as much food as you want while combat is paused. Makes the game a cakewalk.\n\nOn the other hand, I really miss the risk factor of having to take a combat turn to eat and get my health back up.\n\n\n\nAlso, on the topic of technical issues, the Steam version has worked just fine on my PC for 80+ hours, so I think they fixed whatever was giving people trouble before.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3820480361, "author": "eda90c20-1e01-3f1a-88b1-57f8f0b280e1", "date": "2021-08-16", "hours": 17, "content": "joker looks like soigbob", "comments": 0, "source": "steam", "helpful": 8, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3512462967, "author": "2ace5654-00f3-3766-9bf8-734e37e04659", "date": "2021-08-18", "hours": 94, "content": "I just finished it and i'm once again reminded that my life sucks.", "comments": 1, "source": "steam", "helpful": 9, "funny": 5, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 840342809, "author": "3e135498-e3ce-3288-af10-3c0db0d99bab", "date": "2021-08-19", "hours": 30, "content": "it was alright", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1977891881, "author": "7a80918e-1ffd-3b36-9ad8-4d72b8f0ed89", "date": "2021-08-22", "hours": 22, "content": "ryuji said fuck", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2507414273, "author": "2d8ae781-723a-3624-95ab-9f9f662503ad", "date": "2021-08-22", "hours": 38, "content": "Persona 5 Royal PC port when ATLUS? Give us Persona 5 Royal PC port please.\n\nEdit: I'm not a port beggar, I'm just tired of losing money on consoles just to play exclusives.", "comments": 0, "source": "steam", "helpful": 274, "funny": 14, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2149509079, "author": "913752aa-1ff4-39ea-9c06-dc5aee58d419", "date": "2021-08-23", "hours": 106, "content": "I LOVE ATLUS WEST I LOVE PERSONA THANK YOU I LOVE ZENKICHI HE IS A VERY GOOD ADDITION TO THE CAST OF PERSONA 5 AND THE GAMEPLAY IS VERY FUN VERY VERY FUN INDEED. I REALLY LIKE THE REQUEST SYSTEM ITS EVEN BETTER THAN BASE PERSONA 5'S. THE SOUNDTRACK IS AMAZING BUT ITS A PERSONA GAME SO THATS NOT A SURPRISE. THIS IS A VERY WORTHY SUCCESSOR TO BASE PERSONA 5 AND EVEN IF STRIKERS ISNT AS GOOD AS BASE PERSONA 5, IT'S ABSOLUTELY STILL AN INCREDIBLE GAME.\n\nMaybe not as good as Among Us though", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2163540845, "author": "4245e1a1-b2d0-35dc-b605-4838539906a9", "date": "2021-08-23", "hours": 71, "content": "Persona 5 Royal in Steam please (╯‵□′)╯︵┻━┻\nbtw very good game. 9/10 (ヘ･_･)ヘ┳━┳", "comments": 0, "source": "steam", "helpful": 1, "funny": 2, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3149410618, "author": "83d34a23-8445-3bc9-a926-82ea4b3ead4d", "date": "2021-08-25", "hours": 41, "content": "Hey Guys!  It's PERSONA.\n\nThis Persona is completely wacky because instead of a TV.. this time you jump into your IPHONE to collect your  demon slaves and recruit your loli cyber waifu partner.\n\nThe first boss is this angry little girl who decides to come out of the closet as a massive furry to your team.\n\nYup a big freaking BDSM dominatrix rabbit.\n\nYup... this is persona.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2617884579, "author": "c0036eb5-e2da-3404-96cd-bc76488cd5f3", "date": "2021-08-26", "hours": 123, "content": "zenkichi is a pretty funny guy", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3040813756, "author": "124b3f6a-cced-3f6e-9cb8-5841c6e54ac2", "date": "2021-08-26", "hours": 68, "content": "bruh", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3763005910, "author": "dd48d13a-089f-3b48-b3f1-5d1b686b0ab9", "date": "2021-08-27", "hours": 56, "content": "Absolutely amazing sequel to a game that can be considered the greatest game ever made", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 925233191, "author": "c415513b-1b67-37af-abb2-b7c47c270d41", "date": "2021-08-28", "hours": 82, "content": "Calling this game a spinoff of Persona 5 would be a disservice. Despite a huge difference in gameplay Persona 5 Strikers feels more like a proper sequel. Not only that but I can wholeheartedly say that I had more fun with P5S than with the vanilla Persona 5.\n\nPersona 5 Strikers, at its core, is a Musou type game with Persona mechanics. Meaning, a hack'n'slash with hundreds of enemies and some RPG elements. And surprisingly such combination works very well. The production values are quite impressive, with a brand new story reuniting the Phantom Thieves together, as well as introducing some well-developed new characters. The way the characters interact feels like a proper Persona game, and while the core story isn't anything groundbreaking, it is still very well presented, with some nice twists here and there. Honestly, I think I enjoyed the story more than the vanilla Persona 5, mainly because the characters we interact with are not just simple one-dimensional villains like in the original.\n\nDespite lacking the social-life aspect of previous Persona titles, many other elements unique to that series are present in Strikers. And the action-oriented gameplay works very well with them. Kind of brings back memories of the Devil Summoner series from the PS2, only better and even more dynamic. With several different playable and customizable characters, as well as dozens of Personas to fuse for the main character, the hack'n'slash gameplay doesn't get tedious too fast. Mashing buttons won't get you far, as there's still a need to be tactical and aware of enemies' affinities. That said, even though I'm no action game expert, I've found the controls to be very intuitive and comfortable. Rarely had any issues controling the characters or running around the environment.\n\nThe game looks and sounds great. The style is very similar to Persona 5, and the new music is very catchy, whether in battle, dungeons, or during free-time. Environments are numerous and varied. This goes for both the dungeons and the Japanese cities the party visits during their trip.\nThe game runs at 60fps and the PC port is honestly surprisingly good. Never had a single technical issue and the game ran very smoothly with no frame drops whatsoever.\n\nWhereas the original Persona 5, for me, got tedious very fast, I've found Persona 5 Strikers way more enjoyable. To the point I've started the New Game + on the highest difficulty only to appreciate it even more. Sure, there are some flaws, obviously, but my point is that the game is really good and every fan of Persona 5 should give it a try. Other people maybe not so much, mainly because Strikers is a direct sequel to Persona 5, which I'd suggest either play or watch beforehand.\n\nOverall, a great game that doesn't deserve to be called a spinoff, because it's much more than that. I've had tons of FUN with Strikers and I'm pretty sure I'll replay it again someday.", "comments": 0, "source": "steam", "helpful": 63, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3242106210, "author": "b307aba4-297d-31a3-833e-6eaec33ce8d9", "date": "2021-08-29", "hours": 37, "content": "fun game combining persona elements with dynasty warriors combat\n\nit hurts seeing Persona 5 Assets on PC without a P5 or P5R port though", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1025878600, "author": "68383a64-7811-33e0-9241-86a0384cba2c", "date": "2021-08-30", "hours": 34, "content": "it plays like Persona 5 and same palace exploration except you get to fight in real time and mash the all attack button (after hitting enemy weak elements) in the fights \n\ndoesnt really feel like a Musuo, you sneak up and do the \"Show Me Your True Form\" thing to start fights", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 645642360, "author": "44edf763-06de-3388-a18a-8059cba7e58d", "date": "2021-08-31", "hours": 51, "content": "Persona 5 Strikers overall does a fantastic job of bringing P5's characters and gameplay to a whole new style of combat.  Fights are smooth, the combos are satisfying, and it still feels like Persona combat.  Elemental affinities are still present, and Joker can freely swap between available Personas.  Every playable character feels unique and has a moveset I feel accurately represents them.  For example, Morgana can transform into his car form seen in Mementos, and several of Makoto's combos involve riding Johanna or rapid punches.  The story overall was pretty good and helped make this still feel like a Persona game.  The Phantom Thieves are rather static characters compared to the original game, but instead they help others find their own way, especially the two new members of the Thieves.  However the first few Jails can feel rather...samey and formulaic.  It doesn't help that every boss fight takes place in a castle.  It loses some of the uniqueness seen in P5's Palaces.  I also don't think the Jail Monarchs have the same impact as Palace rulers, but there were good ones.  \n\nOne major returning part of the game to really tie it back to the Persona series is the Velvet Room.  Lavenza alone manages it this time as Igor is nowhere to be seen.  And this was honestly what I felt to be the weakest part of the game.  Especially coming nearly fresh off of Persona 5 Royal, the Velvet Room felt very bare bones.  Persona Fusion works in pretty much the same way, but there's not much else.  You gain the ability to level your Personas directly up to Joker's current level with a new currency, but it gets very expensive very quickly.  Not helped are the new restrictions that the Personas themselves now must be at a certain level to be fused.  This wasn't a big deal in the early game, but trying to get powerful Personas in the late game was a chore as they often required Personas acquired in early Jails to be at a level far past when they stop learning new skills.  For example, King Frost requires Jack Frost and Jack-o-Lantern to be at level 40 while Joker to be at level 66.  But Jack-o-Lantern might be around level 8.  So the only way to get him the extra levels is to spend the new persona points.  But I at least could not find a reliable way of getting them besides re-summoning and dismissing high level Personas.  Gaining new Personas in the field is random; there is a chance a defeated Shadow will drop a mask for Joker, and that chance can be increased by leveling a skill.  Repeated Personas will give persona points instead of exp like in P5.\n\nOverall this is still a very fun game with fantastic music and a decent story, but I think Persona 5 Royal is the more polished experience.  But for a spin-off sequel in a totally different genre?  It did a great job.\n\nOne last note: the digital deluxe edition is slightly misleading.  The art gallery and OST are locked in a separate application with no built-in way to download the contents.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 666708738, "author": "7d5c4c4c-f4dd-3160-a936-1a475917c0c3", "date": "2021-09-01", "hours": 19, "content": "Persona 5 Strikers is a sequel/spinoff to Persona 5. Unlike it's predecessor which was a turn based jrpg with dungeon crawler/social sim elements, Strikers is an action hack and slash game in the vein of Dynasty Warriors.\n\nOne of my favorite aspects of this game is how familiar to Persona 5 it feels. It has so many little touches like the player being able to pause the game and view the dialogue log mid conversation. All of the player's companions return from the original which is a very welcome inclusion. As a huge fan of Persona 5's story and characters the primary selling point for this game was being able to continue the adventures of Joker and the gang. Which this game delivers. On the flipside this is also potentially the game's greatest shortcoming. It's a direct sequel to Persona 5 and fully expects you to have beaten that game before playing this one. Considering Persona 5 isn't on Steam (as of the writing of this review anyway) this is a massive problem. Because of that if you haven't previously played P5 or P5R you will be rather lost in terms of the story and general gameplay mechanics.\n\nThe action rpg combat is serviceable albeit very simple. It feels kind of mindless at times and selectively makes you pay attention when it throws a challenging enemy at you. It does feel like the developers did their best to try and make an action rpg out of Persona 5's combat. However I never felt like it ever surpassed that game in terms of strategy or personality. I can see this game appealing to people who were turned off of Persona 5's turn based combat. However because it's story expects you to have beaten P5 it also doesn't really appeal to newcomers. \n\nAll in all in terms of being a spinoff/sequel to Persona 5 it delivers. It gives you more of that game just with a different spin on things. Outside of that though if you weren't crazy about the original like I was it's hard to recommend. Especially since Persona 5 isn't on Steam as of yet. Hopefully if/when that game releases, Strikers can have a second wind on Steam. But til then it remains as a novelty for the minority of PS4 owners who own a gaming PC and were also huge fans of Persona 5.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 182642367, "author": "f1c56c70-f869-3b7b-ba4b-a880a918f4fb", "date": "2021-09-05", "hours": 13, "content": "Epic", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 195005948, "author": "9b90481b-3ee5-3eb1-a143-d2aad19fcc72", "date": "2021-09-05", "hours": 51, "content": "SMT games are quaking in their boots at this gameplay", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1623083087, "author": "82085ce8-7be4-3a56-aa59-11c655e0e38a", "date": "2021-09-07", "hours": 1, "content": "As my boyfriend played via family share on my encouragement and doesn't yet own the title, I'm posting this on his behalf:\n\n\"Can't believe this game flew under my radar.\n\nPros:\n-Persona 5 game in full motion.\n-Makes most action JRPGs look bad.\n-Doesn't play like Dynasty Warriors at all. Not a brainless hack-and-slash.\n-Full sequel story.\n-Excellent OST with revamped tracks from original game that hype the boss fights.\n-Sophia, the best AI ever.\n-More Phantom Thieves camaraderie. Had more laughs than the original game.\n\nCons:\n-Camera\n-You can't choose a waifu\"\n\nOn my part, it's fairly telling that I can sit there and just WATCH an entire game be played from start to end and STILL be highly entertained, I feel that says a whole lot. Storytelling is awesome, action is smooth and fast-paced. An excellent sequel to P5. \n\nDo recommend!\n\n", "comments": 0, "source": "steam", "helpful": 43, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3505446922, "author": "d344f197-5a16-3442-918a-889595ddd15d", "date": "2021-09-08", "hours": 61, "content": "okay this is cool and all, but can we get p5r on pc--", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 427344034, "author": "8b5f421f-7eb5-30d7-8027-47a05a479fca", "date": "2021-09-09", "hours": 117, "content": "Yes", "comments": 3, "source": "steam", "helpful": 61, "funny": 5, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1593398609, "author": "7574ed5f-c120-344b-8a25-e7366ce94d4a", "date": "2021-09-09", "hours": 15, "content": "Fuck your canon, give me Kasumi", "comments": 0, "source": "steam", "helpful": 91, "funny": 14, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2540835492, "author": "73c72300-26dd-3a69-b84c-722f645370c8", "date": "2021-09-09", "hours": 88, "content": "Atlus Didn't do this game justice in the marketing of this game. The marketing made it look like a niche mini game with maybe some light story. Instead we got a full blown proper campaign sequel to Persona 5. \n\nIf you liked Persona 5 then you love this game as well, Persona 5 2 is a more accurate title to this game.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3495406724, "author": "1afd6311-c04f-3ad2-b703-d953df9e5a1f", "date": "2021-09-10", "hours": 99, "content": "All the character of the original game, combined with the fast paced combat of Dynasty Warriors and other such games. It feels like a very well done hybrid or both types of games, still indisputably Perosna 5 while having the faster combat.", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 813991445, "author": "303951d7-8ce6-36cc-98ac-7aa4ae16062f", "date": "2021-09-12", "hours": 51, "content": "It didn't get me hooked on musou, but the blend of what modern Persona is known for and a fresh combat system kept me entertained the whole way through. The story hits the same notes as the original: hearts are getting messed with and there may be a god to punch in the face at the end. The \"realtime\" combat is... as interactive as you want it. Fuse a glass cannon and dodge for your life or plan it out in the menus (sometimes the only place to think). Technically if you play the game holding R1 it becomes turn based!\n\nIt's not without flaws though.\n\n• Quality healing items are few and far between. You're likely to have an inventory of a lot of low quality items to spam at once.\n• In pursuit of style the fluff adds up and makes menuing abysmmal. Buying from shops, entering dungeons, and more either lack quality of life benefits at scale or have unskippable animations (such as when the dungeon initially loads, no control for ~5 seconds despite buttons on screen) and are painfully obvious when done in bulk.\n• The completionist expectations are overkill and do not enhance the experience. Maxing the unique Bond skills could take up to 20 hours of intentional grinding. The fusion system got some QoL buffs only to add another grindable currency to fix the other problems it introduced. There's an exploit discovered by the community but it shouldn't be this bad to begin with.\n\nPersonally the best thing about this game is the length. 30-40 hours casually is way more accessible than 2-3 times that for a Persona 5 playthrough. The pacing of the plot is to the point and the goals are clear. \n\nThe same style and charm are on full display in this excellent continuation.\n\nSmall addition:\nThe Legacy BGM DLC is worthwhile to keep battles from sounding too repetitive, but the songs also unlock after clearing the game (which you might not want to replay at that point). The items DLC is irrelevant. Unfortunately the standalone costs are not justified so you're effectively upsold to the Deluxe for different MP3s to play while you one shot things.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2510892875, "author": "251eef94-9543-3644-a363-84670b67ed53", "date": "2021-09-12", "hours": 272, "content": "best spin off to persona series if you like a good story as well as good game play would recommend", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 540197, "author": "2e53dbe6-af54-3617-9aed-e38da1867cc7", "date": "2021-09-13", "hours": 91, "content": "Hello  there  ,  hope you are doing well  . I have finished the game but for some reason I forgot to write a review for this amazing game . So , let me begin by saying that if you haven't played Persona 5 or Persona 5 Royal ,stay way  from this game at all costs  if you don't want your experience to be ruined (If you have specific questions about that ask  me in the comments and i will  try to explain  as much  spoiler free as possible) . Since  I am afraid that I might spoil  something and the fact that  English is not my mother tongue language , I will be short  :\nPros  : \n- Soundtrack :  Even though  this is a sequel/spin off and clearly I thought that the budget is gonna be less , I expected that  the quality  would not be as good as Persona 5/Royal , the game absolutely  destroyed my negative expectations . I can safely say that the quality of the different songs of  this game were on par with the soundtrackk of Persona 5 if not better . And  Lyn Inaizumi with her superb tone and really good control on the high notes, a great overall performance as always . Give her some love please on Twitter .\n- Engine : I really don't know what Engine did they use on Persona 5 strikers but  the textures for characters ,objects,game terrain are light  years more clean than the  Persona 5 Royal (which have a slight upgrade on it's graphics in comparison with  the vanilla Persona 5) . And  even though this is anime or as some smart people like to say it ''a weeb'' game , the game looks soooooooo good in 4K  60 fps and everything  on the highest  settings to the  point that I could not believe it . \n-Gameplay: At first ,  when it first was announced for the Japanese market I thought that the gameplay will be  broken , poorly made or whatever you want to call . And I was sure (for some reason) that this type  of gameplay will absolutely not  fit well on a Persona game so decided to ignore it since I believed that it won't have a Western release . After some time when the game was announced for the West , I decided  to take the risk (due to my bias towards the Persona franchise and Atlus)  and preorder the digital deluxe . So the early access released  and  I started playing . Not only it is not boring  but it also has so many many creative mechanics that build on the Dynasty Warriors gameplay  formula and make it wayyyyy more fun  than I expected and it  felt so good using the different new  mechanics  .\n-Story (SPOILER FREE) : Even though I have the bias i already mentioned above  ,  I never expected the story of this spin off (which also servers a sequel to Persona 5) to be so well crafted . Of course , not as big (that’s what she said) and good as the Persona but so much better than your everyday spinn off \n-Duration/NG+ : First of all , the playtime I currently have is not  accurate because I have spent  1-2 hours looking  at the preorder bonuses . Also this is the duration of my first playthough and I haven't started yet NG+ .  NG+  is neccessary if you want to earn al the achievements . I am the type of player that likes to look every nook and cranny of the game , unlock  all the abilities for the characters , do all the side quests first  and then start doing the main story to unlock new side quests (and repeat ) until I finish the game  . \n Cons: \nThe only  thing I didn't like was the epilogue(it was rushed in my opinion but it probably they didn't have the apropriate budget to make it  smoother , I can't be  sure )  and fact that [spoiler] you can predict after a certain point  in the main story who the main antagonist is so I wish they would have hidden this person  better but it didn't bother me that much . Don't make that stop you from buying it , it is just my personal whining [/spoiler]\n\nOoof , I wrote more than I expected . Before  I  leave please leave  a comment if you  have anything to ask before buying in the comments . Have a great day and stay safe !!!!!!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 580430914, "author": "a7e73a1d-0825-3901-8143-83f106fbb90c", "date": "2021-09-13", "hours": 56, "content": "I can't recommend this game to anyone who haven't played persona 5 vanilla, you may hear that is not necessary, but it is,not from a fanboy perspective,the game will make not sense to you otherwise,and there's no recap of the events that took place during persona 5(just a few mentions),with that said, is a great game, different yet familiar to the persona's series, and a nice goodbye to the Phantom Thieves.", "comments": 0, "source": "steam", "helpful": 8, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 453488579, "author": "6ca29bb5-7b00-3ebf-b093-4b81b825bd92", "date": "2021-09-14", "hours": 12, "content": "my mediocre PC that barely runs shadow of mordor runs this game better than the switch does\ngame itself is pretty good", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2590118292, "author": "1bcf0185-42d2-3a57-8d0d-503657ed8a4a", "date": "2021-09-16", "hours": 77, "content": "You'll never see it coming!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1453469588, "author": "22e7e32c-9eab-3c3b-a457-1dcdea83480e", "date": "2021-09-17", "hours": 76, "content": "First off, I highly recommend that you play Persona 5 first. Unfortunately, as of now, the game isn't available on PC. Try PlayStation for that one. \n\nAnother thing - this follows the continuity of *Persona 5*, not Persona 5 Royal. \n\nWith that said, this serves as a satisfying sequel to the game. \n\nStory-wise, it's nothing too crazy. The game takes place over the span of a month (which might make it sound short, when you compare it to other persona games, but this game takes around maybe 30-50 hours to complete a single playthrough, depending on the player of course) and you spend that month travelling across Japan and exploring multiple cities and jails (this game's version of a palace). The new characters are great too, and are defined well by the end of the story. \n\nThe combat is addicting, which I've heard is a controversial opinion, but I stand by that. It's endlessly satisfying to chew through hordes and hordes of enemies with all sorts of combos and attacks at your disposal, and boss battles can feel challenging yet rewarding (unless you're over-leveled or something, but this is under the assumption that you're progressing at a regular pace), and there are plenty of side quests that include tougher bosses and greater rewards. \n\nSocial links are absent here, and in place of them is a \"Bond\" meter, which pretty much is your standard \"level-up-bar\". You fill it naturally by playing through the story and winning battles and doing certain side quests, etc. This fits well, considering that this game is shorter and is much more *centered* around battle, rather than split between battle and life sim. \n\nThe game looks great too, but you probably already knew that. \n\nTotally worth playing through, and doing a new game+ so you can really bathe in the glory of your OP abilities by then. (I suggest merciless, for the sake of keeping things manageable but not easy)\n\n9/10, satisfactory story, great characters, great music, great combat, no pancakes. :(", "comments": 0, "source": "steam", "helpful": 28, "funny": 2, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 747815693, "author": "a57f7682-8de6-3dbf-b19e-37d0043d9c9c", "date": "2021-09-20", "hours": 56, "content": "As per usual a persona game manages to take another genre I dislike and create something I love immensely", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1385738086, "author": "a371d3d0-e74f-3f72-8800-164c3b38c877", "date": "2021-09-20", "hours": 29, "content": "Wonder what would come out if devil may cry had a baby with pokemon? well, me neither, but here is the answer.", "comments": 0, "source": "steam", "helpful": 35, "funny": 18, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 14727958, "author": "4e03285e-6f98-383a-b9f6-bf494208d1ca", "date": "2021-09-22", "hours": 7, "content": "Very Very fun game", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2527668371, "author": "6e27f634-46ba-3600-af90-a4611e27a502", "date": "2021-09-22", "hours": 161, "content": "ep i c", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4043415801, "author": "aabfbbea-1bac-3daa-97d9-bfe85594695a", "date": "2021-09-22", "hours": 28, "content": "Ok, its a good game but Atlus... Why the fuck are you putting a sequel to a game on pc that doesnt have the game that came before it, im not a port beggar but if your gonna do this then why would you not put royal on pc", "comments": 8, "source": "steam", "helpful": 403, "funny": 13, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3299898986, "author": "3ab6461d-c37f-35a2-bc6a-cf3174ccff5d", "date": "2021-09-25", "hours": 112, "content": "for real????", "comments": 0, "source": "steam", "helpful": 3, "funny": 6, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3361279306, "author": "9d6126dc-28a2-337b-b7ba-89e746f46ee6", "date": "2021-09-25", "hours": 109, "content": "[b] AVERAGE PERSONA ENJOYER [/b]\n\n⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠛⠛⠛⠋⠉⠈⠉⠉⠛⠻⢿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⡿⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⢿⣿⣿⣿⣿\n⣿⣿⣿⣿⡏⣀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿\n⣿⣿⣿⢏⣴⣿⣷⠀⠀⠀⠀⠀⢾⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿\n⣿⣿⣟⣾⣿⡟⠁⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣷⢢⠀⠀⠀⠀⠀⠀⠀⢸⣿\n⣿⣿⣿⣿⣟⠀⡴⠄⠀⠀⠀⠀⠀⠀⠙⠻⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⣿\n⣿⣿⣿⠟⠻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠶⢴⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⣿\n⣿⣁⡀⠀⠀⢰⢠⣦⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⡄⠀⣴⣶⣿⡄⣿\n⣿⡋⠀⠀⠀⠎⢸⣿⡆⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⠗⢘⣿⣟⠛⠿⣼\n⣿⣿⠋⢀⡌⢰⣿⡿⢿⡀⠀⠀⠀⠀⠀⠙⠿⣿⣿⣿⣿⣿⡇⠀⢸⣿⣿⣧⢀⣼\n⣿⣿⣷⢻⠄⠘⠛⠋⠛⠃⠀⠀⠀⠀⠀⢿⣧⠈⠉⠙⠛⠋⠀⠀⠀⣿⣿⣿⣿⣿\n⣿⣿⣧⠀⠈⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠟⠀⠀⠀⠀⢀⢃⠀⠀⢸⣿⣿⣿⣿\n⣿⣿⡿⠀⠴⢗⣠⣤⣴⡶⠶⠖⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡸⠀⣿⣿⣿⣿\n⣿⣿⣿⡀⢠⣾⣿⠏⠀⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠉⠀⣿⣿⣿⣿\n⣿⣿⣿⣧⠈⢹⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿\n⣿⣿⣿⣿⡄⠈⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣾⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣦⣄⣀⣀⣀⣀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡄⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠙⣿⣿⡟⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠁⠀⠀⠹⣿⠃⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⣿⣿⣿⣿⡿⠛⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⢐⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⣿⣿⣿⣿⠿⠛⠉⠉⠁⠀⢻⣿⡇⠀⠀⠀⠀⠀⠀⢀⠈⣿⣿⡿⠉⠛⠛⠛⠉⠉\n⣿⡿⠋⠁⠀⠀⢀⣀⣠⡴⣸⣿⣇⡄⠀⠀⠀⠀⢀⡿⠄⠙⠛⠀⣀⣠⣤⣤⠄", "comments": 1, "source": "steam", "helpful": 163, "funny": 72, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1880134952, "author": "f87d2959-3c85-303c-a8a2-9dec862edda0", "date": "2021-09-27", "hours": 76, "content": "For real?!", "comments": 0, "source": "steam", "helpful": 3, "funny": 5, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2093476662, "author": "57a5800d-7f7b-3efa-ab06-4486715a199d", "date": "2021-09-27", "hours": 28, "content": "It's good jaa", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4169686003, "author": "656728c2-48c7-37a0-b7a3-b0ab078b62df", "date": "2021-09-27", "hours": 106, "content": "Excellent game, shame it's prequel isn't available on PC though...", "comments": 0, "source": "steam", "helpful": 4, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 365114994, "author": "7f82a188-e10c-3e50-a511-2ca2c693ff27", "date": "2021-09-28", "hours": 87, "content": "It's more of the Phantom Thieves :)", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 683067992, "author": "a77ea9f7-4c14-3768-8126-8f9448a0d419", "date": "2021-09-28", "hours": 14, "content": "since this game assumes you already know persona 5's world and characters, it doesn't do a full fledged introductory portion at the beginning, and thus it's way easier to jump right into the action. haven't played much of it yet but it's definitely already one of my top persona games.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4065789870, "author": "feea8341-0188-3e2a-b9ed-2b964a0a64cc", "date": "2021-09-28", "hours": 51, "content": "ryuji says a very bad word", "comments": 0, "source": "steam", "helpful": 88, "funny": 43, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4103019685, "author": "441773fc-0da0-3d34-83a7-14c0c63182e0", "date": "2021-09-28", "hours": 100, "content": "Loved Persona 3, Loved Persona 4, Loved Persona 5, Love This", "comments": 0, "source": "steam", "helpful": 8, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1746877828, "author": "a28147f4-140f-3cda-876e-68f042e606a3", "date": "2021-09-29", "hours": 209, "content": "good game. fun.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2534500132, "author": "36adb7fc-2cac-39d1-b333-17bff674f5d2", "date": "2021-09-29", "hours": 69, "content": "GUYS DO NOT TRY TO PLATINUM PERSONA 5 STROKERS AT 3 AM no seriously do not at all just dont", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1018638510, "author": "20116546-5f0a-36bd-827a-e13f141727d3", "date": "2021-09-30", "hours": 3, "content": "I love persona 5, I was happy that this game had a continuation. I have extreme bias on this game, because Persona 5 is definitely my favorite game of all times. There is so much fun tidbits that makes the cast and humor funny. I love the characters, writing, and visuals. The styles and humor makes the whole game colorful for me. I hope Persona 5 royal will come out on PC someday. This game felt like a little fanservice that touched my heart after Persona 5 Royal. Please keep up the great work developers!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1722691297, "author": "f8ffec67-f194-3ff9-8b5d-dfa655aa4f41", "date": "2021-09-30", "hours": 27, "content": "Pro:\ntheme of the story about mental health\ncombat system, satisfying movement\njapanese dub\namazing soundtrack\n\nCon:\nCamera\n\ni want Persona 5 and Persona 5 Royal pc ver", "comments": 0, "source": "steam", "helpful": 18, "funny": 2, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 513056623, "author": "f043f5e2-e25c-3316-9f7a-32691326ddf7", "date": "2021-10-01", "hours": 18, "content": "The story and gameplay is really great so far!\nIf you love the original Persona 5, give it a go!~", "comments": 3, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2061668236, "author": "f658da1d-b43f-3f42-a680-961d11fecd0a", "date": "2021-10-01", "hours": 62, "content": "Play it", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3174911253, "author": "1f6c9478-431a-391d-822a-66dfe8ddf23f", "date": "2021-10-01", "hours": 11, "content": "Def a raccoon", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1886395067, "author": "d8ce3e48-534c-313b-94bc-d66dc36f8e29", "date": "2021-10-03", "hours": 32, "content": "The gameplay of P5S is pure dopamine, story is good so far too!! Love it. It does make me miss the turn-based combat of P5 though. x", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2479511415, "author": "fb219c5c-1861-3252-adc5-aa178e866707", "date": "2021-10-04", "hours": 109, "content": "This game managed to feel like a sequel and not a cheap spin off. Atlus remains undefeated.", "comments": 0, "source": "steam", "helpful": 31, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2696530210, "author": "be09c05c-2cde-3906-84b2-99c160ed6bbc", "date": "2021-10-04", "hours": 68, "content": "Just about everything I loved about both Personas 5 and Royal is transplanted into Strikers. The charming characters, the story, the vibrant menus, and the music combine with a new combat system that disposes of turn-based, RPG-style fighting in favor of a more frenetic, real-time, one vs. 1,000 format that still makes you feel like you’re playing a Persona game.\n\nPut the Phantom Thieves in damn near anything, and I’ll show up. They’re so well-written, realistic-sounding and mature. And they’ve grown from when we last met them, showing empathy to their adversaries. You’ll cheer when they get their big damn hero moment. How could I not take the opportunity to spend another 100 hours with these kids? And on a cross-Japan road trip too? Say less.\n\nIt’s almost unfair to call Strikers a musou game, despite being one, as it doesn’t feel like a Dynasty Warriors game at all. For as much as I love Koei Tecmo’s tentpole action series, Strikers’ combat is too slick and too varied, and too stylistically Persona to be called a typical musou. And I think it’s that combat that saves an otherwise sparsely appointed game.", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 952063128, "author": "5c2733d9-281d-331c-9d37-b319c6caaf54", "date": "2021-10-05", "hours": 45, "content": "A RIVER IN A DRY LAAAAAAAAAAAAAAAND", "comments": 0, "source": "steam", "helpful": 35, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1015918902, "author": "825f69b5-810f-37d8-8637-a491c0385951", "date": "2021-10-06", "hours": 13, "content": "p5r on pc when tho", "comments": 0, "source": "steam", "helpful": 161, "funny": 6, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1398925591, "author": "2a3d3c15-72e2-3b46-80bf-d91c90463642", "date": "2021-10-08", "hours": 49, "content": "I enjoy", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2285121349, "author": "2176ce2f-58d7-37fd-9066-fa1bcc584d67", "date": "2021-10-08", "hours": 64, "content": "I love the game but where is Persona 5 Royal?", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2349471719, "author": "715c2a18-e494-376f-a695-e6831b9bd367", "date": "2021-10-09", "hours": 100, "content": "my friend got access to my steam account and wiped my almost complete save file, but yeah still good game", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3852682964, "author": "347df42a-221b-3825-ac50-07704e917e7a", "date": "2021-10-09", "hours": 16, "content": "[h1]A classic re-imagined[/h1]\nGame Design: Persona elements fit really well with Musou. \n☐ Revolutionary\n☐ Very good and Innovative\n☑ Good and refreshing\n☐ Nothing special\n☐ Okay\n☐ Bad\n☐ Repetitive and cliché\n\nArt/Aesthetics: Persona 5 was ground-breaking, P5S repeats the same formula.\n☐ Masterpiece\n☐ Beautiful\n☑ Good\n☐ Will do\n☐ Bad\n☐ Awful\n\nAudio/Soundtrack: Music feels the same as P5, but with not as many iconic tracks as the previous entry.\n☐ I've liked on Spotify\n☐ Very good\n☐ Good\n☑ Decent\n☐ Not too bad\n☐ Bad\n\nNarrative: A bit repetitive, particularly if you already played P5.\n☐ Nobel Prize in Literature\n☐ Great\n☑ Good\n☐ Average\n☐ Not great\n☐ None / NA\n\nDifficulty: It take some time to learn the basics, but it's easy once mastered.\n☐ Even my deaf cat can play it\n☐ Easy\n☑ Normal\n☐ Easy to learn / Hard to master\n☐ Hard\n☐ Souls-like\n\nHow long does it take to beat the main game? \n☐ less than 10 hours\n☐ 10-30 hours\n☑ 30-60 hours\n☐ 60+ hours\n☐ Endless / NA\n\nPrice: For a game that's not revolutionary and use a lot of elements of the previous entry, I feel this game is a bit overpriced.\n☐ It's FREEE\n☐ Worth every cent\n☐ Wait for sale\n☑  Overpriced\n\nFinal Score: 7/10\n★★★★★★★☆☆☆\n\nAdditional Comments:\n[b]Wake Up, Get Up, Get Out There![/b]", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 646696432, "author": "a28d669d-26ee-37c9-ab48-86c38b8b4dab", "date": "2021-10-12", "hours": 14, "content": "Bruh... ok, this game is good. But Atlas... where tf is the game before this? I can't really play this game much more until I play Royal, so, please put Royal on Steam... please.", "comments": 0, "source": "steam", "helpful": 18, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3082438298, "author": "c8a2bdcc-8d6d-3092-a293-0d1fc8058b6c", "date": "2021-10-12", "hours": 5, "content": "Pros: More Futaba\nCons: Futaba not playable", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 941615550, "author": "d76d0b04-25b3-3568-ac34-e1cf8e9520d4", "date": "2021-10-15", "hours": 92, "content": "Sociopaths are people too and AIs have hearts\n\nThanks, Persona!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 409953789, "author": "c0355731-4da0-3394-a263-d81330390ecf", "date": "2021-10-17", "hours": 51, "content": "The perfect \"we're back together for another heist.\" Highly recommend playing Royal first or at least base Persona 5. If you're a fan, this game is fantastic. If you're not, it's still a very cool mix of RPG elements and hack n' slash. Plus persona 5 aesthetic and music.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2462631819, "author": "f34cc218-c6ac-3038-8d1e-d063d8d6c722", "date": "2021-10-17", "hours": 30, "content": "fun", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 313128429, "author": "487ddaaa-e6a8-3ec1-a8f0-2f598643cf6b", "date": "2021-10-18", "hours": 57, "content": "Not a bad game and is perhaps enjoyed more by people who have completed Persona 5 and Royal, I would highly recommend playing them first . It isn't a patch on those games, but fun all the same. Can't wait for Persona 6", "comments": 0, "source": "steam", "helpful": 8, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 890930154, "author": "d6c15a07-d7cf-3278-90a5-075af1e06b5c", "date": "2021-10-19", "hours": 72, "content": "This is persona 5 light fused with a musô. \n\nFirst, I would strongly recommend coming here after playing the original persona 5 or better persona 5 royal (even though in this case some elements would not be cannon with this story). First, it is a sequel / OVA so starting by the second entry is a bit silly, second a good half of the persona experience is your link with its cast of characters so, even if most of the mechanics of the story are re-explained, you would miss a lot a things, and persona 5 is one of the best games of last generation sooo...\n\nAnyway, presentation wise, exactly like its predecessor, this game is pristine, beautiful, inspired and varied environments, the music (again) is awesome, great animation works... It just radiates quality.\nSame thing in the writing department, the characters are as endearing as ever, and the additions to the thieves are very welcome, but the plot is a tad predictable sometimes.\nThe problem arises in the gameplay department, the moment-to-moment gameplay is clearly an experiment here, sometimes fighting can be tedious because of the stuck camera, lack of clarity, and the amount of enemies / time to dispatch them… when it’s good it is really good you dodge and weave through the enemies with grace… until nothing shows you that another enemy is about to one shot from behind… Also, some jails (think palaces in p5) are a bit too big and revisiting them can be a bit tedious. The fusion system is a bit more tedious with level requirement for fusions components. And for the out of jail part, it is good, the confident system has been replaced by a much simpler system that allows you to unlock bonuses by collecting points doing requests (simple quests), after story event and during fighting, simpler but fitting for this much simpler game.\nAnyway, it is a quality game with some gameplay inconsistencies, though even though it is less good than its mainline entry, I enjoyed it a great deal and if you liked p5 you should too! Though I would really love to see another iteration on these mechanics, a p6s maybe? \nAnyway, it’s time for you to tear your mask out, right?", "comments": 0, "source": "steam", "helpful": 14, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2352219450, "author": "f1b6fda3-510b-38fe-b26e-676039a4b3fd", "date": "2021-10-26", "hours": 4, "content": "Where is Persona 5 you cowards?", "comments": 0, "source": "steam", "helpful": 390, "funny": 59, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 491244114, "author": "72b2f18f-6dd7-3cd4-9eb6-10ce07ce832d", "date": "2021-10-29", "hours": 7, "content": "gimme persona 5 royal", "comments": 0, "source": "steam", "helpful": 343, "funny": 19, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 883476623, "author": "5eda8599-3bf9-3194-bdf9-4f35782b61b9", "date": "2021-11-03", "hours": 65, "content": "\"I wanna be a cowboy, baby\"", "comments": 0, "source": "steam", "helpful": 22, "funny": 7, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4248803332, "author": "50514bb1-8bd2-31be-9d5e-596f6f057113", "date": "2021-11-03", "hours": 39, "content": "P5S is a sequel/ spinoff of Persona 5, and its pretty good. The question I see about this game all the time is \"do I need to play Base Persona 5 to play this one?\" and yeah, I think you should. It takes place directly after, and while they don't touch on the story of P5 often, you still miss a lot of information on the characters and world, and if you go back to P5 later, a lot of stuff will be spoiled for you. Its not MANDITORY by any means, but enhances the game considerably. \n\nWith that out of the way, the game itself is a hack and slash game similar to the Warriors Series. And this is the first game with that combat I've consistently enjoyed. I've played Fire Emblem Warriors and Hyrule Warriors, and both of them get really REALLY boring after so many hours, but P5S keeps it fresh the whole way through, and is the only of this kind of game I've gone and 100%ed. The Demon Fusion elements from SMT are still present, but have been watered down considerably. This was a downside for me, but if you found the system tedious, this could be a good thing for you. Unless you're going for full completion, there is minimal grinding in this game, and the different ways to improve are all satisfying and fun to keep up with. The social aspect is all gone and the story is very streamlined, which makes it feel a lot less \"persona-y\" and the story is generally far more simple than anything else you'll see in this series, but the game never pretends to be more than it is. If you're coming for a simple button masher with some familiar faces and a cool world. you're in the right spot. But if you want a game that will make you feel the same way previous Persona games did, you're in the wrong spot. Overall if you liked P5 and want more. I'd recommend checking this one out. 6/10", "comments": 0, "source": "steam", "helpful": 5, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 508430387, "author": "f1fec7d7-e504-396c-a42e-b5cd7459c810", "date": "2021-11-05", "hours": 27, "content": "Persona 5 Strikers is a great Musou game, and even though for veterans of the series it might feel intimidating but it’s worth it for the plot.\n\nThe game runs so well on PC but it does beg the question: why isn't Persona 5 on PC yet?\nIt’s time to bring it to other consoles other then the PS4 so more players will get to experience the full story.", "comments": 0, "source": "steam", "helpful": 149, "funny": 5, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3630775584, "author": "fab9046f-e5fa-3bcf-8f8b-67b9c5adb94e", "date": "2021-11-07", "hours": 103, "content": "What a journey!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1372832623, "author": "547938b1-6b2a-388d-9ad0-d8e3cbeafa9d", "date": "2021-11-08", "hours": 29, "content": "Good game", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3635216986, "author": "a4741dc3-fe76-3c70-9120-238b27b3368a", "date": "2021-11-09", "hours": 80, "content": "persona but button mash", "comments": 0, "source": "steam", "helpful": 3, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 937600268, "author": "640970fd-ebae-347f-92d9-a6e50fb44e5b", "date": "2021-11-11", "hours": 1, "content": "You think Sojiro has sniffed Futaba's kneesocks?", "comments": 1, "source": "steam", "helpful": 5, "funny": 2, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3137548043, "author": "a182eaea-48d3-3385-afd1-a6d27c4dbc32", "date": "2021-11-11", "hours": 63, "content": "If you want to know if Persona 5 Strikers is right for you, simply answer yes / no to the following questions:\n\n1 - Did you play Persona 5?\n2 - Did you like Persona 5?\n3 - Do you like action / Hack n slash games?\n\nIf you answered \"yes\" to the questions above, you will love Persona 5 Strikers.  I loved it.  \n\nThe game is lengthy.  The mechanics are fluid.  The integrated RPG elements are well done.  The story is great and its wonderful to have the Phantom thieves back together again for a second romp.  The writing is good.  \n\nExcessive chit chat can get a little tiring towards the end of the game.\n\nOverall excellent.", "comments": 0, "source": "steam", "helpful": 2, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 126907229, "author": "d2109117-d957-3427-82ea-f39d9682d107", "date": "2021-11-12", "hours": 32, "content": "i kinda look like joker from persona 5\n", "comments": 0, "source": "steam", "helpful": 67, "funny": 55, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 610678510, "author": "a5409309-c29d-3a72-8d4c-130a56572df0", "date": "2021-11-13", "hours": 121, "content": "Atlus please hear our voices... just listen to your fans, WE NEED PERSONA 5 ROYAL! \n\nIf you have enjoyed previous persona games then this amazing sequel will not disappoint, more importantly even if you have never played the prequel you will never feel that way, it's like you took a break and you're back together again with your buddies to start a whole new kickass journey.\n\nWith a god tier soundtrack, you're in for a wild ride.", "comments": 0, "source": "steam", "helpful": 169, "funny": 5, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 388066475, "author": "9105b43d-905c-351b-8f75-0eb57dcea58e", "date": "2021-11-14", "hours": 39, "content": "Persona 5 is widely considered to be one of the best JRPGs of all time and with good reason. The story won't make any sense unless you've played that one first, so it's pretty much required for a narrative driven game like this. The game oozes style from the music to the menu screens even, and it's a lot of fun to play. The side quests are reasonable and the unlocks and skill progression are rewarding. It's even significantly better paced than its predecessor, managing to include as many story beats in about a third of the play time, which is particularly welcome.\n\nUnfortunately, the combat is trash. I'm not a big fan of the button mashing genre, so the largest change in Strikers here was a very unwelcome one for me. With that said, I switched over to easy mode and chugged through it to enjoy the rest of the experience, which lines up note for note with the original.", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3329709608, "author": "d6b0f66f-6395-37d1-b61c-997b160d07ef", "date": "2021-11-14", "hours": 62, "content": "I'm about halfway through, and this game rules. The Persona fusions and skills are still just as useful here as in 5 and Royal, and the twists and bends the narrative takes are highly similar to 5, but lean more towards Royal. Basically, if you liked 5, give this a try.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3711937775, "author": "f82fbb39-63ff-38f0-951c-3d289374d1c0", "date": "2021-11-14", "hours": 39, "content": "It's like Persona 5 but without the heart", "comments": 1, "source": "steam", "helpful": 97, "funny": 75, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4129586777, "author": "6d52ebf4-2dc7-3a35-b2c4-fca4e9a3b8e1", "date": "2021-11-14", "hours": 63, "content": "If you love P5 then you pretty much obliged to get this. Calling this a spin off is doing is blasphemy m8. It's pretty much P5-1.5 :D\nWell? STOP READING THIS AND BUY IT!", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4091859186, "author": "2ca36514-301b-3949-bb8f-4c11c249ff75", "date": "2021-11-15", "hours": 130, "content": "Anyone familiar with the Warriors games will have a rough understanding of what to expect. But this time around the Persona mechanics are integrated quite well, making it a very different experience than any Warriors game before it - if anything, the much larger number of enemies than normal for a Persona game necessitates a stronger focus on the weakness system in order to maintain an advantage. And yes, Persona collection and fusion are still core mechanics as well. Overall, it lends itself to using very different tactics than a normal Persona game, and combinations I wouldn't have really bothered with outside of this game. The story and cutscenes are completely faithful to what one would expect of Persona, and I felt were very fulfilling.\n\nThat being said, I will say the boss design is a bit weak - the major bosses do have unique mechanics and do feel unique, but the fights drag a bit and begin to feel stale with the amount of hp they have. The minor bosses don't have the benefit of unique mechanics to offset the hp-spongeness.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1332081472, "author": "fba5cab2-4dc7-3362-abde-2c9bb6e396c4", "date": "2021-11-18", "hours": 46, "content": "p5 and p5r when", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1057139548, "author": "ea66bf07-d055-3a24-a2bf-2e8d1bc9c119", "date": "2021-11-21", "hours": 61, "content": "As Persona fan, It is really a fun Persona game!!!\nI hope Persona 5 or maybe Persona 5 Royal will be soon ported to PC\n\nP.S: This is not a Musou Game like Dynasty Warrior, it is an Action Persona game so the difficulty was not easy, and will takes a bit of time to get used to chara moveset etc.\nOtherwise, as I said before, this game was really FUN! Really worth it for the price, if you ask me", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 753041472, "author": "bcb7d2a7-4339-365a-b71a-b37e15a3c822", "date": "2021-11-24", "hours": 42, "content": "While I would totally recommend it, it doesn't have the magic or interest of Persona 5. The story is alright, but the characters are a bit one-note and often feel more like tropes than characters. It's hard to explain, but I've been playing on and off since launch and still haven't finished. I just haven't had the desire to play. The game runs pretty good, although it is locked at 60FPS. \n\nIf you like warriors games, definitely pick it up. Otherwise I'd wait for a good sale. I think 30-40 dollars is good. My only huge complaint is the difficulty. Easy feels way too easy but normal feels a bit too hard- I wish there was something in the middle.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 934335901, "author": "733b2f42-72fa-3e84-a34b-7bb18c7860c4", "date": "2021-11-24", "hours": 79, "content": "The continuation of that slice of Japan that you're already invested in.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1642622484, "author": "f53802f1-2ba9-3471-bdee-75ddde165626", "date": "2021-11-24", "hours": 16, "content": "Best part is still Lyn vibin'\n\n(And yes please keep the flow of Atlus games to PC going)", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1754447904, "author": "8f6afc2a-1b7f-3052-9080-8559574f9fad", "date": "2021-11-24", "hours": 54, "content": "It ok\n", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1904903536, "author": "a5b1bfb6-fe44-355a-9f03-0c141da26cc7", "date": "2021-11-24", "hours": 63, "content": "good game", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2233987869, "author": "0ca0d2c4-cb16-3ee2-8cd8-77b18b0f8e9a", "date": "2021-11-24", "hours": 51, "content": "I'm the Scatman\nSki-bi dibby dib yo da dub dub\nYo da dub dub\nSki-bi dibby dib yo da dub dub\nYo da dub dub\n(I'm the Scatman)\nSki-bi dibby dib yo da dub dub\nYo da dub dub\nSki-bi dibby dib yo da dub dub\nYo da dub dub\nBa-da-ba-da-ba-be bop bop bodda bope\nBop ba bodda bope\nBe bop ba bodda bope\nBop ba bodda\nBa-da-ba-da-ba-be bop ba bodda bope\nBop ba bodda bope\nBe bop ba bodda bope\nBop ba bodda bope\nEverybody stutters one way or the other\nSo check out my message to you\nAs a matter of fact, I don't let nothin' hold you back\nIf the Scatman can do it, so can you\nEverybody's sayin' that the Scatman stutters\nBut doesn't ever stutter when he sings\nBut what you don't know, I'm gonna tell you right now\nThat the stutter and the scat is the same thing\nYo, I'm the Scatman\nWhere's the Scatman?\nI'm the Scatman\nWhy should we be pleasin' all the politician heathens\nWho would try to change the seasons if they could?\nThe state of the condition insults my intuition\nAnd it only makes me crazy and a heart like wood\nEverybody stutters one way or the other\nSo check out my message to you\nAs a matter of fact, don't let nothin' hold you back\nIf the Scatman can do it, brother, so can you\nI'm the Scatman\nBa-da-ba-da-ba-be bop bop bodda bope\nBop ba bodda bope\nBe bop ba bodda bope\nBop ba bodda\nBa-da-ba-da-ba-be bop ba bodda bope\nBop ba bodda bope\nBe bop ba bodda bope\nBop ba bodda bope\nSki-bi dibby dib yo da dub dub\nYo da dub dub\nSki-bi dibby dib yo da dub dub\nYo da dub dub\nSki-bi dibby dib yo da dub dub\nYo da dub dub\nSki-bi dibby dib yo da dub dub\nYo da dub dub\nEverybody stutters one way or the other\nSo check out my message to you\nAs a matter of fact, I don't let nothin' hold you back\nIf the Scatman can do it, so can you\nI hear you all ask 'bout the meaning of scat\nWell, I'm the professor and all I can tell you is\nWhile you're still sleepin', the saints are still weepin' 'cause\nThings you call dead haven't had the chance to be born\nI'm the Scatman\nBa-da-ba-da-ba-be bop bop bodda bope\nBop ba bodda bope\nBe bop ba bodda bope\nBop ba bodda\nBa-da-ba-da-ba-be bop ba bodda bope\nBop ba bodda bope\nBe bop ba bodda bope\nBop ba bodda bope\nSki-bi dibby dib yo da dub dub\nYo da dub dub\nSki-bi dibby dib yo da dub dub\nYo da dub dub\nSki-bi dibby dib yo da dub dub\nYo da dub dub\nSki-bi dibby dib yo da dub dub\nyeah, I'm the Scatman\nWhere's the Scatman?\nI'm the Scatman, repeat after me\nIt's a scoobie oobie doobie, scoobie doobie melody\nI'm the Scatman, sing along with me\nIt's a scoobie oobie doobie, scoobie doobie melody\nYeah, I'm the Scatman, I'm the Scatman\nBop ba bodda bope\nBe bop ba bodda bope\nBop ba bodda\nI'm the Scatman\nBop ba bodda bope\nBe bop ba bodda bope\nBa-da-ba-da-ba-be bop bop bodda bope\nBop ba bodda bope\nBe bop ba bodda bope\nBop ba bodda\nBa-da-ba-da-ba-be bop ba bodda bope (Yeah, I'm the Scatman)\nBop ba bodda bope (sing along with me)\nBe bop ba bodda bope (it's a scoobie oobie doobie, scoobie doobie melody)", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2254464170, "author": "943c4ab5-d546-303f-98c3-6c020ea0c425", "date": "2021-11-24", "hours": 59, "content": "Amazing game, Koei Tecmo outdid themselves on the gameplay, the visual style of persona 5 is immaculate and suits this game to a T. Furthermore, it functions brilliantly as a sequel to Persona 5 and keeps the player constantly engaged in the story and gameplay. Definitely play this game if you enjoyed Persona 5 and don't mind the Warriors-style gameplay.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2390176493, "author": "7856fa22-f19a-38c8-b2b4-50f051ff21a7", "date": "2021-11-24", "hours": 29, "content": "futaba is hot", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2546431439, "author": "895e445a-f8a2-333d-93aa-037e30364944", "date": "2021-11-24", "hours": 48, "content": "Play the vanilla first before you play this 1.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3156648869, "author": "75d63726-daec-3f77-a509-22ee4738b783", "date": "2021-11-24", "hours": 69, "content": "banger music, and great continuation to the main game, Persona 5 Royal.\n\nthey forgot to add izanagi no okami picaro tho shame", "comments": 0, "source": "steam", "helpful": 13, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3176596048, "author": "42062b87-dfcc-39ca-838b-c5db7d3d19f7", "date": "2021-11-24", "hours": 82, "content": "Great! Just don't platinum it, the achievements are brutal.", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3262362581, "author": "b1d3f4b4-bafc-349c-86f1-76a449f0fb80", "date": "2021-11-24", "hours": 56, "content": "Really impressed how a simple Warriors spinoff managed to not only capture the feel of the main game amazingly but also saving all the one-note/underdeveloped Thieves and introducing fantastic new cast members that we will sadly probably never see in any other spinoff. Cut the dungeon count a *little*, iron out some weird quirks, and balance the dungeon lengths/combat difficulty and we basically have a spinoff worthy of the main game", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3385350241, "author": "6c0d2655-0500-3543-92ba-c4afe53bbd74", "date": "2021-11-24", "hours": 85, "content": "- Mom can get we get Persona 5 Royal on Steam?\n- We already have Persona 5 Royal on Steam.\n\nPersona 5 Royal on Steam:\n\nhttps://store.steampowered.com/app/1382330/Persona_5_Strikers/", "comments": 0, "source": "steam", "helpful": 72, "funny": 119, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 41800982, "author": "8f1d9b90-cfc0-3552-b408-1c15410695e4", "date": "2021-11-25", "hours": 3, "content": "Its Persona. wow", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 88783778, "author": "6d39b0b7-2acf-3981-b2da-73be86849baa", "date": "2021-11-25", "hours": 31, "content": "contributing my positive review in hopes of a P5R port", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 504584667, "author": "12826a33-1634-3f06-8633-b990367db889", "date": "2021-11-25", "hours": 66, "content": "yeah it's more persona what more do you want", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 557434220, "author": "e6a1cf61-8c0a-3dee-a217-6b0f0855415a", "date": "2021-11-25", "hours": 1, "content": "Nice visual style, best sound, Ann Takamaki.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 564634332, "author": "ca661634-eb20-3c94-8af0-f752e1cc8cb4", "date": "2021-11-25", "hours": 66, "content": "First things first this game is not a sequel to be taken lightly and is far from shallow or \"easy going\" compared to the original game as claimed by some reviewers. The rest of the Persona spin-off titles pale in comparison to this masterpiece truly worthy of the Persona title. I wouldn't even call this a spin-off but this is a true sequel in my books.\n\nThe games \"social\" system might not be as deep as in the original game but for what it's worth it does its job well letting you do optional quests for your companions and encounter in optional dialouge during your spare time and you'll be constantly interacting with you companions throughout the story.\n\nIf you have played the original Persona 5 Game this is a must play. A true masterpiece with a deep plot and good mechanics\n\noverview:\n+ Deep and well crafted engaging plot that is simply outstanding\n+ Combat is very fun and at times very engaging\n+ Persona Creation and modification feature is well crafted and goes as deep as you're willing to go\n+ Atmosphere and environments are outstanding\n+ soundtrack is excellent\n+ Character encounters throughout the game are enchanting and deep", "comments": 0, "source": "steam", "helpful": 32, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 568778929, "author": "84f7ead0-d58c-386a-b25c-64d225da5b5f", "date": "2021-11-25", "hours": 175, "content": "Great game, maybe not as good as the original Persona 5, or Royale, but is pretty fun to play overall.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 584274850, "author": "bee44713-0dd5-3b1a-9808-66e8f7cc239e", "date": "2021-11-25", "hours": 85, "content": "Incredibly fun, went past expectations.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 845635640, "author": "c7625bb6-545c-30f3-8b64-e34c59ce8d4a", "date": "2021-11-25", "hours": 4, "content": "You can play as a silly \"cat\"", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 899515828, "author": "5ebaa9ed-d293-3259-9abc-3919d4e8e324", "date": "2021-11-25", "hours": 24, "content": "persona but they strike", "comments": 0, "source": "steam", "helpful": 3, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1494185994, "author": "d1b4b8ef-4f51-3c22-b0ff-9b7baa3c0e19", "date": "2021-11-25", "hours": 49, "content": "I was expecting it to be great but I didn't know that it would be this great. The music, the new gameplay and all the fanservice (Morgana and Ryuji getting along alot more for example) makes this game amazing. I genuinely love it and it honestly felt like  a sequel rather than just a spin-off.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1769392538, "author": "753fe41d-b635-3ff9-8393-f05295c06c5d", "date": "2021-11-25", "hours": 68, "content": "Like other Persona spin offs it has a lot of personality. It even has a couple unique moments that depend on playing Persona 4 and 5. Worth playing if you're a fan of the series and it's an improved Dynasty Warriors combat system lite-RPG for everyone else. Solid.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1807813850, "author": "0d332b8f-ff4a-3e34-be2c-f80f635e4bc3", "date": "2021-11-25", "hours": 5, "content": "Akira kurusu is hot", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1831871762, "author": "5c41d8e7-741f-3319-990b-ce1c2fb0b75f", "date": "2021-11-25", "hours": 86, "content": "Yes. Just get it", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2401419406, "author": "88f98120-1ce8-3499-85f9-62b45dc457e0", "date": "2021-11-25", "hours": 79, "content": "P5S is a fun follow-up to P5/P5R in the form of a 3D beat-em-up. Giant waves of enemies come at you and there's occasionally a boss who does big damage yet can be stunned for your own big damage if you hit it's weakness enough. Sounds like Persona/SMT gameplay in an action environment? You'd be correct.\n\nThere's balance issues with characters strengths and weaknesses but it never forces you into a unwinnable situation; plus the balance between Persona elements and beat-em-up elements was more important and they succeeded there. You have to keep an eye on your skills mostly for stronger enemies and to improve combos but if you're exceedingly talented at these kinds of games you could ignore it...but the system is fun so there's no reason to. The story is a bit shallow with our returning cast while the new faces (at least the good guys) get character development that's pretty logical and nice, but it probably won't leave the biggest impression on you. It's moreso a reason to see Ren, Ryuji, Yusuke, Makoto, Futaba etc. again and get what would be confidant cut-scenes in P5 but stretched through the whole game. The game is  gorgeous and despite it being frantic I would stop after clearing an area to look around. I was worried when the characters looked a little off when it was revealed but they look fine in-game alongside the demons and levels you'll explore.\n\nIt's a fun sequel that doesn't push the envelope outside of introducing RPG menus and abilities to Samurai Warriors like gameplay. If you like Persona 5 it's a great. simple and significantly shorter. It allows extra time with the Phantom Thieves too, especially Haru! and don't worry - one thief won't take up a ton of the main plot this time. Makoto, I'm staring lazers at you. Gameplay design also feels similar despite the new combat style as managing your abilities before heading into a jail is where the real challenge comes in and then using those abilities sparingly. It's fun and enjoyable, do consider getting it!\n\nIf you don't like P5...you'll think it's pretty I guess. It's another warriors game with the ability to do an attack from a menu that does more damage. I do think unless you are *really* into the game's art style, you could do better with other games on Steam.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2810898750, "author": "ed334405-efaa-3191-bfbc-b3237540c083", "date": "2021-11-25", "hours": 90, "content": "Great addition to the adventures of the Phantom Thieves! Gameplay is not too in-depth with other characters, I would have liked some customization with how the other Phantom Thieves play, but other than that it is a whole lot of fun. The story is very Persona and the new character was great. If you liked musou-type games then you will definitely enjoy this!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3229732582, "author": "83b31df7-0659-35bb-8459-84ad9bd9cbcd", "date": "2021-11-25", "hours": 40, "content": "Is good game, has good music. Very good.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3315858824, "author": "7eecf5a5-0a31-3d1d-92c3-23f8000ce3ca", "date": "2021-11-25", "hours": 24, "content": "love the first persona 5, beat royal and i beat this game on the switch. i love this game and will never stop playing it. the soundtrack is always on beat. if you have not had a chance to go with the phantom thiefs now is your chance.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3392706549, "author": "1fe81d8c-b0a3-3662-b8c3-3a5587b037ac", "date": "2021-11-25", "hours": 98, "content": "Review (or update your review) for a game you've nominated", "comments": 0, "source": "steam", "helpful": 22, "funny": 14, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3872627613, "author": "70a562f3-3455-38cc-97b9-dc09f97215b9", "date": "2021-11-25", "hours": 21, "content": "This game is a worthy sequal to Persona 5. \nPlay it ya weebs!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4001148069, "author": "5dfc6119-fd78-3a59-9e29-172901695169", "date": "2021-11-25", "hours": 327, "content": "Life Will Change / Last Surprise / I Believe - Persona 5", "comments": 0, "source": "steam", "helpful": 45, "funny": 4, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4009701541, "author": "ef410469-b8f2-377a-8438-cade4dcf8f8f", "date": "2021-11-25", "hours": 59, "content": "whats a persona", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4105440093, "author": "c317fcac-2aba-35a8-9bb7-0d8dd73f04b7", "date": "2021-11-25", "hours": 4, "content": "Persona 5 is my favourite game I've never played. Due to me not having a playstation I never got to play Persona 5 or Persona 5 Royal. So Persona 5 Strikers coming to PC was hype from the get go. From what I've played thus far the game feels amazing.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 783320974, "author": "20bad470-6092-3da5-a122-76ed3d4c7ebb", "date": "2021-11-26", "hours": 104, "content": "I cried ;-;", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1645251687, "author": "3153d136-ea6c-3e82-a7ad-21ee69b43288", "date": "2021-11-26", "hours": 2, "content": "Dynasty Warriors, Persona 5 Edition", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2017684345, "author": "0e7d2c1e-17f3-34d9-b865-488d0da85b97", "date": "2021-11-26", "hours": 31, "content": "This game makes my brain do the happy chemicals", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2227953142, "author": "571150bb-c0f9-3966-b01f-e4e954972458", "date": "2021-11-26", "hours": 4, "content": "now if only we could get P5R on steam...", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2990225745, "author": "aa8f73d1-d1ec-30a7-b5c6-c48c9a03b1da", "date": "2021-11-26", "hours": 4, "content": "you can skateboard with joker and thats always good", "comments": 0, "source": "steam", "helpful": 23, "funny": 6, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3771009835, "author": "25f87388-e8dd-36ca-b61e-5d6a93bcc373", "date": "2021-11-26", "hours": 17, "content": "ez badge :)", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3881911219, "author": "8b9c357f-de77-3c34-a0af-5c86cc2599a8", "date": "2021-11-26", "hours": 15, "content": "If you're a Persona fan this is a quick + lil story related fun game. Of course people who are new to the series can also give it a try, fun enjoyable game in general :) sick ost btw", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4113940192, "author": "9a760d7b-7f2c-36f3-933f-85adf52f733b", "date": "2021-11-26", "hours": 123, "content": "An amazing 'sequel' to an already outstanding game.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4155984633, "author": "eb263dbe-bd15-3e48-bec7-0585bedffbeb", "date": "2021-11-26", "hours": 13, "content": "it's ok.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 7069904, "author": "07f00389-6de3-3dbb-851d-17e73aab85d9", "date": "2021-11-27", "hours": 79, "content": "This was a fantastic game. The turn based game play was translated beautifully into this action adventure style. The stories and characters where as fun as ever and it feels like they never left. Picks up right where the last game left off. Highly recommend.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 120693003, "author": "5758edfb-0d3a-372f-96c8-8381b5207445", "date": "2021-11-27", "hours": 5, "content": "It's joker from smash", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1906433341, "author": "a7c2a2b5-6d9c-3b03-ae1e-34309647feac", "date": "2021-11-27", "hours": 54, "content": "With good storytelling like Persona 5, enjoyable gameplay, outstanding music. If you like any of the previous ones, you can give it a try, even if the gameplay is different, it is enjoyable all the same! \n\nAnd it holds up until the ending credits.\nNow give me Persona 5 Royale, I beg of you.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2642211278, "author": "8607a000-b279-38c4-b8a4-aea1cc7a5337", "date": "2021-11-27", "hours": 35, "content": "Persona 5 Royal when?", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2650966846, "author": "cf3e9104-3f7c-3628-88d1-c58aedff51ac", "date": "2021-11-27", "hours": 7, "content": "This is giving me major Persona vibes\n\nIn all seriousness its a nice treat for fans of the series and runs really well. Now put P5/P5R itself on PC please.", "comments": 0, "source": "steam", "helpful": 2, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3041682694, "author": "98724989-4a26-3b98-b5ac-0dca9177881c", "date": "2021-11-27", "hours": 75, "content": "The soundtrack and the visuals are still a masterpiece.", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3126934274, "author": "b5e5153e-9aa6-32bd-9a22-876e8e3b5297", "date": "2021-11-27", "hours": 8, "content": "Combat is different but if you love persona and the way they tell a story, buy it", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3448948277, "author": "4be09665-6477-3a94-b921-b8607af039d6", "date": "2021-11-27", "hours": 17, "content": "You have to play Persona 5 first to understand the chemistry between the characters, but it's a fun game by itself", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3459178649, "author": "69490d3e-8c1b-3b46-8b13-7ffd11c54e4d", "date": "2021-11-27", "hours": 5, "content": "I've put well over 100 hours into this on PS4 and honestly, it was worth every second of it, for a Musou game I'd say this is a must play. Especially if you're a huge fan of the property this a spin-off of, being that of persona 5. The game plays beautifully and has some really great additions that separate it from other Musou games. Though if you were not a fan of Musou games to begin with I can't say in good faith that Strikers will change your mind of the genre. Though for anyone else who's looking for either a light-hearted and fun introduction to the phantom thieves that stole the worlds hearts back in 2019 or a fan wishing for more story content with this cast of misfits then I'd say this is a must buy, for those who aren't super into Musou games or aren't in a dire rush to play strikers I'd personally advise you wait until the game drops enough in price for you to feel comfortable paying for the game", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3814307273, "author": "40af7246-a6b3-3430-8c6b-f9e46bcb4197", "date": "2021-11-27", "hours": 25, "content": "joker", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1409593186, "author": "47984f8a-b671-3207-a746-abf5c4a97323", "date": "2021-11-28", "hours": 46, "content": "Very good game, although the grind to get every achievement is painful. Be ready to grind the same endgame enemy over and over again.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1792096512, "author": "c0bbbd2d-d9eb-34d1-828d-2da6f6bf3bac", "date": "2021-11-28", "hours": 32, "content": "Ann is best grill. Also gud game.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2761916067, "author": "847a5326-4712-3c6a-aa7f-16764c5b502f", "date": "2021-11-28", "hours": 6, "content": "PERRRRRRRRRRRRRRRRRRSOOOOOOOOOOOOOOOOOOOOOOOOONAAAAAAAAAAAAAAAAAAAA", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2936846085, "author": "795ff077-d90d-32df-a1cc-8b42ae017716", "date": "2021-11-28", "hours": 47, "content": "slashin\n\nvery good", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3213587568, "author": "ddd142db-27fe-3947-b394-87dfd24bafe6", "date": "2021-11-28", "hours": 353, "content": "This game is outstanding. The visuals and audio is exactly what you can expect from a Persona 5 continuation, and the story is an interesting continuation of the original storyline.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1227167458, "author": "82a02259-b181-33ac-882b-01a2fd43f045", "date": "2021-11-29", "hours": 13, "content": "very enjoy the gameplay , music ,story,", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2161001369, "author": "72628d21-1902-373d-9128-d377bda207f3", "date": "2021-11-29", "hours": 63, "content": "Music 10/10 Visuals 10/10 Battle 10/10 runs very good on PC, the only problem imo is just the keyboard controls, it's horrible\nwhere's P5/P5R tho? And don't be shy release SMT V on PC too", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3968440115, "author": "cd4bcf92-82ea-35dc-b7a1-771512e230d8", "date": "2021-11-29", "hours": 46, "content": "hee ho", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2612649774, "author": "c60b00c0-3eeb-3341-b0d4-be1ac540dfc6", "date": "2021-11-30", "hours": 42, "content": "play persona 5 on PS or emulate it before you play this", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3406963910, "author": "51cd2b1e-7fc6-3639-89ed-925d45af30b0", "date": "2021-11-30", "hours": 9, "content": "Not Persona 5 Royal, when is that coming to Steam?", "comments": 0, "source": "steam", "helpful": 75, "funny": 10, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4198243892, "author": "088fe503-b5f6-3739-9c85-2dcb48ec5f8a", "date": "2021-11-30", "hours": 86, "content": "its fun and stuff you should play it", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4250229600, "author": "b833f65c-6f05-3511-a48f-44d99b09e253", "date": "2021-11-30", "hours": 13, "content": "Nice", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 79191443, "author": "ec24dbcc-d3d2-31ff-817a-4ca925677377", "date": "2021-12-01", "hours": 42, "content": "HEE-HO time.", "comments": 0, "source": "steam", "helpful": 24, "funny": 8, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 752760847, "author": "5d25960e-dcca-385c-8cbb-3bacc72eb5fd", "date": "2021-12-01", "hours": 77, "content": "Was this game necessary? No. Was taking a Japanese roadtrip with Joker & friends fun? Yes.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1118153083, "author": "403ca71b-e45c-3665-8b42-6ff601fbe625", "date": "2021-12-01", "hours": 41, "content": "Persona 5 strikers carries over the definitive style of its source game into a musou package including the great soundtrack and style. Any fan of the original should see this game through.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2464041927, "author": "c52ecdc0-5951-3a91-8e27-b560a3ed0b80", "date": "2021-12-01", "hours": 31, "content": "Dynasty warrior X Persona. 10/10.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2488814226, "author": "9649b058-ca1e-3669-ad69-f78a77c1249b", "date": "2021-12-01", "hours": 44, "content": "poopsona 5 scrambled", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3821515479, "author": "cdd0e9fd-d0ea-3d29-9565-53bc691d2085", "date": "2021-12-01", "hours": 0, "content": "Un buen juegazo.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3822899482, "author": "7fbeb08e-53a1-3174-ae83-fd3419754870", "date": "2021-12-01", "hours": 75, "content": "Persona 5 Strikers is an excellent spin-off of Persona 5 and an overall fantastic Musou game. Based on vanilla P5, it leaves out  the new stories from Royal. It's unfortunate, but the new ideas they bring are really great, one of the new characters is really compelling and an excellent addition to the cast. It's definitely a game I'd recommend to anyone who enjoyed Persona 5. It's a fun continuation with a good story and the Phantom Thieves hanging out and travelling across Japan. This might seem obvious, but if you weren't a fan of P5 then this game won't do much for you. Long stretches of cutscenes and characters the game expects you to be familiar with won't be too appealing if you haven't been sucked into the world of P5. Only other major complaint is the post-game, or lack thereof. It's disappointing, especially for a Musou game that can usually have you spend over 100 hours trying to complete the various missions. \n\nOverall though, like I said, Persona 5 Strikers is an excellent game and one that any fan of Persona 5 should play.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3295826364, "author": "8f9c5ce9-125a-3d2e-bdb6-f105d33c3da6", "date": "2021-12-03", "hours": 55, "content": "Sadly I forced myself to beat this game as the Persona fan I am. The antagonists are really lame and don't really give you a drive to keep playing and along with your party members they feel like an after thought when side quests you do for them don't really make any social link event happen. Combat will also get too repetitive because it just becomes X and Y through the entire game with occasional oh maybe I will actually manually use my Persona's skills. All I can say is get it on sale", "comments": 0, "source": "steam", "helpful": 116, "funny": 14, "recommended": false, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 522204229, "author": "c36c421a-985f-3efe-9bc5-19d3c7a0ce9a", "date": "2021-12-04", "hours": 27, "content": "Art, gameplay and music on point as any other Persona game! Ryuji keeps me playing", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4258095993, "author": "de4888ea-7ada-3104-a129-ea1ea836e03d", "date": "2021-12-04", "hours": 25, "content": "BRING ROYAL TO PC", "comments": 0, "source": "steam", "helpful": 58, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 892442571, "author": "7378f663-6e5c-3bcc-ac12-5c15738c8875", "date": "2021-12-07", "hours": 29, "content": "GREAT GAME", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 174530463, "author": "fe6c03ba-3d84-38e1-b2da-5033ccd7b440", "date": "2021-12-09", "hours": 64, "content": "Persona 5 My Beloved", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2976250178, "author": "e1da27a9-173a-36fb-a16f-40ec2a5f0a22", "date": "2021-12-09", "hours": 0, "content": "Bought this game just so i could write a strongly worded review with the following:\n\nAtlus please bring Persona 5 Royal to steam, i love you C:", "comments": 0, "source": "steam", "helpful": 271, "funny": 15, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3882579743, "author": "a606bc70-decc-3c55-9a27-2b97da1437d2", "date": "2021-12-09", "hours": 45, "content": "i like it", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 19955543, "author": "5ed9f2d8-5db5-3a7d-9e8c-3f8dce598804", "date": "2021-12-11", "hours": 13, "content": "Deez nuts", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1225866391, "author": "a7b279ed-60a8-33ea-8c9e-65ddb57da51c", "date": "2021-12-11", "hours": 50, "content": "bonafied monafied", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 544376646, "author": "14de50a7-5ca0-3ce5-bf9d-e982ab93a8c0", "date": "2021-12-12", "hours": 67, "content": "This game really is a sequel to the Vanilla P5, with two great new characters, development for the ones that need it (Specially Psycho-Fluff girl Haru). and a great OST that replicates the style of the original.\n\nAlthough considered a warriors game; it really translates the SMT/Persona mechanics, making the game feel more distinct than just another button masher.\n\nPlaying this on hard is the best experience because you can have the fun of ravaging through hordes of enemies while also keeping check of every stat, weakness and strength so that you don't get your ass handed to you instantly by a strong or even \"weak\" enemies (If you know, you know)\n\nBest of both worlds; Stfu about P5R on PC pls.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1826726177, "author": "ac66e948-6299-3af7-b521-6c6d63cdc812", "date": "2021-12-12", "hours": 55, "content": "A lot of fun. It's hard to play a non action-RPG after this game. They got the formula right. I have no intention of replaying it anytime soon, but the journey was fun enough.\n\nThe character designs are weird though. Like overtly sexual. Oh well.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2973084281, "author": "79c654df-755d-3bbe-a8e0-4d323e94d8dd", "date": "2021-12-12", "hours": 37, "content": "Game fun \nit may not be P5R but its still pretty good imo", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3054236886, "author": "27bbcf63-5add-3225-910a-40ba8087a35d", "date": "2021-12-13", "hours": 43, "content": "I loved Persona 5 and I love this one. Don't bother playing Strikers if you didn't finish P5 / P5 Royal.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1514602547, "author": "4bd537e2-5f0d-3761-aa67-70ecb5e8702b", "date": "2021-12-15", "hours": 148, "content": "I beated it", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 967443059, "author": "db0b3489-29df-3277-9ae2-0e1be7eaf3f2", "date": "2021-12-18", "hours": 4, "content": "good", "comments": 1, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1488535488, "author": "2ef3c7f1-c48e-3b10-9da3-64ea233a5274", "date": "2021-12-18", "hours": 58, "content": "This is definitely for fans of Persona 5. The Musou style combat takes a lot of getting used to, weather or not you're accustomed to Dynasty Warriors or not, it's pretty different, and I had to change the difficulty to Easy until I got the hang of things and then reset it to Normal. \n\nIt has some clunkiness, but the story will keep you going if you liked P5. This is a direct sequel, so definitely play this for the story if nothing else.\n\nBeing an action game, you control each Phantom Thief individually, and can freely switch between them. they all fight quite differently and have their own combos/specials, and you'll most likely find one or two that you like and stick with them for most of the game.\n\nYou still obtain Personas and Joker can equip/fuse them etc in the Velvet room. But with so many characters to play as (8 other than Joker) I barely found any use in directly controlling Joker. Why use a fire based Persona when Ann can already use fire spells and use her fire whip moves that cost no SP? And same with each other Phantom Thief with their respective elemental spells. It made sense in a turn-based RPG like the original  P5, but here you can just hack/slash/spell cast to your hearts content.\n\nAll in all a fun, mindless game that honestly needs tweaking in the combat department, but I'd still recommend this to fans of P5 for the story, and to see these beloved characters return in a new setting.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2542672722, "author": "cf3f68da-0dfb-3aa2-914e-847e638cdb05", "date": "2021-12-19", "hours": 24, "content": "if u play this and or like the series u my friend are gay\n", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1365501263, "author": "e3d69511-9813-3af6-87a5-cac142632d35", "date": "2021-12-20", "hours": 37, "content": "Best sequel to any game, magnificent masterpiece with banger soundtrack that you would come back to the only thing people would dislike is the skill level but a long time Persona fan would be comfortable beating it.\n\nReview from the guy could 100% game with all personas", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1481133787, "author": "a9a87a58-a181-37d8-a1ec-842b82fcf2b8", "date": "2021-12-20", "hours": 75, "content": "very nice and fun game", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3538163690, "author": "a31d6534-d4f6-3358-bf96-7f940634adc7", "date": "2021-12-20", "hours": 79, "content": "If you are expecting a classic style Persona game do not. If you want a fun continuation of the P5 story (Not Royal), with a fun hack n' slash mob fighting gameplay, then I recommend this game. if you are a fan of the series I recommend it as well. It is as fun spin-off that mixes in combo fighting and the classic style of summoning your Persona by selecting spells/attacks. The plot is simple but enjoyable, and the two new characters they introduce are well written and cool. \nCombat is super fast pace, and if you are not careful or watchful, you can get knocked out super fast.\n\nA bonus is that if Joker is knocked out, the game does not end, only tpk ends the game instead. \n\nIt is super enjoyable pulling off a finishing move from an all out attack or showtime. \n\nNew gameplay stuff such as Cooking is super handy, and the ability to only move the story forward by completing main quests means you can grind in a dungeon (Jails) without time moving forward. Time only moves forward after you complete certain quests in the Jails. \n\nWhen you enter then exit a Jail, most of the store items also reset, so its super easy to restock supplies. \n\nI also bought the DLC, and its super fun listening to the previous Persona battle musics while fighting with the P5 gang. \n\nThe game runs rather smooth, and has only crashed twice, and that was before they added in any patches. Since then I have not had any issues. I still recommend saving often. \n\nSome fun notes on general story stuff. Similar to P5R, when you walk around the city buying supplies, you also see your party members hanging out together, which is a nice touch. Plus you get to explore several parts of Japan, which is pretty sweet, and they do a rather decent job recreating famous sites in the cities you visit. \n\nI would honestly say I recommend this game, is it worth the full price? Maybe not, 100% on a sale. I preorded it and was able to snag it for around $45. \n\nNote, this is a shorter by persona series standards. The gameplay is around 60ish hours from what I hear. I have not beaten it yet, but I am nearing 44 hours. \n\nI would say one of my favorite things is that when you move and explore Jails, you can do so as any of the people in your 4-person party. I am happy they did not limit you to just being Joker, and you can be any of the characters while exploring and fighting. Sometimes I'll just play as Queen or Inari during an entire dungeon crawl, or switch it up between characters on the dime. Its a lot of fun. \n\nI would say the Jails are like a water downed version of Dark Souls/Bloodborne  dungeons with a focus on stealth and surprise attacks. Slightly a maze with puzzles, but way more simple and guided than Soulsborne games. \n\n\nOut of 10, I'd give this game an 8.5/10 so far. Once I complete it, it could even be a 9 or 9.5 for me. I am a huge fan of the Persona series. Note, if you have no idea what persona is, you could play this game and not be too lost. It would spoil most of P5. This is more or less a fan game for fans.", "comments": 0, "source": "steam", "helpful": 50, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3767256666, "author": "63e049ef-fca0-3e70-8f3b-993a3ab90eb3", "date": "2021-12-20", "hours": 41, "content": "This game is amazing from start to finish. As most persona games go, the music is awesome, the mechanics are tight (even for this hack and slash spinoff!), and the story is enticing from beginning to end. This one is absolutely a must play for everyone who has played Persona 5 previously. If you're new to the series, Persona 4 Golden is on steam as well!", "comments": 0, "source": "steam", "helpful": 5, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2848742880, "author": "3e64e09a-cddc-39d3-82ab-36e2614930e3", "date": "2021-12-21", "hours": 2, "content": "bad port\ngood game i guess", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2961692487, "author": "0201a1f3-5084-3d98-bcb7-c011b4aa4ed2", "date": "2021-12-21", "hours": 33, "content": "takemi mommy milkers", "comments": 3, "source": "steam", "helpful": 142, "funny": 29, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2442556614, "author": "a4504ec4-2de2-3ca7-8c12-9129e960fd71", "date": "2021-12-23", "hours": 78, "content": "If you've played the original Persona 5 or Persona 5 Royal, this game is pretty excellent going in blind; if you don't mind the warriors style of combat that is (which in my opinion is pretty damn good here). Absolute banger soundtrack as usual with slick stylised visuals and surprisingly interesting stories and characters. I've played a couple warriors games (FE: Warriors and Hyrule Warriors) and this is definitely my favourite in terms of gameplay, it feels a lot faster yet fairer than the previous two I've played, and the elemental mechanic is really well implemented in this type of game IMO. But yeah, it being a sequel to a game that isn't on PC doesn't help, but if you've played P5 then there's no real reason to not play this.", "comments": 0, "source": "steam", "helpful": 27, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1141006546, "author": "6117274c-d357-3fab-a372-fd05f9843b27", "date": "2021-12-24", "hours": 70, "content": "The gameplay is a little bit deeper than your average warriors/musou game due to the personas and their skills, the story isn't anything special but is enjoyable if you liked Persona 5. As well as seeing the cast returning from persona 5 is a lot of fun if you liked persona 5.\nI probably wouldn't recommend this game if you haven't played persona 5 or at least watched someone play it.\n", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 378812532, "author": "fcd0d740-e049-3144-b157-6d274738bfe2", "date": "2021-12-25", "hours": 38, "content": "nice game \nwatched anime of p5 and just had to play the spin off\n", "comments": 1, "source": "steam", "helpful": 2, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 986052203, "author": "4f2e2d58-bf2e-3bd1-9b22-15fc45eb5411", "date": "2021-12-25", "hours": 49, "content": "lol", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3059651481, "author": "7fb25062-fa1d-3399-8018-807b8cca9a82", "date": "2021-12-25", "hours": 9, "content": "Just a bunch of teenagers terrorizing the streets", "comments": 0, "source": "steam", "helpful": 2, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3610128124, "author": "88d14e1d-6c16-3697-9cf9-20683030a8bf", "date": "2021-12-25", "hours": 6, "content": "Persona 5 drinking game: take a shot whenever Ryuji says \"For real!?\"", "comments": 0, "source": "steam", "helpful": 79, "funny": 60, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3757568661, "author": "a805f4aa-69e1-3f13-98a6-9c759e8ce6bf", "date": "2021-12-25", "hours": 92, "content": "Zenkichi and sophie are a really good addition to the group. I feel like merciless new game + is the actual way to play the game. Once you prepare all stats 99 and a few regen items, new game + merciless feels rewarding and punishing at the right moment. It felt like playing Persona 5. You no longer think that maybe you're under leveled or the fight feels it takes too long. It feels just right and dodges feels great. *Also auto dodges are the shit. Makes everything easy. Just a few more till I get 100% achievement*", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4248972203, "author": "ff0b6aa8-3e3b-3ccb-8bac-063cf5c53ddd", "date": "2021-12-25", "hours": 10, "content": "Hee Ho~", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 772978248, "author": "e0ff863e-2313-34fe-96fd-a14464dbbdf0", "date": "2021-12-26", "hours": 58, "content": "Really fun game. Actually starts hard and then gets easier. Could have used some more new music, as it just re-uses a lot of the P5 music tracks. Also, no Kasumi :(", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2838568911, "author": "f8fea0f9-fdc4-301e-8bec-74f9e9e60c44", "date": "2021-12-26", "hours": 70, "content": "An excellent balance between classic Persona gameplay, and hack-and-slash madness.\n\nI'll won't deny in saying that I never actually played the original Persona 5/Royal, having only watched my friend stream the game. But I can still say with certainty that the flair, writing, and characters feel straight out of the main game. While this may be labeled as a \"Spinoff\", it is just as much a true sequel to the original Persona 5. (Not Royal.)\n\nDespite being seen as a \"Warriors\" spinoff of sorts like other series received (Such as Hyrule Warriors or Fire Emblem Warriors), Strikers keeps many of the aspects that make the Warriors games have their flair and charm, while also keeping many story and gameplay aspects that make it feel like a true Persona game as well. The use of skills, weakness exploitation, and even Joker's Wild Card ability are all present, and translated faithfully in the newer hack-and-slash gameplay style. While at the same time still feeling like a dedicated RPG. I'm honestly impressed how well they kept the feel of Persona in the gameplay, not making it feel too alienated as a sequel to P5. (Unlike with my experience with games like Hyrule Warriors, which feels like a Warriors game, but with Zelda characters slapped onto it.) Even so; the gameplay is still very different from regular Persona. It just is faithful in carrying over a lot of signature aspects of the series.\n\nAnd as for the story; I really enjoyed it as well. I won't go into many details, but I can still say for certain that it feels like a natural progression from the ending of Persona 5.\nThe characters all feel the same, they all keep their original voices, and some characters who may have been lacking in P5 got more development and purpose in Strikers. (Primarily with Haru.)\nEven though there are no longer any social aspects in Strikers, the writing and character interactions still feel like what you'd see in regular Persona, albeit a bit more linear. Which honestly; I don't have a problem with.\nI also really enjoyed the new characters added to the game, especially Zenkichi.\n\nAll-in-all, P5 Strikers is a fantastic game, especially if you're a fan of P5 already.\nMy only gripe is that due to being a sequel to P5, you kinda need to see the story of the base game's True Ending to understand a lot of points covered in the story of Strikers. But at the same time; if your there just for the gameplay and not so much the story (Or you just don't mind spoilers), then the game itself has its own content and story to look forward to. Even if you may not pick up on all the references made to the previous game.\n\nEven still; I highly recommend this game. Truly a real treat for me to play this year", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3148953885, "author": "2ad8f8b0-9343-37ba-aee9-dc5a026e247f", "date": "2021-12-26", "hours": 31, "content": "A great sequel of the original Persona 5. Instead of a turn-based JRPG, this game has hack and slash oriented gameplay with the same mechanics of the original game.\nIf you loved the original, you'll love this game.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4106578237, "author": "c698536c-af67-3215-a2a6-00829189e817", "date": "2021-12-26", "hours": 30, "content": "Fantastic game and sequel to Persona 5's story. I wouldn't play it before beating Persona 5 Royal, because parts of character dialogue spoil P5. OST is good and has some original and remixed songs from P5", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1140246124, "author": "69c7d472-c911-3736-9c42-f0f5d463239f", "date": "2021-12-27", "hours": 21, "content": "i mean its persona why wouldnt it be good", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2367383022, "author": "caf7102c-c977-31a1-973e-5f3173ea5b87", "date": "2021-12-29", "hours": 59, "content": "fun, easy to play, really is fun with all the diffrent modes and quests.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2720275921, "author": "04304f2c-8250-3c09-a0c0-9b92878ab479", "date": "2021-12-30", "hours": 7, "content": "I'd rather have Royal on PC then Strikers like it doesn't make any sense why give us a Persona spin-off but not the original game.\n\nstory: 5/10 kinda dry and mid\nart: 10/10 \ncharacters: 8/10 \n\noverall\n7/10 not a bad game to get if you played the original or royal\nkinda wish they gave us Royal or even just classic Persona 5 but y'know ATLUS being ATLUS.\n\n", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3531297978, "author": "ccaa9c19-a955-3bf9-a170-9ac8e4c08a77", "date": "2021-12-30", "hours": 104, "content": "Amazing continuation of an already brilliant story!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3824956642, "author": "05a9b4c9-da42-3c26-a2b0-9598cb32efc4", "date": "2021-12-30", "hours": 50, "content": "I'm gay but hear me out on Haru...", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 386674603, "author": "7b231804-b1be-3abd-9186-5744bb7ce73f", "date": "2021-12-31", "hours": 38, "content": "Yusuke Kitagawa\n", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 569316778, "author": "27e8aef5-10d9-3997-ae7a-bbcdb1eb8c01", "date": "2021-12-31", "hours": 60, "content": "When I play as joker I feel like a fugitive on the run. No one can stop me. I'm a thief but ... also a phantom. I'm the phantom Thief!", "comments": 0, "source": "steam", "helpful": 17, "funny": 5, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3567293945, "author": "b1a4969c-a2d2-3a01-b3b0-ae3e9eaab913", "date": "2021-12-31", "hours": 10, "content": "BRING PS5 ROYAL TO PC", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 633405551, "author": "2fecfcec-4bf4-348d-b864-c9d05051c9cd", "date": "2022-01-03", "hours": 214, "content": "where persona 5 royal wait WHERES KAWAKAMI? HUH WHERES TAKEMI???? AND SAE TOO JUST A PHONE CALL AND 1 SCENE?", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 730555618, "author": "ca1b262a-0bac-3f04-a6fe-1185e0afcb03", "date": "2022-01-03", "hours": 58, "content": "sophia's big speech made me tear up tbh", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3035007334, "author": "78908b3f-4240-39f8-90bc-540fe6a26f76", "date": "2022-01-03", "hours": 41, "content": "So... I want to preface this by saying I finished Persona 5 Royal before beginning this game. That game took me well over 100 hours, and was my first ever JRPG; it is my favorite game of all time. I was worried coming into Strikers (or Scramble) as Muso games are usually not as good as their source. I enjoyed Hyrule warrirors though, and any excuse to spend some more time with the Phantom Thieves is fine by me. I absolutely adore this game, and am so glad they took the route they did. The game is a muso-style game, yes, but it also incorporates the personas from Royal, their skills, and even fusions. The story is top-notch, and this game is in every sense of the word a sequel to Persona 5. However, although this game is great, I do not think it can be enjoyed fully without having played Persona 5/ Royal. If you have played that game though, this is a strong recommendation. I want to use the latter half of my review to speak to a fictional Atlus employee as if they were reading this... please please please port more games to the PC and even the switch. I purchased this game twice (once on here, one on switch) and have every Atlus released game not on playstation or 3DS (SMT V and Nocturne Remaster, Catherine Full body, Strikers, Persona 4 Golden, Persona 4 arena ultimax pre-order and I will be purchasing 13 Sentinels day one as well). I am sorry if I am coming across as a port-beggar, but I really do wish more people could enjoy Atlus's wonderful (and I mean absolutely fantastic) library of games. Their games are terrific, but I cannot justify purchasing a playstation or 3DS only to enjoy a select handful of games. I truthfully only would purchase TLOU, bloodborne and P5R if I had a playstation, but if you want to play more games than that then I would strongly suggest purchasing a playstation to experience their exclusives. I am going to end this tangent by saying this... this game is great. However, it is more enjoyable with a previous knowledge of the phantom theives, and their origin. Buy this game, and other Atlus ports as it shows Atlus their is an interest from the PC market, and I am so happy their games (mainly P4G) have sold well on this platform. Thank you for reading :)\n\nEdit: Just finished the main story... PLEASE ATLUS... bring more of your games to other consoles.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 930175205, "author": "cb7c806b-8dfb-3309-9449-d2d981bee832", "date": "2022-01-04", "hours": 40, "content": "It's not Persona 5, but if you loved that game, you will enjoy this adventure with a lot of the same characters, and some intriguing expeditions into the cognitive world. The battle system takes a bit of getting used to, and is much more frantic than the methodical turn-based system of P5, so it's worth reading a bit about that (avoiding spoilers) to make sure it won't get frustrating.", "comments": 0, "source": "steam", "helpful": 5, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1028756622, "author": "442c1169-e55e-3c67-8a24-c0d86853a6ae", "date": "2022-01-05", "hours": 35, "content": "Follow up to the vanilla P5. Action rpg and great graphics!", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3675734314, "author": "1c99fc62-787b-3c2a-94c3-233fa65ac3c5", "date": "2022-01-05", "hours": 54, "content": "continues the story from persona 5 \nadds more depth to Haru\nand amazing gameplay", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4105143990, "author": "bc02b493-a8f6-3864-b7e9-0a45b829be02", "date": "2022-01-05", "hours": 25, "content": "Its a persona game it will always be good.", "comments": 0, "source": "steam", "helpful": 42, "funny": 5, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1998464995, "author": "994785f8-046d-3ae2-92af-edf6dd05695f", "date": "2022-01-06", "hours": 29, "content": "Combat is Good and balanced, The Soundtrack SLAPS, And the story so far has been pretty good and kept me engaged. One of the first games of the year to make me want to NG+ and complete all the achievements.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3635341787, "author": "888443b6-0516-3ba7-af25-87492e1d9aa9", "date": "2022-01-06", "hours": 39, "content": "If Persona 5 (the original release) is a 9 out of 10 from my perspective, then this game is a 7. It has a REALLY boring section from the half way point till the last 75%. But the opening is good and the ending is strong. I can't compare/contrast this game's poochie in comparison to Royal's poochie, but for what it's worth I enjoyed seeing her story all the way through (especially considering I was shaky about her at first).\n\nDefinitely worth playing if you really enjoyed Persona 5.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4202345430, "author": "98be91fc-48aa-323e-93f5-64aa0f50170b", "date": "2022-01-06", "hours": 5, "content": "good game", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 588619723, "author": "85160bbc-3dd7-3a4c-8453-855773bebec6", "date": "2022-01-07", "hours": 52, "content": "Even though the fight system took some getting used to, it really ended up growing on me by mid-game, and loved it by late game. The story, world, music, and characters, all fully live up to the gold standard that P5 was, so if you loved P5, you'll love this story too.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2735157662, "author": "2ead37b6-dc1e-354c-8c52-dd9a62c6e752", "date": "2022-01-07", "hours": 41, "content": "What an absolutely fantastic game.\nCombat is great\nMusic is fantastic\nIt's a true sequel to Persona 5\nWhat more can I say?", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4273116362, "author": "f1608ace-b9df-3d41-8a3e-e11237d1eff9", "date": "2022-01-07", "hours": 46, "content": "Looking cool joker", "comments": 0, "source": "steam", "helpful": 82, "funny": 21, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 729780328, "author": "05305384-bdab-329e-925f-86a7a6685c7e", "date": "2022-01-10", "hours": 82, "content": "Might take a bit to get used to the combat, but its fluid as hell once you get used to it. Bond points and persona points are also a really cool system.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1173563098, "author": "1d37a060-2e70-342d-bcc3-89f74cc11951", "date": "2022-01-10", "hours": 38, "content": "peronpa", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3556764632, "author": "d8dad1f2-f5ed-3326-a09e-5a82f7bd2af1", "date": "2022-01-10", "hours": 61, "content": "Exceptional sequel to Persona 5", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2046773666, "author": "bdcf4bd2-93c2-3fa2-8552-57a85dd5a574", "date": "2022-01-14", "hours": 11, "content": "love", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2774389977, "author": "00cfe271-bdac-3076-8b3d-bde783499b05", "date": "2022-01-15", "hours": 71, "content": "I went into this game expecting an alright hack'n'slash with a Persona 5 skin, what I got was a really enjoyable hack'n'slash with a Persona spin on it and an enjoyable and at times, better than the original, follow-up to Persona 5. It felt like going on a vacation with old friends. The dads in these games are always the best characters, no cap. 9/10, Even though it's a Persona game and frankly this should be par for the course, it was surprisingly lengthy.\n\nedit 1: the game sometimes dropped frames near the end but it was nothing awful.\n\nedit 2: i wish i got the deluxe instead of standard as i would've loved to see the behind the scenes work put into this game, as well as have the phenomenal soundtrack which made at least made me have a lot of frission.", "comments": 2, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1750269158, "author": "193fec25-6d16-3750-b4ed-d8dc09abf49d", "date": "2022-01-16", "hours": 37, "content": "First off, you will have to have beaten Persona 5 do its ending to understand this game. And that is not a game for the faint of heart, it requires a significant time investment. But damn, is it worth it. And this game stands on its own as a fantastic sequel and spinoff. It is the first truly great Dynasty-Warriors type spinoff I've ever played. All the others have ranged from bad-mediocre. But this game stands on the shoulders of Persona 5 and has a fantastic combat system, story, music, and characters. Only complaints are that the plot takes a little while to get on its feet, some predictability in the plot, the lack of exp for members not in your party leaving them underleveled whenever you want to change your party setup, and the relative simplicity of the individual characters' movesets when compared to other games of this type. Otherwise, a fantastic game. Totally reccomend.", "comments": 1, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 307685633, "author": "10d052e5-c32b-353c-91b2-9f481e373afb", "date": "2022-01-17", "hours": 621, "content": "Loses points for zero mention of Akechi but im obsessed with the new characters LOL Zenkichi pls call me back", "comments": 0, "source": "steam", "helpful": 11, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 492977406, "author": "9e43df5d-8bf4-39ce-8ca0-ef3c7766bff6", "date": "2022-01-18", "hours": 71, "content": "Simply love the game.  Real time battle system, with Persona 5's style.  Incredibly fun with plenty of challenge. \n A great game, especially for those who played Persona 5.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1961832349, "author": "cb615d7c-0f01-3052-be6b-fb59e5ec7095", "date": "2022-01-18", "hours": 86, "content": "A fun, heartwarming roadtrip with all of your favorite characters: Ryuji, Ryuji, and Ryuji!\nA fitting sequel that meshes into the first installment smoothly, with a difference in gameplay style that the franchise has needed for quite some time. I hope they make more Strikers-style games in the future!\nGive me romance options. That is my only quarrel. Good game.", "comments": 0, "source": "steam", "helpful": 28, "funny": 6, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3528261159, "author": "f8c5c5a5-0bab-3bd6-b268-8bf34c11c2c5", "date": "2022-01-20", "hours": 60, "content": "Amazing game! desperately wanting persona 5 royal port to come to pc next!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3930919746, "author": "16d74760-95c9-3f79-a9cc-4863f83f709a", "date": "2022-01-21", "hours": 40, "content": "A great reunion with friends and an amazing end to a masterpiece.\n\nNow we just need Persona 5  Royal on Steam", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1676353726, "author": "bb3e03d7-0601-3423-98f3-8765625d9558", "date": "2022-01-22", "hours": 38, "content": "My only real complaint is how easy your SP gets drained and how you can't romance Takemi, other than that I like the combat system and the story in general. Would def recommend to those who finished Persona 5 Royal/Persona 5 Vanilla", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1875261648, "author": "66dd1d53-13e8-309c-9c4f-5c990783ba7b", "date": "2022-01-22", "hours": 52, "content": "Its been a blast playing this game from start to finish . Song is 10/10 . Story is really good . Cant wait for the next persona game in the future", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 531016910, "author": "32925f4e-a6a9-38e2-968c-7c41d193464f", "date": "2022-01-23", "hours": 9, "content": "Played Persona 5 on my brothers PS4, glad to see the sequel came to Steam. But Atlus needs to bring the original Persona 5 to Steam too.", "comments": 0, "source": "steam", "helpful": 280, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1743228316, "author": "7027f32d-440c-3ddb-b727-1ef2f147fdb0", "date": "2022-01-23", "hours": 17, "content": "Persona 5 strikers is a departure from the standard persona formula and let me tell ya it works. You would think that a rpg going to a fast paced action game would be pretty bad but hey its really feels good bashing an enemies skull into the curb.", "comments": 0, "source": "steam", "helpful": 4, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2715439046, "author": "1917c708-92da-3659-87d6-b610844ff48b", "date": "2022-01-23", "hours": 42, "content": "ryujee", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 742673984, "author": "c3f36eda-ed52-3c80-ad28-1cceac5085d7", "date": "2022-01-24", "hours": 79, "content": "the protagonist is actually me irl", "comments": 0, "source": "steam", "helpful": 3, "funny": 4, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3720103273, "author": "610e8e28-47c3-347d-9f22-3f6ae8af4b92", "date": "2022-01-24", "hours": 11, "content": "joker mmmm", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 264320300, "author": "f48164d1-c72b-37af-93bf-2d3375b7b0ae", "date": "2022-01-26", "hours": 85, "content": "HIghly recommended to play [b]if[/b] you have played Persona 5 (Royal) first. It's a direct sequel and there are so many jokes and references made that make it required to play that game first.\n\nThat aside, I absolutely love playing this game. I just finished the main story and am doing the post-game missions now to get to New Game+ for Merciless. \n\nI won't be covering the plot, but it's really good! I loved the story.\n\nI started the game on Hard difficulty and kept it there considering I'm used to other hack-and-slashes and it was difficult, but in a fun way. They made this fighting system unique by itself by weaving in (sometimes unique) persona skills into the combos. You can still manually select a skill for your persona to execute to hit weaknesses specifically or to debuff/buff etc. \n\nOne gripe I had was that the camera sometimes does a 180 when manually triggering your persona, to make sure you're facing the backside of the character, however with my playstyle I sometimes end up facing the side of my character while doing combos or I keep my camera more up to see the area better. So, when I open my persona skills the camera just speeds in the direction it's \"supposed\" to be, making me move the camera back manually because it actually points away from the enemy.\n\nI killed all the Dire Shadows (and have the achievement) without using NG+. Dire Shadows are like challenge shadows, they're more difficult and powerful than the story bosses. On hard it's actually still pretty fun to do with leveled characters and the correct personas. Planning is very important for these, but with the right tools and party it's absolutely doable in the first run. \n\nThe music also slaps. If you have the pre-order bonus I highly recommend setting the music to random and picking your favourites from older persona games and include all the p5/strikers songs too. \n\nIn a technical sense, the game performed really well overall. I played it at 3440x1440 with a 1080ti and R7 5800x and saw 60fps almost everywhere with dips to 40fps if something seemingly super intense happened. I was using all high settings, with anti-aliasing off and 2.0x rendering scale. I did use the Denuvo-less executable for 95% of my playthrough so YMMV.\n\nTo get the 21:9 aspect ratio to work properly you need both ReShade and a cheat engine table to get it to fill and unstretch the UI. Menus and all cutscenes are still 16:9 so you will see the world's skybox on the sides. The main menu and boot up logos are fixed 16:9 without a skybox so those get stretched, unless you use a reshade hotkey to unstretch.\n\nHowever with both the Denuvo and Denuvo-less executable, I had the game freeze after some time of playing, or after tabbing out for the first time. Tabbing out, focusing another program, until the game minimises by itself fixes it 100% of the time, so not sure what's going on. The only difference was that the denuvo-less executable didn't pin my cpu to 100% during this moment.", "comments": 6, "source": "steam", "helpful": 5, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 527272748, "author": "6d003d1d-5bbd-323a-97ba-79c6ef05c873", "date": "2022-01-26", "hours": 143, "content": "Good game, but it will be better if there's persona 5 royal in steam", "comments": 0, "source": "steam", "helpful": 66, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1184489056, "author": "3182495f-49a0-391f-bc87-5c240be62e0a", "date": "2022-01-27", "hours": 48, "content": "well its a persona game of course its good i haven't finished it but ill tell yall don't quit in the beginning it gets a bit repetitive at the start with consistently ambushing shadows but its really good i hope yall have a good time playing it", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1777887707, "author": "1d64b735-d267-38aa-ae0d-514de570918c", "date": "2022-01-27", "hours": 47, "content": "funni PERSONA!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2197573743, "author": "0dd0f680-26ae-3097-82e2-05cd31a2b64d", "date": "2022-01-27", "hours": 5, "content": "Play persona 5 first honestly.", "comments": 0, "source": "steam", "helpful": 73, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2079841729, "author": "277f4f7f-c89e-3528-976e-393cf9dd9095", "date": "2022-01-28", "hours": 71, "content": "Amazing Game but where is Persona 5 Royal for PC", "comments": 0, "source": "steam", "helpful": 159, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2716179406, "author": "ecd32c7f-0c2d-33e5-b26c-1109bfe33b0f", "date": "2022-01-28", "hours": 50, "content": "nothing more to say that this game is god tier\n\npls port persona 5 to pc people need persona 5 royal on steam\nthats all.", "comments": 0, "source": "steam", "helpful": 4, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1301371157, "author": "5368ee41-7bd7-3228-bb90-aac24d107a8c", "date": "2022-01-29", "hours": 420, "content": "How this game didn't win the Best Soundtrack Steam Award, I will never know.", "comments": 0, "source": "steam", "helpful": 50, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1877528621, "author": "f403c46c-1b00-3646-8d77-17e9e696ad20", "date": "2022-01-29", "hours": 57, "content": "The Gameplay (although kinda gets repetitive just pressing the same two buttons), soundtrack and characters are amazing and it's a huge improvement over the original Persona 5, but here's a couple of things that bother me as I'm still playing the game while I am writing/editing this (long??) review and i hope these could be taken notes for in the future to improve upon:\n\n1. (Issue that connects to the Modern Games)\nThe other battle songs being locked behind a DLC paywall (even though i paid for it so that the main songs wouldn't start getting on my nerves) which was the same issue i had with P5 when i played it years ago because of that.\n\n2. The Calendar doesn't do anything since there's no deadline making returning and that leads to the unecessary issue of  leaving and entering the Jails repetitive for some healing instead of giving the checkpoints some sort of healing station in the dungeons like in the older games since the calendar barely does anything like in 3-5.\n\n3. (Another big Issue that also connects to the Modern games)\nIt's been so many games and spin offs after P2: Eternal Punishment and there still isn't an option to make the Navi shut up, like Rise and Futaba because they're very annoying because their lines get repeated a lot and gets tiring especially Futaba with her very \"quirky and cool\" gaming references with her \"\"\"\"\"crippling social anxiety\"\"\"\" problem when the first Navi did her character better because she's quiet and chill (and that was over 13 years ago with Persona 3 in 2008 on the mf PS2) so i have to mute the Voices entirely during bosses and Normal Combat making the cutscenes afterwards awkward til i finally get to actually open up the menu after 10 million cutscenes bringing my next issue being..\n\n4. That i wish i wasn't bloated with cutscenes that last longer than the gameplay which completely ruins the pace during the jails when the game comes to a stop for just a cutscene of everyone standing still til i can move again, why not have them talk about it in the top right box while i move around, which is an ongoing issue that just gets tiring after the first jail but thankfully there's an option for me to skip cutscenes so I'm glad they put that lol.\n\n4.5. The Second Hot Spring Scene is self-explanatory, just not really all that funny after Persona 3 since that had a fun minigame with it.\n\n5. Why can i not move my camera as i am moving inside of a vent like in P5?\n\n6. Why can i not see my Showtime gauge/bar like how HP, SP and Ammo are shown in the UI instead of hoping to god i get a showtime to do DMG/Knock Down Midbosses that are objectivelly harder than the main bosses\n\n6.5 But it's Okay because nobody bothered to playtest Yusuke because he demolishes literally everything with his two hit combo no matter how strong the boss is to Physical\n\n7. Istg i feel like the AI in this game is how people see the AI in Persona 3 but instead this is worse than that because you don't have a tactics menu to have some control of your party so that you tell what each Party Members does to prioritize for you instead of them going headfirst dive into a modboss/boss and die out of nowhere, or even use their SP for no reason when i don't want them to which connects to my previous second issue, the main healers/support not healing Futaba when i want those character specifically to focus on support.\nIt's a real shame because i'm minding my own business in combat to then just suddenly realize two of my characters died while all of them were together and i'm out of items to revive them back and lose the fight countless times because of it.\n\n8. I don't know if it's because of the hardware I use since i own a Low End Laptop (little bit higher than the minimum requirements) o play games and play it on the lowest settings for it to run good ..but like, to my experience the game tends to softlock in the loading screen a couple of times especially when i go back in the Van so i have to press Alt + F4 to exit the game possibly losing a lot of progress that i haven't saved which is enfuriating since all the progress i made didn't matter because of this\n\nHere's the Positive that i have to say about it for my own experience:\n\nOverall my favourite parts about this game are the Combat (surprisingly after all i said), the two new characters: Sophia and Zenkichi, the Villains are sorta well better written with them having backstories instead of just being evil because they're a \"nasty\" adult and the god dang soundtrack, especially the ones in each area since to me they're overall the strongest part of this game making me not quitting or refunding it entirely, still pretty cool game i recommend a lot, not at full price because this doesn't deserve the $60 tag so get it during a sale\n\n7/10", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 980007736, "author": "29256019-c34a-3618-ab55-2a48dedff306", "date": "2022-01-31", "hours": 13, "content": "A must play - Me", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1977260900, "author": "c4be671a-78bb-3213-ac5e-cc9e0ca6dd69", "date": "2022-01-31", "hours": 126, "content": "I'm not exactly the most professional person to give my opinion obviously, and especially not someone who's played a ton of Persona outside 5 and it's spin-offs. But I'd say that this was an extremely fun experience. The story isn't all that complex or thought provoking and can be a tad generic, or even rehashed from the original at times. But every area has a good message and consistently interesting dialogue between the party members. Like the original, the cast is great. And the two new additions to the crew are very much welcome. Then combat, much like the story, is pretty simple. Many of the mechanics are the same as far as weaknesses, and how buffs affect you and the enemy go. However this time it's put in an entirely different system. Ditching the turn based combat of the Persona series and making it a stylized and unique version of the Dynasty Warriors format. And with that in mind I can concede that it isn't for everyone. But in my personal opinion, the combat is fun, fast paced, and certain battles can genuinely feel grand. Notably the various boss fights. All the animations are very good and stay true to the style. Each character has their own personal tech and that gives them even more diversity than just simply different elements and basic attacks. All the showtime attacks look great as expected, and all out attacks are just as satisfying. I don't even NEED to get started on the music. Every track is just so amazing, and best of all you never have to hear the same track over and over since every battle is randomized. All the remixes are fantastic, and a personal favourite of mine is counterstrike. But on that note, I'll complete this miniature review. I'm yet to play New Game Plus, as I am writing this almost immediately after completing the main story. But I can only assume it'll add some bonus content that add a little more spice into a second playthrough. Thank you for reading, and I hope if you buy this game you enjoy it as much as I.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 965757914, "author": "2cd5828f-2fff-342d-8ae4-3e32b8381f26", "date": "2022-02-01", "hours": 3, "content": "I loved playing this on the PS4, PS5 and Switch, I had to pick it up on Steam when it went on sale. \n\nThe gameplay is fantastic, and the story is a great follow-up to the Persona 5 game. I love spending time with my Phantom Thieves", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 334846130, "author": "c2fbfa3d-fe7e-3c29-ac85-8c37001d3f24", "date": "2022-02-02", "hours": 46, "content": "its good i guess\n", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 674144281, "author": "2fa0a869-6b10-3764-8db2-db2f440afcca", "date": "2022-02-03", "hours": 57, "content": "me when jack frost", "comments": 0, "source": "steam", "helpful": 20, "funny": 6, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 959148340, "author": "cef418ee-51f9-32e5-bfd4-010c3fced6f2", "date": "2022-02-05", "hours": 29, "content": "You have to have played Persona 5 to completely enjoy this game, bosses are sponges but manageable, get a lot of meds and sp cause you're gonna run out on both", "comments": 0, "source": "steam", "helpful": 4, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3357894074, "author": "b69a2dce-a3ca-34bd-9a95-79d3433de5c9", "date": "2022-02-05", "hours": 15, "content": "Another banger of an OST", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4097943805, "author": "a58e7e64-b01a-3a89-94d8-e24ce37e257d", "date": "2022-02-05", "hours": 135, "content": "please tell me you can fuck the cat", "comments": 0, "source": "steam", "helpful": 9, "funny": 14, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2067014254, "author": "3c9e6e30-e4a3-355a-9c84-3a9d4d59fe81", "date": "2022-02-06", "hours": 33, "content": "Please remaster Persona 3", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4042105810, "author": "7975c600-bf16-3b87-afee-233956e6663e", "date": "2022-02-07", "hours": 33, "content": "The fittest teenagers in the world canonically eat about 3500 calories of pure carbs per meal.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2322508223, "author": "f3c481ae-9480-36d3-967c-0aac509228bf", "date": "2022-02-08", "hours": 5, "content": "Awesome game wooooooooow :3", "comments": 0, "source": "steam", "helpful": 7, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3092037967, "author": "51e1f66b-5f10-3b3c-8bb8-2800d7c21740", "date": "2022-02-08", "hours": 67, "content": "A victory lap romp with the Phantom Thieves over summer vacation is what I was expecting but it forges its own identity with some really cool tricks up its sleeve. Surprised how well P5's combat adapts to musou gameplay though it can be a bit menu-heavy.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3682462502, "author": "d3aea7f4-130f-32c3-a3b4-f794807e2c35", "date": "2022-02-08", "hours": 41, "content": "\"YOU NEED THIS ONE?\"\n\"YOU'D LIKE TO EQUIP THAT?!\"\n\"THANKS FOR YOUR PATRONAGE!\"", "comments": 0, "source": "steam", "helpful": 40, "funny": 13, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1146578774, "author": "d46908a2-5878-3234-bed9-94bb7e4e7bef", "date": "2022-02-10", "hours": 20, "content": "in love with akira kurusu. 10/10 would kiss him on the lips.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4033385156, "author": "1a9314b2-9066-3876-801d-6ebfeab196bd", "date": "2022-02-11", "hours": 183, "content": "It's pretty good", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 520625280, "author": "25a4b340-55f5-3583-9127-9f45b4de6706", "date": "2022-02-12", "hours": 54, "content": "Awesome game <3", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3478492582, "author": "07f7a0bf-8d9e-3d38-ba00-e65868f74383", "date": "2022-02-12", "hours": 42, "content": "I RECOMMEND YOU PLAY THIS GAME ONCE YOU FINISH PERSONA 5/P5R!!! You'll enjoy the story a lot more.\n\nI thought the combat would be more like the Dynasty Warriors series but that wasn't the case. It ended it being more like the Final Fantasy 7 Remake but without the ATB meter (you can basically go crazy until you're out of SP) and I really like it.\n\nThere's a lot to like about the combat system. The snappy Persona swapping, mid-combat character swapping, instant magic casting, unique character-specific mechanics, air combos, it's pretty packed for an action game. Outside of combat, you just get your over world Persona 5 game albeit more limited compared to the base game with the removal of confidants. This time however instead of being stuck in Tokyo, you get to road trip around the country (I FUCKING LOVE ROAD TRIPS)!\n\nGoing into the character specific-mechanic, it actually makes your party feel diverse enough where you want to swap out and try different characters to explore their mechanics. It keeps the gameplay from feeling repetitive and the progression of these mechanics feels rewarding. Some of my favorites are Yusuke with his timed input counter and mash combos, Makoto riding her Motorcycle into enemies, and Joker insta-dash to enemies by shooting them.\n\nAlso this game is actually kinda hard if you don't go into a fight with the right team/spells so that's fun.", "comments": 0, "source": "steam", "helpful": 23, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2040553723, "author": "e24368c6-21d1-3523-9bc3-f039dfde5869", "date": "2022-02-13", "hours": 78, "content": "Poggers", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2374916237, "author": "7d8a4370-207e-3a18-9caa-0a77bd3e5b96", "date": "2022-02-14", "hours": 121, "content": "it was a game", "comments": 0, "source": "steam", "helpful": 3, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2338819523, "author": "270c84d1-cb2c-3f0b-baca-1f83c04138a9", "date": "2022-02-16", "hours": 85, "content": "makoto is the best.", "comments": 0, "source": "steam", "helpful": 56, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1342661132, "author": "fbe2d049-5ff9-3d7c-a10d-83ca9dd0b754", "date": "2022-02-19", "hours": 4, "content": "Persona 5 has JOKER so it is good, but what makes me kinda nervous is that the enemies are so BUFFED, Im not a dude that like to grind stuff. I DIDN'T EVEN KILLED A BOSS IN 4H OF GAMEPLAY! Morgana is fun to use, he is an convertible car like DABABY\n", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1681212831, "author": "5d27e791-e048-34c6-b77b-53d8bab3ee63", "date": "2022-02-19", "hours": 6, "content": "Great Fan-based Game.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4007540828, "author": "bc546619-be09-3921-968a-4894d30915f4", "date": "2022-02-20", "hours": 16, "content": "You know, all these reviews that are just copypastas and memes(or for this game. pleads of bringing P5R to PC) are getting me sick and tired. What about you hear a real review? I won't speak anything of the story as a. my playtime is low b. youd probably be looking at this from an outsider perspective.\n\nIs P5S worth it? First off, yes. Musou games get really fun once you get the hang of it and all the characters all have unique traits(except Morgana getting a fucking weak 1 damage battering ram move. Not cool Atlus.) and once it gets on a roll, the gameplay gets addicting. First off, the first jail is seriously a chore to get through and it may make it seem like there is nothing else to do. But they made the decision to bar all the side studff until you can get to your next jail.\n\nSecond off, I said it's worth it But only on a sale please. It may have a good gameplay loop but I find this to be a bit... lacking for its current normal price\n\nThird off, you may need to atleast have knowledge of PS's plot to get the story\n\nNext, the music is amazing and absolutely gets you in the mood to straight destroy\n\nThe game also has a semi open world aspect where you get to buy stuff so you can cook or get it ready for use. Also be sure to always talk to your teammates in the non-metaverse map if its a new day. They will usually harbor some loot for you.\n\nUmm... damn writing a long review is hard.", "comments": 0, "source": "steam", "helpful": 69, "funny": 2, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3699751127, "author": "eef5a02a-2109-30da-8ec0-4a8c6b181b23", "date": "2022-02-22", "hours": 13, "content": "Pls Persona 5 Royal for PC.....\n\n\n\nThanks for hearing my TED talk", "comments": 0, "source": "steam", "helpful": 116, "funny": 6, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3287502861, "author": "1b505605-fc79-3c99-be87-519f4c2a299c", "date": "2022-02-25", "hours": 50, "content": "id say so", "comments": 0, "source": "steam", "helpful": 4, "funny": 2, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2496135400, "author": "33f514bb-3f26-39de-8ae1-4f039411c5f0", "date": "2022-02-28", "hours": 122, "content": "royal pls", "comments": 0, "source": "steam", "helpful": 316, "funny": 6, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3724892575, "author": "b0d18f1d-d934-3966-a2c8-aa56c0d940db", "date": "2022-02-28", "hours": 63, "content": "This game is quite literally better than Persona 5 in a number of ways.\n\nIt's story is just Persona 5 but better. It's music is just Persona 5 but better. The dungeons feel more fun since you can actually walk around them quickly and actually DO them. The combat is insanely fun. Zenkichi and Sophia are amazingly written characters that solo Kasumi and Akechi, tenfold. Their characterisation being well-woven into the story is also amazing. The pacing is much better than Persona 5 being around 50 hours playtime instead of 100. \n\nIf you haven't played this game, DO IT. It is amazing. It is emotional. It is powerful. Everything is just better Persona 5 and you don't even need to play Persona 5 to understand the story or characters.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 931911315, "author": "a375e0fa-ec13-338c-b75c-840ec5ecdfad", "date": "2022-03-03", "hours": 24, "content": "i am gay", "comments": 0, "source": "steam", "helpful": 131, "funny": 37, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3749264573, "author": "931fe04d-fc99-3f4e-a379-9d5554397fe5", "date": "2022-03-09", "hours": 105, "content": "P5S is a decent spinoff. Think of it as persona 5 but half the budget. It's half as long, the story is half as ambitious, and the gameplay systems are half as detailed compared to persona 5. This game is far more focused on combat and action in general compared to persona 5. There is no confidant system in p5s for example. Overall, I'll give it a 7.5/10. Only recommended to P5 fans. Also, the game is way too pricey imo.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4086219159, "author": "fa7689cf-59c7-3c3e-a0d3-8e8bbc3c6136", "date": "2022-03-10", "hours": 29, "content": "good game, but the script is very cringe", "comments": 0, "source": "steam", "helpful": 1, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 834301371, "author": "4e215670-0c4a-30e5-8917-1c862a245fe2", "date": "2022-03-11", "hours": 59, "content": "You would think a spin off/sequel based on a popular franchise would end up being garbage but this is not the case. Persona 5 Strikers is a fun hack and slash that still has the charm of original game. The combat is fluid, story is alright but you have to  play the original to understand and the music is still great.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3015017102, "author": "dfad22c4-6454-328f-b6a5-7d2cf7cc7557", "date": "2022-03-11", "hours": 57, "content": "put royal on pc pls <3 \n\n\n\nthaks sean 4 gift", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 897653628, "author": "74f2ee7d-e357-3bc4-841c-be7cc4d080ab", "date": "2022-03-12", "hours": 81, "content": "So much love and care put into this game just like the rest of the persona 5 franchise.  Bravo!", "comments": 0, "source": "steam", "helpful": 7, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1475419821, "author": "a6f5d7c2-9ec9-3a05-a01d-2a93e32492bf", "date": "2022-03-12", "hours": 4, "content": "fire 🔥", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2987096205, "author": "21c96876-1d62-36ee-a4d7-ebc4caf928f0", "date": "2022-03-12", "hours": 94, "content": "get it its good", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3189575737, "author": "49cfeea4-33fc-3e95-a1fd-416c2cc28477", "date": "2022-03-13", "hours": 261, "content": "I've been playing this game for more than 250 hours, and I really like this game. I've been following the \"Persona\" series for a long time, I played the game and also watched the anime. so I can quickly adjust to the story and gameplay of Persona 5 Strikers. when comparing the game play Persona 3, Persona 4, & Persona 5, I prefer the game play Persona 5. \"so this is my assessment of this game subjectively\"\n\nI hope ATLUS and SEGA release \"Persona 5\" and \"Persona 5 Royal\" on Steam soon", "comments": 8, "source": "steam", "helpful": 36, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3415995135, "author": "75145e54-c82b-3f09-8360-f80b05198017", "date": "2022-03-13", "hours": 48, "content": "this soundtrack came with a free game, it's pretty good as well", "comments": 1, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4191004938, "author": "bae73c76-4162-339b-b3aa-a2fdbb4467f3", "date": "2022-03-13", "hours": 50, "content": "Recommend getting if you like Persona. P5S is pretty good, a little lacking in story and villain development with sometimes clunky controls.\n\nThis game is basically Atlus's experiment at doing an ARPG, it turned out 'okay'. Camera and lock targeting is pretty lack luster. You have to 'pause' a lot with persona/gun to just get an understanding of what is going on and switching between characters is a little clunky for an modern ARPG. On top of that, the battles are 'instanced' so you lose a little of the open-world-esque that you would expect from an ARPG.\n\nThough you have a calendar like past Personas, the game is a little more free form with the player choices. I actually found the lack of the 'confidant' aspect of character development made it feel pretty empty. Especially since the characters became pretty well developed in P5/P5R and almost none occurred in P5S.", "comments": 0, "source": "steam", "helpful": 10, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2528928967, "author": "cd791c92-fbb5-38b5-ac88-eacece2f2dcc", "date": "2022-03-14", "hours": 61, "content": "I'll admit, at first I didn't really care for it. Turn-based and confidants are persona ya know? but the more I played, the more I enjoyed the gang back together, the soundtrack, the mostly smooth combat.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 811891379, "author": "d6479876-831d-3bae-ae8f-b84abb13d152", "date": "2022-03-15", "hours": 12, "content": "It's Persona 5 - 2. The ability for Omega force to adapt their gameplay to any game astounds me.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2842148918, "author": "87335824-c1cf-3206-8521-4666da949abc", "date": "2022-03-15", "hours": 10, "content": "This is like Persona 5 part 2!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3669843922, "author": "c564d38b-23e3-3da4-ab85-18ae9e54ba2a", "date": "2022-03-15", "hours": 29, "content": "This is an easy recommendation for me. The story can sometimes drag and feel like it's progressing nowhere. At times, the gameplay can feel a little clunky and disjointed. However, ultimately I think these more minor issues can be overlooked in the grand scheme of the game. It was nice to see these characters brought back for another (much shorter) story. \nGetting past these moments where the story can drag is relatively easy, but the gameplay is harder to write off. In my eyes, the original Persona 5 practically perfected JRPG combat, but the Action RPG gameplay on display here is just serviceable. I eventually got used to pausing the action to use persona abilities, but I feel like getting used to this overall hindered my experience with the game. I didn't really have a problem with it, but it's worth noting that this game lacks a confidant system entirely, and the days progress as the story progresses.\nWhile maybe not being quite as good as the original game’s, the soundtrack is very well done. All of the new tracks were really memorable, and remixes of old tracks were too. The opening was great as well.\nThe story starts strong, drags on for a little while, then picks right back up as it climaxes. I think the payoff and experience are well worth putting up with these moments where the story drags. This road trip structure was really enjoyable and held the game together when the story was lacking. If you enjoyed these characters in Persona 5 and thought it’d be fun to go on a road trip with them, then look no further.\n", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4012795255, "author": "fd30f0e4-e1e8-3a38-af98-3cfff43d3af2", "date": "2022-03-15", "hours": 59, "content": "~ DIFFICULTY ~\n\n🔲 My 90 year old grandma could play it\n🔲 Easy\n✅ Normal\n🔲 Hard\n🔲 Dark Souls\n🔲 Understanding Dark Souls' story\n\n~ GRAPHICS ~\n\n🔲 MS Paint\n🔲 Bad\n🔲 Meh\n🔲 Graphics don't matter in this game\n✅ Good (nothing special)\n🔲 Beautiful\n🔲 Masterpiece\n\n~ MUSIC ~\n\n🔲 Bad\n🔲 Not special\n🔲 Good\n✅ Beautiful\n\n~ Audience ~\n\n🔲 Kids\n✅ Teens\n✅ Adults\n\n~ STORY ~\n\n🔲 Bad\n🔲 Text or Audio floating around\n🔲 Average\n✅ Good\n🔲 Amazing\n\n~ PRICE ~\n\n🔲 Free\n🔲 Cheap\n✅ Acceptable price\n🔲 Could be cheaper\n🔲 Overpriced\n🔲 Complete waste of money\n\n~ REQUIREMENTS ~\n\n🔲 You can run it on a microwave\n✅ Average\n🔲 High end\n🔲 NASA computer\n\n~ LENGTH ~\n\n🔲 Very Short (0 - 4 hours)\n🔲 Short (4 - 10 hours)\n🔲 Average (10-30 hours)\n✅ Long (30-50 hours) (if you go for everything in the game)\n🔲 Extremely long (50-100+ hours)\n🔲 No ending\n\n~ FUN ~\n\n🔲 I'd rather watch paint dry\n🔲 Hard to enjoy\n🔲 Repetitive\n✅ Actually pretty amusing\n🔲 The kind of fun you'll remember\n🔲 Ride of your life\n\n~ REPLAYABILITY ~\n\n🔲 It's a one-time experience\n🔲 Only for achievements\n✅ If you wait a few months/years\n🔲 Definitely\n🔲 Infinitely replayable\n\n~ Bugs ~\n🔲 Never heard of\n🔲 Minor bugs (But no game breaking bugs or anything like that)\n✅ Can get annoying\n🔲 ARK: Survival Evolved\n🔲 The game itself is a big terrarium for bugs\n\n~ WORTH BUYING ~\n\n🔲 No\n🔲 Wait for sale\n✅ Yes", "comments": 0, "source": "steam", "helpful": 84, "funny": 2, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3810853594, "author": "d9a68fe6-1c85-32d2-aeba-4d871731ce86", "date": "2022-03-16", "hours": 3, "content": "royal please", "comments": 0, "source": "steam", "helpful": 5, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1563565220, "author": "7a0648c6-2bdf-348e-93ce-a31b92dbe61d", "date": "2022-03-18", "hours": 9, "content": "Makoto best girl", "comments": 0, "source": "steam", "helpful": 27, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3461451564, "author": "1936a6d8-2323-3c52-913b-cffd690aa70c", "date": "2022-03-18", "hours": 85, "content": "i nutted like 16 times play it now", "comments": 0, "source": "steam", "helpful": 16, "funny": 4, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1641309373, "author": "45aa1b81-966d-3f7e-9a68-907bb69bd147", "date": "2022-03-19", "hours": 25, "content": "This is some good anime shit right here", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1409299203, "author": "c0eba609-644a-3b03-8791-51fc542797e3", "date": "2022-03-20", "hours": 73, "content": "No le llega ni a los talones al Persona 5 original y mucho menos al Royal pero no esta tan mal, es una secuela decente.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2277725816, "author": "36850796-964d-3541-9dd2-59828fe235cd", "date": "2022-03-21", "hours": 36, "content": "I have about 10 friends who have this on their wishlist, which reminds me that I should say, this is NOT Persona 5. This is sequel to the original, faithful in every way EXCEPT that it has a completely different mode of gameplay. It resembles Musou's, if you've played Dynasty Warriors OR Hyrule Warriors, you should know pretty quickly what you're getting into. I'm not a Fighting game man but you're gonna have to remember some button inputs.\n\nShould edit this as I go on. Initial impressions are good, except what in the hell are these keyboard bindings. The main character and Makoto are the only ones without free aiming, just why!?! If you're gonna play this with keyboard and mouse, I think an extra button or two on your mouse will help you out. if you have good reflexes, get the Level 1 Avenger skill (Not available initially), with which you can nullify an attack if you Phanton Dash towards that enemy at the perfect time; I tell you this as it brought me the most joy out of the combat in the game.\n\nI suffer slowdowns after a few battles, and had to reset the game. Later I found out it's caused by the Rendering Scale option. You also have to tab out of the game and come back for the slowdowns to go off or for the Rendering Scale option to apply. I change back to 1.3 Scale if I know there won't be battles for a while so it doesn't look so jagged (You cannot change this option in the middle of battle so don't plan to do it in the middle of the dungeon's boss fight before an hour of unpausable story!)\n\nAtlus, if you're not going to port the original Persona 5 OR Royal (The extended version) just yet, at the very least make your other releases up to par (Tip: Don't look up anything about the game if you wanna avoid spoilers, seriously, Youtube reviews should suffice, avoid comments or even Community Hub content).\n\nYou might want this mod, the letterbox border is just terrible, it looks like a bug: https://gamebanana.com/mods/288445", "comments": 0, "source": "steam", "helpful": 11, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1480832730, "author": "0eba2472-4f55-3e03-b132-d6103eea1a51", "date": "2022-03-22", "hours": 66, "content": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☐ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10\n\n\nIf you loved the PS3 ver. of Persona 5 then you'll definitely enjoy this one!\n\nGrab this review template here! 👉 https://vojtastruhar.github.io/steam-review-template/\n", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 603445114, "author": "b135490e-d08e-350c-b3da-c8fb9813d09c", "date": "2022-03-23", "hours": 20, "content": "I wish queen would Persona 5 \"Strike\" my cock and balls.", "comments": 2, "source": "steam", "helpful": 49, "funny": 18, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3227355752, "author": "9add41c7-bc76-3dff-b011-e085f20e60ee", "date": "2022-03-23", "hours": 69, "content": "Taught a middle aged man to cook. 10/10", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3340047392, "author": "5d071383-e56f-3636-a041-6b1a1bce446b", "date": "2022-03-23", "hours": 38, "content": "pretty terrible port but still fun, at least they actually did release it in pc\n\nits nothing like the original gameplay wise, its even less strategic but it works, its entertaining and some encounters can be quite tough if you are getting started", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 442269657, "author": "a8ca1486-c6da-33dc-abbb-5173a824d965", "date": "2022-03-24", "hours": 77, "content": "It really is P5R-2.\n\nPlease give us P5R meow.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1021313791, "author": "828e4ed6-c087-368c-b382-1a8f08f2d9cb", "date": "2022-03-26", "hours": 106, "content": "Good game... It gives a good conclusion to the phantom thieves. The only negative i can think of is the regression of Mona's character\n", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3331351251, "author": "025f211e-d6af-3070-83db-99febe90b1ba", "date": "2022-03-26", "hours": 44, "content": " No words needed. Game is great although a little bit overpriced I would say.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4043935818, "author": "a5f9b64e-505d-36d1-84e5-55c1e423656a", "date": "2022-03-26", "hours": 5, "content": "major persona vibes", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1282958100, "author": "3c840c88-6de0-3422-9939-50dab24aa9d7", "date": "2022-03-27", "hours": 48, "content": "Ryuji says th F word 10/10", "comments": 0, "source": "steam", "helpful": 2, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2109565910, "author": "b9e17d5a-5587-36cc-b977-0f89618cccb0", "date": "2022-03-27", "hours": 37, "content": "First boss is making me feel some type of way", "comments": 0, "source": "steam", "helpful": 9, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4285563048, "author": "4a20b276-c28c-367f-b49f-a0c311df4a03", "date": "2022-03-28", "hours": 90, "content": "Ann Takamaki", "comments": 0, "source": "steam", "helpful": 26, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2376998585, "author": "38f6d5d9-7bd7-3e78-b689-239c6ec3872e", "date": "2022-03-31", "hours": 44, "content": "Give us P5R, you cowards!", "comments": 0, "source": "steam", "helpful": 282, "funny": 17, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 269669775, "author": "37245202-28b9-3450-83b9-23bc1caa9cfa", "date": "2022-04-01", "hours": 73, "content": "The game is gud game. I like it rly much. Reccomendedd to evry1", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3301546545, "author": "3c44588f-9e29-3e1e-aa48-0d3772013101", "date": "2022-04-01", "hours": 60, "content": "good game", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 589600124, "author": "00100150-816f-3c5d-b088-5984c923775f", "date": "2022-04-05", "hours": 82, "content": "such a different feel from other persona games, and i adore it! I love the gameplay, it's dynamic and fun. The story is amazing, so far, the standards are met! Overall a really nice game and a nostalgic one for anyone missing the P5 characters.", "comments": 0, "source": "steam", "helpful": 11, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2910461806, "author": "8209f19b-2200-3dac-b56b-7baae14b92e2", "date": "2022-04-09", "hours": 68, "content": "Hee-ho!", "comments": 0, "source": "steam", "helpful": 27, "funny": 5, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1392285640, "author": "5ede7460-2012-3c21-a70e-b2d2848691c8", "date": "2022-04-12", "hours": 5, "content": "Ignore the hours, I have 100% this game and also done a ng+ playthrough on switch and OMG is this game so perfect. It is NOT just a spin-off, its a brilliant sequel to Persona 5, where in this case the villains are way more redeemable and makes the morality of what the Phantom Thieves do more questionable which is a question many players raised in the original game so it's cool to see it addressed. Also Zenkichi is my 2nd fav Persona 5 character and Sophia is also amazing character along all the other new ones such as Ichinose. And the gameplay is so fun and messing up with Persona builds is especially fun in this game. THis game is also very beautiful on PC and runs very well (atleast to my eyes) and even then is carried by the classic Persona 5 Style. Anyway a 10/10 game! And a must play!", "comments": 0, "source": "steam", "helpful": 8, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2056830848, "author": "729a8485-e76f-3ff1-8e49-eb420b2ddbb4", "date": "2022-04-20", "hours": 67, "content": "Mindless but fun. Feels like an actual RPG and not just a Warriors-style game with RPG elements, which was a pleasant surprise. Starting dragging a little near the end but not enough to sour the experience.\n\nStory is technically a direct sequel but I thought it was self-contained enough that anyone could enjoy it (assuming they don't care about spoilers for the previous game)", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2540460143, "author": "c011f1b6-df3c-38c4-a0a8-64b1c7d0eaf6", "date": "2022-04-20", "hours": 74, "content": "honestly i'd prefer royal on steam but this game isn't so bad, just takes a while to get used to the game if you aren't a huge fan of this genre.", "comments": 0, "source": "steam", "helpful": 21, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 57491371, "author": "28e2dd8a-465c-3b1a-b54f-3835740c6c9c", "date": "2022-04-21", "hours": 79, "content": "P5S is a good Hack-and-Slash that can be enjoyed by any players, be it existing Persona fans or new players.\n\nP5S is a direct continuation from the base game, Persona 5, but can be enjoyed even without experiencing the base game itself. This allows Persona fans to enjoy the story continuing from its original ending, but also allow for new players, experiencing the Persona series for the first time, to enjoy the game. The story isn't anything too great but is good enough for an enjoyable experience. The story is very linear, meaning the choices made by your character will have no impact towards the endings. The dialogue options only affects how the other characters will respond and could make for some funny interactions between characters. The character interactions are great and provides lots of humorous and some badass moments.\n\nThe gameplay is where it truly deviates from the usual Persona Series. All previous installations of the Persona franchise (Not including spinoffs like Arena or the Dancing games) were mainly Turn-Based JRPG, but P5S is a Hack and Slash. \nThis makes the game more fast-paced and action packed but could be a turn off for those who enjoy the strategy of Persona games. \n\nP5S is also significantly shorter as compared to the other Persona games. It took me 40+ hrs to clear the base game and could easily be cleared in a shorter amount of time as I took the time to do every requests and search every nook and cranny of each jail. Also there is still New Game+ to play which could easily take me an additional 20hrs or so. Making the total game time to be around 50-60hrs.\n\nOverall, I would give this game a solid 7/10. Gameplay is good but certain parts felt repetitive (especially farming Persona Points to fuse certain Personas in the later part of the game). Story was pretty so-so but the character interactions were great. I would recommend buying this game on a sale for anyone who enjoys Hack-and-Slash or are Persona Fans.\n\nEDIT: Took me an additional 25hrs to complete all achievements. Have yet to complete NG+ playthrough, but doubt I would finish it. It is still a fun game to me but to 100% it did not feel as fun as just completing the game on the first run. It lacked the replayability that all base Persona games have but the challenge that Merciless posed in the early stages of NG+ was indeed quite challenging. However, once you fused a few max stats Personas, the game becomes quite a breeze and just knowing how to use Status Ailments and Technical to your advantage to wipe through most bosses relatively easily. This does not change my rating of it as to 100% a game is more of a perfectionist or if the game is really one of your favorites. In my case, its just that I really enjoy the Persona series and just wanted to 100% it as I wait for other Persona ports that.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1482315056, "author": "c4e3cc73-9468-3a95-bdfc-04cbc26cbbb6", "date": "2022-04-21", "hours": 31, "content": "after playing this i no longer want to kill myself", "comments": 0, "source": "steam", "helpful": 66, "funny": 16, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2211807554, "author": "eefb08be-5ea2-36b9-b56b-d09877fc7eaf", "date": "2022-04-24", "hours": 6, "content": "The game goes straight to the story line, no character back stories, not trying to help futaba get off reddit and stop feeling sorry for herself.  Just good combat and music.", "comments": 0, "source": "steam", "helpful": 29, "funny": 6, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 98633159, "author": "4204f118-10ec-3aff-a53c-6c9e92f8c2c4", "date": "2022-04-27", "hours": 68, "content": "Part of the cult status Persona series!\n\nNot turn-based like most other Shin Megami Tensei games, but HacknSlash like Nier/DMC or similar. But, it fits the visual style of the predecessor Persona 5 perfectly. Also, playing P5 first is recommended, it contains the entire main cast and follows after the events of P5. Multiple story references to P5 too\n\nMusic and Visuals are A+ like you're used to\nFusion system like in the Persona series, but with roughly half as many Personas and skills.\nPlayable characters have different combat styles: buffing, fast/slow, status effects, etc.\nStory is similar to P5, writing quality is on par with most fanfiction. But, 90% voiced with great voice acting! Also in Japanese with English subtitles.\n\nMust buy for SMT fans. Also recommended for fans of Nier/DMC action games. If you're neither, check out some gameplay footage!", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2000507850, "author": "6be7560c-64ed-3f27-b0ee-85aaabd0c045", "date": "2022-04-29", "hours": 5, "content": "According to all known laws of aviation, there is no way that a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway. Because bees don’t care what humans think is impossible.” SEQ. 75 - “INTRO TO BARRY” INT. BENSON HOUSE - DAY ANGLE ON: Sneakers on the ground. Camera PANS UP to reveal BARRY BENSON’S BEDROOM ANGLE ON: Barry’s hand flipping through different sweaters in his closet. BARRY Yellow black, yellow black, yellow black, yellow black, yellow black, yellow black...oohh, black and yellow... ANGLE ON: Barry wearing the sweater he picked, looking in the mirror. BARRY (CONT’D) Yeah, let’s shake it up a little. He picks the black and yellow one. He then goes to the sink, takes the top off a CONTAINER OF HONEY, and puts some honey into his hair. He squirts some in his mouth and gargles. Then he takes the lid off the bottle, and rolls some on like deodorant. CUT TO: INT. BENSON HOUSE KITCHEN - CONTINUOUS Barry’s mother, JANET BENSON, yells up at Barry. JANET BENSON Barry, breakfast is ready! CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 1. INT. BARRY’S ROOM - CONTINUOUS BARRY Coming! SFX: Phone RINGING. Barry’s antennae vibrate as they RING like a phone. Barry’s hands are wet. He looks around for a towel. BARRY (CONT’D) Hang on a second! He wipes his hands on his sweater, and pulls his antennae down to his ear and mouth. BARRY (CONT'D) Hello? His best friend, ADAM FLAYMAN, is on the other end. ADAM Barry? BARRY Adam? ADAM Can you believe this is happening? BARRY Can’t believe it. I’ll pick you up. Barry sticks his stinger in a sharpener. SFX: BUZZING AS HIS STINGER IS SHARPENED. He tests the sharpness with his finger. SFX: Bing. BARRY (CONT’D) Looking sharp. ANGLE ON: Barry hovering down the hall, sliding down the staircase bannister. Barry’s mother, JANET BENSON, is in the kitchen. JANET BENSON Barry, why don’t you use the stairs? Your father paid good money for those. \"Bee Movie\" - JS REVISIONS 8/13/07 2. BARRY Sorry, I’m excited. Barry’s father, MARTIN BENSON, ENTERS. He’s reading a NEWSPAPER with the HEADLINE, “Queen gives birth to thousandtuplets: Resting Comfortably.” MARTIN BENSON Here’s the graduate. We’re very proud of you, Son. And a perfect report card, all B’s. JANET BENSON (mushing Barry’s hair) Very proud. BARRY Ma! I’ve got a thing going here. Barry re-adjusts his hair, starts to leave. JANET BENSON You’ve got some lint on your fuzz. She picks it off. BARRY Ow, that’s me! MARTIN BENSON Wave to us. We’ll be in row 118,000. Barry zips off. BARRY Bye! JANET BENSON Barry, I told you, stop flying in the house! CUT TO: SEQ. 750 - DRIVING TO GRADUATION EXT. BEE SUBURB - MORNING A GARAGE DOOR OPENS. Barry drives out in his CAR. \"Bee Movie\" - JS REVISIONS 8/13/07 3. ANGLE ON: Barry’s friend, ADAM FLAYMAN, standing by the curb. He’s reading a NEWSPAPER with the HEADLINE: “Frisbee Hits Hive: Internet Down. Bee-stander: “I heard a sound, and next thing I knew...wham-o!.” Barry drives up, stops in front of Adam. Adam jumps in. BARRY Hey, Adam. ADAM Hey, Barry. (pointing at Barry’s hair) Is that fuzz gel? BARRY A little. It’s a special day. Finally graduating. ADAM I never thought I’d make it. BARRY Yeah, three days of grade school, three days of high school. ADAM Those were so awkward. BARRY Three days of college. I’m glad I took off one day in the middle and just hitchhiked around the hive. ADAM You did come back different. They drive by a bee who’s jogging. ARTIE Hi Barry! BARRY (to a bee pedestrian) Hey Artie, growing a mustache? Looks good. Barry and Adam drive from the suburbs into the city. ADAM Hey, did you hear about Frankie? \"Bee Movie\" - JS REVISIONS 8/13/07 4. BARRY Yeah. ADAM You going to his funeral? BARRY No, I’m not going to his funeral. Everybody knows you sting someone you die, you don’t waste it on a squirrel. He was such a hot head. ADAM Yeah, I guess he could’ve just gotten out of the way. The DRIVE through a loop de loop. BARRY AND ADAM Whoa...Whooo...wheee!! ADAM I love this incorporating the amusement park right into our regular day. BARRY I guess that’s why they say we don’t need vacations. CUT TO: SEQ. 95 - GRADUATION EXT. GRADUATION CEREMONY - CONTINUOUS Barry and Adam come to a stop. They exit the car, and fly over the crowd to their seats. * BARRY * (re: graduation ceremony) * Boy, quite a bit of pomp...under * the circumstances. * They land in their seats. BARRY (CONT’D) Well Adam, today we are men. \"Bee Movie\" - JS REVISIONS 8/13/07 5. ADAM We are. BARRY Bee-men. ADAM Amen! BARRY Hallelujah. Barry hits Adam’s forehead. Adam goes into the rapture. An announcement comes over the PA. ANNOUNCER (V.O) Students, faculty, distinguished bees...please welcome, Dean Buzzwell. ANGLE ON: DEAN BUZZWELL steps up to the podium. The podium has a sign that reads: “Welcome Graduating Class of:”, with train-station style flipping numbers after it. BUZZWELL Welcome New Hive City graduating class of... The numbers on the podium change to 9:15. BUZZWELL (CONT’D) ...9:15. (he clears his throat) And that concludes our graduation ceremonies. And begins your career at Honex Industries. BARRY Are we going to pick our job today? ADAM I heard it’s just orientation. The rows of chairs change in transformer-like mechanical motion to Universal Studios type tour trams. Buzzwell walks off stage. BARRY (re: trams) Whoa, heads up! Here we go. \"Bee Movie\" - JS REVISIONS 8/13/07 6. SEQ. 125 - “FACTORY” FEMALE VOICE (V.O) Keep your hands and antennas inside the tram at all times. (in Spanish) Dejen las manos y antennas adentro del tram a todos tiempos. BARRY I wonder what it’s going to be like? ADAM A little scary. Barry shakes Adam. BARRY AND ADAM AAHHHH! The tram passes under SIGNS READING: “Honex: A Division of Honesco: A Part of the Hexagon Group.” TRUDY Welcome to Honex, a division of Honesco, and a part of the Hexagon group. BARRY This is it! The Honex doors OPEN, revealing the factory. BARRY (CONT’D) Wow. TRUDY We know that you, as a bee, have worked your whole life to get to the point where you can work for your whole life. Honey begins when our valiant pollen jocks bring the nectar to the hive where our top secret formula is automatically color-corrected, scent adjusted and bubble contoured into this... Trudy GRABS a TEST TUBE OF HONEY from a technician. \"Bee Movie\" - JS REVISIONS 8/13/07 7. TRUDY (CONT’D) ...soothing, sweet syrup with its distinctive golden glow, you all know as... EVERYONE ON THE TRAM (in unison) H-o-n-e-y. Trudy flips the flask into the crowd, and laughs as they all scramble for it. ANGLE ON: A GIRL BEE catching the honey. ADAM (sotto) That girl was hot. BARRY (sotto) She’s my cousin. ADAM She is? BARRY Yes, we’re all cousins. ADAM Right. You’re right. TRUDY At Honex, we also constantly strive to improve every aspect of bee existence. These bees are stress testing a new helmet technology. ANGLE ON: A STUNT BEE in a HELMET getting hit with a NEWSPAPER, then a SHOE, then a FLYSWATTER. He gets up, and gives a “thumb’s up”. The graduate bees APPLAUD. ADAM (re: stunt bee) What do you think he makes? BARRY Not enough. TRUDY And here we have our latest advancement, the Krelman. \"Bee Movie\" - JS REVISIONS 8/13/07 8. BARRY Wow, what does that do? TRUDY Catches that little strand of honey that hangs after you pour it. Saves us millions. ANGLE ON: The Krelman machine. Bees with hand-shaped hats on, rotating around a wheel to catch drips of honey. Adam’s hand shoots up. ADAM Can anyone work on the Krelman? TRUDY Of course. Most bee jobs are small ones. But bees know that every small job, if it’s done well, means a lot. There are over 3000 different bee occupations. But choose carefully, because you’ll stay in the job that you pick for the rest of your life. The bees CHEER. ANGLE ON: Barry’s smile dropping slightly. BARRY The same job for the rest of your life? I didn’t know that. ADAM What’s the difference? TRUDY And you’ll be happy to know that bees as a species haven’t", "comments": 0, "source": "steam", "helpful": 4, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 443298516, "author": "e2dee842-3669-373f-98c3-1d7a63449bf5", "date": "2022-04-30", "hours": 36, "content": "good game. bring P5R to steam", "comments": 0, "source": "steam", "helpful": 200, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 929673297, "author": "722ea0a0-3d9d-3a64-bbae-21805d40e534", "date": "2022-04-30", "hours": 46, "content": "Goofy ah game", "comments": 0, "source": "steam", "helpful": 3, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2036462058, "author": "53b6d41f-bf20-3153-9908-8d2e21c64af2", "date": "2022-05-02", "hours": 13, "content": "sex", "comments": 0, "source": "steam", "helpful": 58, "funny": 14, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3315911751, "author": "92387e58-1750-31b8-8dce-8159ae535950", "date": "2022-05-05", "hours": 33, "content": "The game is recommended for fans and for the ones that completed the first Persona 5 game. The story and gameplay is a bit slow at the start but things get interesting as the game progress.", "comments": 0, "source": "steam", "helpful": 5, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4034815203, "author": "2d5952ba-8d2b-3acc-8402-b5afe86e86b1", "date": "2022-05-06", "hours": 35, "content": "If your name is Sophie, it's a ~30 hour experience of the Persona 5 cast telling you how cool you are.\n\nAlso the new Phantom Thief is voiced by Bunger. What more could you possibly want", "comments": 0, "source": "steam", "helpful": 4, "funny": 1, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 59601665, "author": "1300507c-739c-3578-b5a5-249bbcce777e", "date": "2022-05-07", "hours": 8, "content": "Good game, Persona 5 Royal PC port when?", "comments": 0, "source": "steam", "helpful": 74, "funny": 5, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4086698817, "author": "11e30027-0c51-3437-8fcf-883661f7b77b", "date": "2022-05-08", "hours": 36, "content": "After spending 103 hours in Persona 5 Royal on the PS4 (PC port PLEASE), I breezed through Persona 5 Strikers in a measly 35 or so hours. \n\nWhile P5R is a turn based RPG with heavy social elements, P5S is an action game through and through with most of the RPG elements and social elements slimmed considerably or completely removed. It is still a hell of a lot of fun though. The combat against mobs can get old but the boss fights (of which there are plenty) are where the combat really shines and shows how excellent it is.\n\nThe story is a sequel to P5R and while the main narrative isn't nearly as engaging as the previous game's story (though still fun), the characters, both returning and new are just as excellent as always. They are what make the Persona 5 games so memorable and fun and they really shine here - P5R was their origin story and P5S is them getting to go on a new adventure already knowing each other. \n\nAnd that MUSIC...this soundtrack is amazing yall. Hard to not wanna punch something in the face when Daredevil starts playing.\n\nI will be saving my remaining side content (which is mostly just extra boss battles and finishing the persona registry) for a NG+ run down the road, but I am eager to return to this game sometime. \n", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2647432585, "author": "d5667507-d1b0-3827-86a9-35fc61c3061f", "date": "2022-05-12", "hours": 27, "content": "This is basically just a sequel to Persona 5, set half a year after the events that took place in the game, and I would only play Strikers if you know the entire Persona 5 story. This is a pretty good sequel, and I recommend anyone that completed Persona 5 to buy this if you want more of the Phantom Thieves, and see more adventures from them, the only problem I have is...\n\nAtlus chose to port this, and not Royal. feelsbadman", "comments": 0, "source": "steam", "helpful": 39, "funny": 3, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2492252957, "author": "ddccce0d-e88e-3149-b3c0-ec8d3afd6467", "date": "2022-05-13", "hours": 172, "content": "Highly recommend for me. It has high playability and still have great BGM,storyline,graphics etc. The story showed society issues realistically and it's also thought-provoking. Using Mosou mode with persona skills is special. Risky mode is quite challenging. I don't suppose it ended the story in emotional way. Maybe i'm really get into the game so i moved to tears while the ending. Really enjoy this game.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3072672848, "author": "0834f3b0-610d-3f36-87db-a506393772d8", "date": "2022-05-13", "hours": 9, "content": "Good game.  Miss the life sim part of the traditional games, and went in expecting that, so a bit disapointed, but a solid game.  Would recommend playing the original Persona 5, but not required to figure out the story, though you miss out on them all meeting and their bonding, so highly recommended.  I think it's time for Atlus to port Persona 5 Royal to PC.  (Oh, you don't need to play Royal version to enjoy this, as none of the Royal version's changes are cannon to this game.)", "comments": 0, "source": "steam", "helpful": 3, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1483018800, "author": "e33db8b7-efb9-3904-96f4-8cd455729c3a", "date": "2022-05-15", "hours": 67, "content": "Disappointed after finding out P5S is NOT a musou game at all (since omega force was involved in the development anyone would expect it); Its literally persona 5 but instead of turn based combat, each enemy encounter turns into a mini musou battle.\n\nThe game is amazing tho, they reused every asset from p5 and it feels so good to comeback to this world years later.", "comments": 0, "source": "steam", "helpful": 9, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1793915235, "author": "fda70340-0849-3f93-aefa-3e95e71bb712", "date": "2022-05-16", "hours": 57, "content": "Put Persona 5 Royal on PC", "comments": 0, "source": "steam", "helpful": 34, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1342032890, "author": "7ec99ecf-e3d3-3030-8a03-b37d5b8db34c", "date": "2022-05-19", "hours": 71, "content": "Good game. The story's over but I'm not over it. Full review after 100% achievements. Deserves the justice", "comments": 0, "source": "steam", "helpful": 4, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 1745336988, "author": "709435bf-896a-37df-8a99-1ca1193185c1", "date": "2022-05-19", "hours": 3, "content": "I've bought this game on three different systems, no regrets.  Combat, visuals, action, story.\n\nAnything Persona 5 touches is gold and I'm completely biased about it.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 3859841434, "author": "78986914-c376-32ca-ab33-e38381fcbdb8", "date": "2022-05-20", "hours": 240, "content": "Never cease to amaze me \ni give it lif tre out of 10", "comments": 1, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 4124509959, "author": "a6b45f88-b1bf-3c71-9738-1ed61cb27e3f", "date": "2022-05-26", "hours": 26, "content": "Much faster Persona 5 with new fighting and story. Simply good.", "comments": 0, "source": "steam", "helpful": 2, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 2328996322, "author": "540c18c6-3e1b-38b3-9a6a-7409d9977603", "date": "2022-05-27", "hours": 28, "content": "This isn't devil may cry wtf", "comments": 0, "source": "steam", "helpful": 5, "funny": 4, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}, {"id": 566188942, "author": "e1fa173c-71a9-38c6-a4ff-b50591705fab", "date": "2022-05-29", "hours": 58, "content": "I managed to pick this game up on Humble bundle sales for a cheap price (other wise I wouldn't have picked this up).  I have to admit despite not playing P5 fully (yet did catch up on playthoughs) this game is actually really good.\n\nAs far as I can tell this is a continuation of the original P5 and not Royal, and despite that I am glad to got lucky to pick this up!\n\nSo the first thing is the combat compared to the normal Persona games is a lot more fluent and more hack n slash, which surprisingly works so well (to the point I'd actually like to see more like this), however 1 thing I dislike is hiding stuff behind post-game (there's achievements I cannot get because of this, me mad).\n\nSPOILERS:\n\nIt adds 2 more additional playable characters, and actually gives them character development through the game, where one cuts off after a certain point. \n\nI was able to do the main game + all side missions available (during the main game) and get to level 77 within my whole play time (58 hours as of this review).\n\nLegit cannot wait for a port of P5 or more persona games on steam. Atlus pls giv.", "comments": 0, "source": "steam", "helpful": 1, "funny": 0, "recommended": true, "franchise": null, "gameName": "Persona® 5 Strikers"}]